;******************************************************************************
;* TI ARM C/C++ Codegen                                        PC v18.1.4.LTS *
;* Date/Time created: Sun Mar  1 10:13:34 2020                                *
;******************************************************************************
	.compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embedded_constants=on --endian=little --float_support=FPv4SPD16 --hll_source=on --object_format=elf --silicon_version=7M4 --symdebug:dwarf --symdebug:dwarf_version=3 --unaligned_access=on 
	.thumb

$C$DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr $C$DW$CU, DW_AT_name("../main.c")
	.dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v18.1.4.LTS Copyright (c) 1996-2018 Texas Instruments Incorporated")
	.dwattr $C$DW$CU, DW_AT_TI_version(0x01)
	.dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\pante\Desktop\psp_encrypt\aes\performance-evaluation\Debug")

$C$DW$1	.dwtag  DW_TAG_subprogram
	.dwattr $C$DW$1, DW_AT_name("Timer32_getValue")
	.dwattr $C$DW$1, DW_AT_TI_symbol_name("Timer32_getValue")
	.dwattr $C$DW$1, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1, DW_AT_declaration
	.dwattr $C$DW$1, DW_AT_external
	.dwattr $C$DW$1, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_2_40_00_10/source/ti/devices/msp432p4xx/driverlib/timer32.h")
	.dwattr $C$DW$1, DW_AT_decl_line(0xb4)
	.dwattr $C$DW$1, DW_AT_decl_column(0x11)
$C$DW$2	.dwtag  DW_TAG_formal_parameter

	.dwpsn	file "../main.c",line 248,column 10,is_stmt,isa 1
        ADD       V3, V3, A1            ; [DPU_V7M3_PIPE] |248| 
	.dwpsn	file "../main.c",line 246,column 16,is_stmt,isa 1
        BNE       ||$C$L6||             ; [DPU_V7M3_PIPE] |246| 
        ; BRANCHCC OCCURS {||$C$L6||}    ; [] |246| 
;* --------------------------------------------------------------------------*
	.dwpsn	file "../main.c",line 251,column 6,is_stmt,isa 1
        MOVS      A1, #10               ; [DPU_V7M3_PIPE] |251| 
        SDIV      A2, V3, A1            ; [DPU_V7M3_PIPE] |251| 
        ADR       A1, $C$SL2            ; [DPU_V7M3_PIPE] |251| 
$C$DW$448	.dwtag  DW_TAG_TI_branch
	.dwattr $C$DW$448, DW_AT_low_pc(0x00)
	.dwattr $C$DW$448, DW_AT_name("printf")
	.dwattr $C$DW$448, DW_AT_TI_call

        BL        printf                ; [DPU_V7M3_PIPE] |251| 
        ; CALL OCCURS {printf }          ; [] |251| 
        ADD       V2, SP, #772          ; [DPU_V7M3_PIPE] 
	.dwpsn	file "../main.c",line 254,column 17,is_stmt,isa 1
        MOVS      V4, #64               ; [DPU_V7M3_PIPE] |254| 
;* --------------------------------------------------------------------------*
;*   BEGIN LOOP ||$C$L7||
;*
;*   Loop source line                : 254
;*   Loop closing brace source line  : 256
;*   Known Minimum Trip Count        : 64
;*   Known Maximum Trip Count        : 64
;*   Known Max Trip Count Factor     : 64
;* --------------------------------------------------------------------------*
||$C$L7||:    
	.dwpsn	file "../main.c",line 255,column 9,is_stmt,isa 1
        LDR       A1, [V2], #-4         ; [DPU_V7M3_PIPE] |255| 
        LSRS      A2, A1, #31           ; [DPU_V7M3_PIPE] |255| 
        ADR       A1, $C$SL3            ; [DPU_V7M3_PIPE] |255| 
$C$DW$449	.dwtag  DW_TAG_TI_branch
	.dwattr $C$DW$449, DW_AT_low_pc(0x00)
	.dwattr $C$DW$449, DW_AT_name("printf")
	.dwattr $C$DW$449, DW_AT_TI_call

        BL        printf                ; [DPU_V7M3_PIPE] |255| 
        ; CALL OCCURS {printf }          ; [] |255| 
	.dwpsn	file "../main.c",line 254,column 17,is_stmt,isa 1
        SUBS      V4, V4, #1            ; [DPU_V7M3_PIPE] |254| 
        BNE       ||$C$L7||             ; [DPU_V7M3_PIPE] |254| 
        ; BRANCHCC OCCURS {||$C$L7||}    ; [] |254| 
;* --------------------------------------------------------------------------*
	.dwpsn	file "../main.c",line 257,column 5,is_stmt,isa 1
        ADR       A1, $C$SL4            ; [DPU_V7M3_PIPE] |257| 
$C$DW$450	.dwtag  DW_TAG_TI_branch
	.dwattr $C$DW$450, DW_AT_low_pc(0x00)
	.dwattr $C$DW$450, DW_AT_name("printf")
	.dwattr $C$DW$450, DW_AT_TI_call

        BL        printf                ; [DPU_V7M3_PIPE] |257| 
        ; CALL OCCURS {printf }          ; [] |257| 
        ADD       SP, SP, #508          ; [DPU_V7M3_PIPE] 
	.dwcfi	cfa_offset, 332
        MOV       A1, V1                ; [DPU_V7M3_PIPE] |257| 
        ADD       SP, SP, #312          ; [DPU_V7M3_PIPE] 
	.dwcfi	cfa_offset, 20
$C$DW$451	.dwtag  DW_TAG_TI_branch
	.dwattr $C$DW$451, DW_AT_low_pc(0x00)
	.dwattr $C$DW$451, DW_AT_TI_return

        POP       {V1, V2, V3, V4, PC}  ; [DPU_V7M3_PIPE] 
	.dwcfi	cfa_offset, 0
	.dwcfi	restore_reg, 7
	.dwcfi	restore_reg, 6
	.dwcfi	restore_reg, 5
	.dwcfi	restore_reg, 4
        ; BRANCH OCCURS                  ; [] 
	.dwattr $C$DW$434, DW_AT_TI_end_file("../main.c")
	.dwattr $C$DW$434, DW_AT_TI_end_line(0x1c7)
	.dwattr $C$DW$434, DW_AT_TI_end_column(0x01)
	.dwendentry
	.dwendtag $C$DW$434

;******************************************************************************
;* STRINGS                                                                    *
;******************************************************************************
	.sect	".text"
	.align	4
||$C$SL1||:	.string	"cycles = %4d ",10,0
	.align	4
||$C$SL2||:	.string	"mean cycle = %d",10,0
	.align	4
||$C$SL3||:	.string	"%1x",0
	.align	4
||$C$SL4||:	.string	10,0
;******************************************************************************
;* CONSTANT TABLE                                                             *
;******************************************************************************
	.sect	".text"
	.align	4
||$C$CON3||:	.bits	1073790976,32
;*****************************************************************************
;* UNDEFINED EXTERNAL REFERENCES                                             *
;*****************************************************************************
	.global	Timer32_getValue
	.global	Timer32_initModule
	.global	Timer32_startTimer
	.global	printf

;******************************************************************************
;* BUILD ATTRIBUTES                                                           *
;******************************************************************************
	.battr "TI", Tag_File, 1, Tag_LPM_INFO(1)
	.battr "TI", Tag_File, 1, Tag_PORTS_INIT_INFO("012345678901ABCDEFGHIJ01111111111000000000000000000000000000000000")
	.battr "aeabi", Tag_File, 1, Tag_ABI_PCS_wchar_t(2)
	.battr "aeabi", Tag_File, 1, Tag_ABI_FP_rounding(0)
	.battr "aeabi", Tag_File, 1, Tag_ABI_FP_denormal(0)
	.battr "aeabi", Tag_File, 1, Tag_ABI_FP_exceptions(0)
	.battr "aeabi", Tag_File, 1, Tag_ABI_FP_number_model(1)
	.battr "aeabi", Tag_File, 1, Tag_ABI_enum_size(1)
	.battr "aeabi", Tag_File, 1, Tag_ABI_optimization_goals(0)
	.battr "aeabi", Tag_File, 1, Tag_ABI_FP_optimization_goals(0)
	.battr "TI", Tag_File, 1, Tag_Bitfield_layout(0)
	.battr "aeabi", Tag_File, 1, Tag_ABI_VFP_args(3)
	.battr "TI", Tag_File, 1, Tag_FP_interface(1)

;******************************************************************************
;* TYPE INFORMATION                                                           *
;******************************************************************************

$C$DW$T$21	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$21, DW_AT_byte_size(0x10)
$C$DW$452	.dwtag  DW_TAG_member
	.dwattr $C$DW$452, DW_AT_type(*$C$DW$T$14)
	.dwattr $C$DW$452, DW_AT_name("__max_align1")
	.dwattr $C$DW$452, DW_AT_TI_symbol_name("__max_align1")
	.dwattr $C$DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$452, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$452, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.4.LTS/include/sys/_types.h")
	.dwattr $C$DW$452, DW_AT_decl_line(0x70)
	.dwattr $C$DW$452, DW_AT_decl_column(0x0c)

$C$DW$453	.dwtag  DW_TAG_member
	.dwattr $C$DW$453, DW_AT_type(*$C$DW$T$18)
	.dwattr $C$DW$453, DW_AT_name("__max_align2")
	.dwattr $C$DW$453, DW_AT_TI_symbol_name("__max_align2")
	.dwattr $C$DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$453, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$453, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.4.LTS/include/sys/_types.h")
	.dwattr $C$DW$453, DW_AT_decl_line(0x71)
	.dwattr $C$DW$453, DW_AT_decl_column(0x0e)

	.dwattr $C$DW$T$21, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.4.LTS/include/sys/_types.h")
	.dwattr $C$DW$T$21, DW_AT_decl_line(0x6f)
	.dwattr $C$DW$T$21, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$21

$C$DW$T$206	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$206, DW_AT_name("__max_align_t")
	.dwattr $C$DW$T$206, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$T$206, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$206, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.4.LTS/include/sys/_types.h")
	.dwattr $C$DW$T$206, DW_AT_decl_line(0x72)
	.dwattr $C$DW$T$206, DW_AT_decl_column(0x03)


$C$DW$T$24	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$24, DW_AT_byte_size(0x04)
$C$DW$454	.dwtag  DW_TAG_member
	.dwattr $C$DW$454, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$454, DW_AT_name("_reserved0")
	.dwattr $C$DW$454, DW_AT_TI_symbol_name("_reserved0")
	.dwattr $C$DW$454, DW_AT_bit_offset(0x10)
	.dwattr $C$DW$454, DW_AT_bit_size(0x10)
	.dwattr $C$DW$454, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$454, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$454, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$454, DW_AT_decl_line(0x105)
	.dwattr $C$DW$454, DW_AT_decl_column(0x0e)

$C$DW$455	.dwtag  DW_TAG_member
	.dwattr $C$DW$455, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$455, DW_AT_name("GE")
	.dwattr $C$DW$455, DW_AT_TI_symbol_name("GE")
	.dwattr $C$DW$455, DW_AT_bit_offset(0x0c)
	.dwattr $C$DW$455, DW_AT_bit_size(0x04)
	.dwattr $C$DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$455, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$455, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$455, DW_AT_decl_line(0x106)
	.dwattr $C$DW$455, DW_AT_decl_column(0x0e)

$C$DW$456	.dwtag  DW_TAG_member
	.dwattr $C$DW$456, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$456, DW_AT_name("_reserved1")
	.dwattr $C$DW$456, DW_AT_TI_symbol_name("_reserved1")
	.dwattr $C$DW$456, DW_AT_bit_offset(0x05)
	.dwattr $C$DW$456, DW_AT_bit_size(0x07)
	.dwattr $C$DW$456, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$456, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$456, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$456, DW_AT_decl_line(0x107)
	.dwattr $C$DW$456, DW_AT_decl_column(0x0e)

$C$DW$457	.dwtag  DW_TAG_member
	.dwattr $C$DW$457, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$457, DW_AT_name("Q")
	.dwattr $C$DW$457, DW_AT_TI_symbol_name("Q")
	.dwattr $C$DW$457, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$457, DW_AT_bit_size(0x01)
	.dwattr $C$DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$457, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$457, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$457, DW_AT_decl_line(0x108)
	.dwattr $C$DW$457, DW_AT_decl_column(0x0e)

$C$DW$458	.dwtag  DW_TAG_member
	.dwattr $C$DW$458, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$458, DW_AT_name("V")
	.dwattr $C$DW$458, DW_AT_TI_symbol_name("V")
	.dwattr $C$DW$458, DW_AT_bit_offset(0x03)
	.dwattr $C$DW$458, DW_AT_bit_size(0x01)
	.dwattr $C$DW$458, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$458, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$458, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$458, DW_AT_decl_line(0x109)
	.dwattr $C$DW$458, DW_AT_decl_column(0x0e)

$C$DW$459	.dwtag  DW_TAG_member
	.dwattr $C$DW$459, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$459, DW_AT_name("C")
	.dwattr $C$DW$459, DW_AT_TI_symbol_name("C")
	.dwattr $C$DW$459, DW_AT_bit_offset(0x02)
	.dwattr $C$DW$459, DW_AT_bit_size(0x01)
	.dwattr $C$DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$459, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$459, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$459, DW_AT_decl_line(0x10a)
	.dwattr $C$DW$459, DW_AT_decl_column(0x0e)

$C$DW$460	.dwtag  DW_TAG_member
	.dwattr $C$DW$460, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$460, DW_AT_name("Z")
	.dwattr $C$DW$460, DW_AT_TI_symbol_name("Z")
	.dwattr $C$DW$460, DW_AT_bit_offset(0x01)
	.dwattr $C$DW$460, DW_AT_bit_size(0x01)
	.dwattr $C$DW$460, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$460, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$460, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$460, DW_AT_decl_line(0x10b)
	.dwattr $C$DW$460, DW_AT_decl_column(0x0e)

$C$DW$461	.dwtag  DW_TAG_member
	.dwattr $C$DW$461, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$461, DW_AT_name("N")
	.dwattr $C$DW$461, DW_AT_TI_symbol_name("N")
	.dwattr $C$DW$461, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$461, DW_AT_bit_size(0x01)
	.dwattr $C$DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$461, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$461, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$461, DW_AT_decl_line(0x10c)
	.dwattr $C$DW$461, DW_AT_decl_column(0x0e)

	.dwattr $C$DW$T$24, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$T$24, DW_AT_decl_line(0x104)
	.dwattr $C$DW$T$24, DW_AT_decl_column(0x03)
	.dwendtag $C$DW$T$24


$C$DW$T$25	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$25, DW_AT_byte_size(0x04)
$C$DW$462	.dwtag  DW_TAG_member
	.dwattr $C$DW$462, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$462, DW_AT_name("ISR")
	.dwattr $C$DW$462, DW_AT_TI_symbol_name("ISR")
	.dwattr $C$DW$462, DW_AT_bit_offset(0x17)
	.dwattr $C$DW$462, DW_AT_bit_size(0x09)
	.dwattr $C$DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$462, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$462, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$462, DW_AT_decl_line(0x12c)
	.dwattr $C$DW$462, DW_AT_decl_column(0x0e)

$C$DW$463	.dwtag  DW_TAG_member
	.dwattr $C$DW$463, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$463, DW_AT_name("_reserved0")
	.dwattr $C$DW$463, DW_AT_TI_symbol_name("_reserved0")
	.dwattr $C$DW$463, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$463, DW_AT_bit_size(0x17)
	.dwattr $C$DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$463, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$463, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$463, DW_AT_decl_line(0x12d)
	.dwattr $C$DW$463, DW_AT_decl_column(0x0e)

	.dwattr $C$DW$T$25, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$T$25, DW_AT_decl_line(0x12b)
	.dwattr $C$DW$T$25, DW_AT_decl_column(0x03)
	.dwendtag $C$DW$T$25


$C$DW$T$26	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$26, DW_AT_byte_size(0x04)
$C$DW$464	.dwtag  DW_TAG_member
	.dwattr $C$DW$464, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$464, DW_AT_name("ISR")
	.dwattr $C$DW$464, DW_AT_TI_symbol_name("ISR")
	.dwattr $C$DW$464, DW_AT_bit_offset(0x17)
	.dwattr $C$DW$464, DW_AT_bit_size(0x09)
	.dwattr $C$DW$464, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$464, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$464, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$464, DW_AT_decl_line(0x13e)
	.dwattr $C$DW$464, DW_AT_decl_column(0x0e)

$C$DW$465	.dwtag  DW_TAG_member
	.dwattr $C$DW$465, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$465, DW_AT_name("_reserved0")
	.dwattr $C$DW$465, DW_AT_TI_symbol_name("_reserved0")
	.dwattr $C$DW$465, DW_AT_bit_offset(0x16)
	.dwattr $C$DW$465, DW_AT_bit_size(0x01)
	.dwattr $C$DW$465, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$465, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$465, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$465, DW_AT_decl_line(0x13f)
	.dwattr $C$DW$465, DW_AT_decl_column(0x0e)

$C$DW$466	.dwtag  DW_TAG_member
	.dwattr $C$DW$466, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$466, DW_AT_name("ICI_IT_1")
	.dwattr $C$DW$466, DW_AT_TI_symbol_name("ICI_IT_1")
	.dwattr $C$DW$466, DW_AT_bit_offset(0x10)
	.dwattr $C$DW$466, DW_AT_bit_size(0x06)
	.dwattr $C$DW$466, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$466, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$466, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$466, DW_AT_decl_line(0x140)
	.dwattr $C$DW$466, DW_AT_decl_column(0x0e)

$C$DW$467	.dwtag  DW_TAG_member
	.dwattr $C$DW$467, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$467, DW_AT_name("GE")
	.dwattr $C$DW$467, DW_AT_TI_symbol_name("GE")
	.dwattr $C$DW$467, DW_AT_bit_offset(0x0c)
	.dwattr $C$DW$467, DW_AT_bit_size(0x04)
	.dwattr $C$DW$467, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$467, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$467, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$467, DW_AT_decl_line(0x141)
	.dwattr $C$DW$467, DW_AT_decl_column(0x0e)

$C$DW$468	.dwtag  DW_TAG_member
	.dwattr $C$DW$468, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$468, DW_AT_name("_reserved1")
	.dwattr $C$DW$468, DW_AT_TI_symbol_name("_reserved1")
	.dwattr $C$DW$468, DW_AT_bit_offset(0x08)
	.dwattr $C$DW$468, DW_AT_bit_size(0x04)
	.dwattr $C$DW$468, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$468, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$468, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$468, DW_AT_decl_line(0x142)
	.dwattr $C$DW$468, DW_AT_decl_column(0x0e)

$C$DW$469	.dwtag  DW_TAG_member
	.dwattr $C$DW$469, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$469, DW_AT_name("T")
	.dwattr $C$DW$469, DW_AT_TI_symbol_name("T")
	.dwattr $C$DW$469, DW_AT_bit_offset(0x07)
	.dwattr $C$DW$469, DW_AT_bit_size(0x01)
	.dwattr $C$DW$469, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$469, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$469, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$469, DW_AT_decl_line(0x143)
	.dwattr $C$DW$469, DW_AT_decl_column(0x0e)

$C$DW$470	.dwtag  DW_TAG_member
	.dwattr $C$DW$470, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$470, DW_AT_name("ICI_IT_2")
	.dwattr $C$DW$470, DW_AT_TI_symbol_name("ICI_IT_2")
	.dwattr $C$DW$470, DW_AT_bit_offset(0x05)
	.dwattr $C$DW$470, DW_AT_bit_size(0x02)
	.dwattr $C$DW$470, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$470, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$470, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$470, DW_AT_decl_line(0x144)
	.dwattr $C$DW$470, DW_AT_decl_column(0x0e)

$C$DW$471	.dwtag  DW_TAG_member
	.dwattr $C$DW$471, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$471, DW_AT_name("Q")
	.dwattr $C$DW$471, DW_AT_TI_symbol_name("Q")
	.dwattr $C$DW$471, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$471, DW_AT_bit_size(0x01)
	.dwattr $C$DW$471, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$471, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$471, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$471, DW_AT_decl_line(0x145)
	.dwattr $C$DW$471, DW_AT_decl_column(0x0e)

$C$DW$472	.dwtag  DW_TAG_member
	.dwattr $C$DW$472, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$472, DW_AT_name("V")
	.dwattr $C$DW$472, DW_AT_TI_symbol_name("V")
	.dwattr $C$DW$472, DW_AT_bit_offset(0x03)
	.dwattr $C$DW$472, DW_AT_bit_size(0x01)
	.dwattr $C$DW$472, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$472, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$472, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$472, DW_AT_decl_line(0x146)
	.dwattr $C$DW$472, DW_AT_decl_column(0x0e)

$C$DW$473	.dwtag  DW_TAG_member
	.dwattr $C$DW$473, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$473, DW_AT_name("C")
	.dwattr $C$DW$473, DW_AT_TI_symbol_name("C")
	.dwattr $C$DW$473, DW_AT_bit_offset(0x02)
	.dwattr $C$DW$473, DW_AT_bit_size(0x01)
	.dwattr $C$DW$473, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$473, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$473, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$473, DW_AT_decl_line(0x147)
	.dwattr $C$DW$473, DW_AT_decl_column(0x0e)

$C$DW$474	.dwtag  DW_TAG_member
	.dwattr $C$DW$474, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$474, DW_AT_name("Z")
	.dwattr $C$DW$474, DW_AT_TI_symbol_name("Z")
	.dwattr $C$DW$474, DW_AT_bit_offset(0x01)
	.dwattr $C$DW$474, DW_AT_bit_size(0x01)
	.dwattr $C$DW$474, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$474, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$474, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$474, DW_AT_decl_line(0x148)
	.dwattr $C$DW$474, DW_AT_decl_column(0x0e)

$C$DW$475	.dwtag  DW_TAG_member
	.dwattr $C$DW$475, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$475, DW_AT_name("N")
	.dwattr $C$DW$475, DW_AT_TI_symbol_name("N")
	.dwattr $C$DW$475, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$475, DW_AT_bit_size(0x01)
	.dwattr $C$DW$475, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$475, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$475, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$475, DW_AT_decl_line(0x149)
	.dwattr $C$DW$475, DW_AT_decl_column(0x0e)

	.dwattr $C$DW$T$26, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$T$26, DW_AT_decl_line(0x13d)
	.dwattr $C$DW$T$26, DW_AT_decl_column(0x03)
	.dwendtag $C$DW$T$26


$C$DW$T$27	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$27, DW_AT_byte_size(0x04)
$C$DW$476	.dwtag  DW_TAG_member
	.dwattr $C$DW$476, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$476, DW_AT_name("nPRIV")
	.dwattr $C$DW$476, DW_AT_TI_symbol_name("nPRIV")
	.dwattr $C$DW$476, DW_AT_bit_offset(0x1f)
	.dwattr $C$DW$476, DW_AT_bit_size(0x01)
	.dwattr $C$DW$476, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$476, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$476, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$476, DW_AT_decl_line(0x175)
	.dwattr $C$DW$476, DW_AT_decl_column(0x0e)

$C$DW$477	.dwtag  DW_TAG_member
	.dwattr $C$DW$477, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$477, DW_AT_name("SPSEL")
	.dwattr $C$DW$477, DW_AT_TI_symbol_name("SPSEL")
	.dwattr $C$DW$477, DW_AT_bit_offset(0x1e)
	.dwattr $C$DW$477, DW_AT_bit_size(0x01)
	.dwattr $C$DW$477, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$477, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$477, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$477, DW_AT_decl_line(0x176)
	.dwattr $C$DW$477, DW_AT_decl_column(0x0e)

$C$DW$478	.dwtag  DW_TAG_member
	.dwattr $C$DW$478, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$478, DW_AT_name("FPCA")
	.dwattr $C$DW$478, DW_AT_TI_symbol_name("FPCA")
	.dwattr $C$DW$478, DW_AT_bit_offset(0x1d)
	.dwattr $C$DW$478, DW_AT_bit_size(0x01)
	.dwattr $C$DW$478, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$478, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$478, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$478, DW_AT_decl_line(0x177)
	.dwattr $C$DW$478, DW_AT_decl_column(0x0e)

$C$DW$479	.dwtag  DW_TAG_member
	.dwattr $C$DW$479, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$479, DW_AT_name("_reserved0")
	.dwattr $C$DW$479, DW_AT_TI_symbol_name("_reserved0")
	.dwattr $C$DW$479, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$479, DW_AT_bit_size(0x1d)
	.dwattr $C$DW$479, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$479, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$479, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$479, DW_AT_decl_line(0x178)
	.dwattr $C$DW$479, DW_AT_decl_column(0x0e)

	.dwattr $C$DW$T$27, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$T$27, DW_AT_decl_line(0x174)
	.dwattr $C$DW$T$27, DW_AT_decl_column(0x03)
	.dwendtag $C$DW$T$27


$C$DW$T$37	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$37, DW_AT_byte_size(0xe04)
$C$DW$480	.dwtag  DW_TAG_member
	.dwattr $C$DW$480, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$480, DW_AT_name("ISER")
	.dwattr $C$DW$480, DW_AT_TI_symbol_name("ISER")
	.dwattr $C$DW$480, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$480, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$480, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$480, DW_AT_decl_line(0x196)
	.dwattr $C$DW$480, DW_AT_decl_column(0x12)

$C$DW$481	.dwtag  DW_TAG_member
	.dwattr $C$DW$481, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$481, DW_AT_name("RESERVED0")
	.dwattr $C$DW$481, DW_AT_TI_symbol_name("RESERVED0")
	.dwattr $C$DW$481, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$481, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$481, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$481, DW_AT_decl_line(0x197)
	.dwattr $C$DW$481, DW_AT_decl_column(0x12)

$C$DW$482	.dwtag  DW_TAG_member
	.dwattr $C$DW$482, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$482, DW_AT_name("ICER")
	.dwattr $C$DW$482, DW_AT_TI_symbol_name("ICER")
	.dwattr $C$DW$482, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
	.dwattr $C$DW$482, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$482, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$482, DW_AT_decl_line(0x198)
	.dwattr $C$DW$482, DW_AT_decl_column(0x12)

$C$DW$483	.dwtag  DW_TAG_member
	.dwattr $C$DW$483, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$483, DW_AT_name("RSERVED1")
	.dwattr $C$DW$483, DW_AT_TI_symbol_name("RSERVED1")
	.dwattr $C$DW$483, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
	.dwattr $C$DW$483, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$483, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$483, DW_AT_decl_line(0x199)
	.dwattr $C$DW$483, DW_AT_decl_column(0x12)

$C$DW$484	.dwtag  DW_TAG_member
	.dwattr $C$DW$484, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$484, DW_AT_name("ISPR")
	.dwattr $C$DW$484, DW_AT_TI_symbol_name("ISPR")
	.dwattr $C$DW$484, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
	.dwattr $C$DW$484, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$484, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$484, DW_AT_decl_line(0x19a)
	.dwattr $C$DW$484, DW_AT_decl_column(0x12)

$C$DW$485	.dwtag  DW_TAG_member
	.dwattr $C$DW$485, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$485, DW_AT_name("RESERVED2")
	.dwattr $C$DW$485, DW_AT_TI_symbol_name("RESERVED2")
	.dwattr $C$DW$485, DW_AT_data_member_location[DW_OP_plus_uconst 0x120]
	.dwattr $C$DW$485, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$485, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$485, DW_AT_decl_line(0x19b)
	.dwattr $C$DW$485, DW_AT_decl_column(0x12)

$C$DW$486	.dwtag  DW_TAG_member
	.dwattr $C$DW$486, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$486, DW_AT_name("ICPR")
	.dwattr $C$DW$486, DW_AT_TI_symbol_name("ICPR")
	.dwattr $C$DW$486, DW_AT_data_member_location[DW_OP_plus_uconst 0x180]
	.dwattr $C$DW$486, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$486, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$486, DW_AT_decl_line(0x19c)
	.dwattr $C$DW$486, DW_AT_decl_column(0x12)

$C$DW$487	.dwtag  DW_TAG_member
	.dwattr $C$DW$487, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$487, DW_AT_name("RESERVED3")
	.dwattr $C$DW$487, DW_AT_TI_symbol_name("RESERVED3")
	.dwattr $C$DW$487, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a0]
	.dwattr $C$DW$487, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$487, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$487, DW_AT_decl_line(0x19d)
	.dwattr $C$DW$487, DW_AT_decl_column(0x12)

$C$DW$488	.dwtag  DW_TAG_member
	.dwattr $C$DW$488, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$488, DW_AT_name("IABR")
	.dwattr $C$DW$488, DW_AT_TI_symbol_name("IABR")
	.dwattr $C$DW$488, DW_AT_data_member_location[DW_OP_plus_uconst 0x200]
	.dwattr $C$DW$488, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$488, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$488, DW_AT_decl_line(0x19e)
	.dwattr $C$DW$488, DW_AT_decl_column(0x12)

$C$DW$489	.dwtag  DW_TAG_member
	.dwattr $C$DW$489, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$489, DW_AT_name("RESERVED4")
	.dwattr $C$DW$489, DW_AT_TI_symbol_name("RESERVED4")
	.dwattr $C$DW$489, DW_AT_data_member_location[DW_OP_plus_uconst 0x220]
	.dwattr $C$DW$489, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$489, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$489, DW_AT_decl_line(0x19f)
	.dwattr $C$DW$489, DW_AT_decl_column(0x12)

$C$DW$490	.dwtag  DW_TAG_member
	.dwattr $C$DW$490, DW_AT_type(*$C$DW$T$35)
	.dwattr $C$DW$490, DW_AT_name("IP")
	.dwattr $C$DW$490, DW_AT_TI_symbol_name("IP")
	.dwattr $C$DW$490, DW_AT_data_member_location[DW_OP_plus_uconst 0x300]
	.dwattr $C$DW$490, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$490, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$490, DW_AT_decl_line(0x1a0)
	.dwattr $C$DW$490, DW_AT_decl_column(0x12)

$C$DW$491	.dwtag  DW_TAG_member
	.dwattr $C$DW$491, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$491, DW_AT_name("RESERVED5")
	.dwattr $C$DW$491, DW_AT_TI_symbol_name("RESERVED5")
	.dwattr $C$DW$491, DW_AT_data_member_location[DW_OP_plus_uconst 0x3f0]
	.dwattr $C$DW$491, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$491, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$491, DW_AT_decl_line(0x1a1)
	.dwattr $C$DW$491, DW_AT_decl_column(0x12)

$C$DW$492	.dwtag  DW_TAG_member
	.dwattr $C$DW$492, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$492, DW_AT_name("STIR")
	.dwattr $C$DW$492, DW_AT_TI_symbol_name("STIR")
	.dwattr $C$DW$492, DW_AT_data_member_location[DW_OP_plus_uconst 0xe00]
	.dwattr $C$DW$492, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$492, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$492, DW_AT_decl_line(0x1a2)
	.dwattr $C$DW$492, DW_AT_decl_column(0x12)

	.dwattr $C$DW$T$37, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$T$37, DW_AT_decl_line(0x195)
	.dwattr $C$DW$T$37, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$37

$C$DW$T$207	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$207, DW_AT_name("NVIC_Type")
	.dwattr $C$DW$T$207, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$T$207, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$207, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$T$207, DW_AT_decl_line(0x1a3)
	.dwattr $C$DW$T$207, DW_AT_decl_column(0x04)


$C$DW$T$44	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$44, DW_AT_byte_size(0x8c)
$C$DW$493	.dwtag  DW_TAG_member
	.dwattr $C$DW$493, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$493, DW_AT_name("CPUID")
	.dwattr $C$DW$493, DW_AT_TI_symbol_name("CPUID")
	.dwattr $C$DW$493, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$493, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$493, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$493, DW_AT_decl_line(0x1b8)
	.dwattr $C$DW$493, DW_AT_decl_column(0x12)

$C$DW$494	.dwtag  DW_TAG_member
	.dwattr $C$DW$494, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$494, DW_AT_name("ICSR")
	.dwattr $C$DW$494, DW_AT_TI_symbol_name("ICSR")
	.dwattr $C$DW$494, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$494, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$494, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$494, DW_AT_decl_line(0x1b9)
	.dwattr $C$DW$494, DW_AT_decl_column(0x12)

$C$DW$495	.dwtag  DW_TAG_member
	.dwattr $C$DW$495, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$495, DW_AT_name("VTOR")
	.dwattr $C$DW$495, DW_AT_TI_symbol_name("VTOR")
	.dwattr $C$DW$495, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$495, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$495, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$495, DW_AT_decl_line(0x1ba)
	.dwattr $C$DW$495, DW_AT_decl_column(0x12)

$C$DW$496	.dwtag  DW_TAG_member
	.dwattr $C$DW$496, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$496, DW_AT_name("AIRCR")
	.dwattr $C$DW$496, DW_AT_TI_symbol_name("AIRCR")
	.dwattr $C$DW$496, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$496, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$496, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$496, DW_AT_decl_line(0x1bb)
	.dwattr $C$DW$496, DW_AT_decl_column(0x12)

$C$DW$497	.dwtag  DW_TAG_member
	.dwattr $C$DW$497, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$497, DW_AT_name("SCR")
	.dwattr $C$DW$497, DW_AT_TI_symbol_name("SCR")
	.dwattr $C$DW$497, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$497, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$497, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$497, DW_AT_decl_line(0x1bc)
	.dwattr $C$DW$497, DW_AT_decl_column(0x12)

$C$DW$498	.dwtag  DW_TAG_member
	.dwattr $C$DW$498, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$498, DW_AT_name("CCR")
	.dwattr $C$DW$498, DW_AT_TI_symbol_name("CCR")
	.dwattr $C$DW$498, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$498, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$498, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$498, DW_AT_decl_line(0x1bd)
	.dwattr $C$DW$498, DW_AT_decl_column(0x12)

$C$DW$499	.dwtag  DW_TAG_member
	.dwattr $C$DW$499, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$499, DW_AT_name("SHP")
	.dwattr $C$DW$499, DW_AT_TI_symbol_name("SHP")
	.dwattr $C$DW$499, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$499, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$499, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$499, DW_AT_decl_line(0x1be)
	.dwattr $C$DW$499, DW_AT_decl_column(0x12)

$C$DW$500	.dwtag  DW_TAG_member
	.dwattr $C$DW$500, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$500, DW_AT_name("SHCSR")
	.dwattr $C$DW$500, DW_AT_TI_symbol_name("SHCSR")
	.dwattr $C$DW$500, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$500, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$500, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$500, DW_AT_decl_line(0x1bf)
	.dwattr $C$DW$500, DW_AT_decl_column(0x12)

$C$DW$501	.dwtag  DW_TAG_member
	.dwattr $C$DW$501, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$501, DW_AT_name("CFSR")
	.dwattr $C$DW$501, DW_AT_TI_symbol_name("CFSR")
	.dwattr $C$DW$501, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$501, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$501, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$501, DW_AT_decl_line(0x1c0)
	.dwattr $C$DW$501, DW_AT_decl_column(0x12)

$C$DW$502	.dwtag  DW_TAG_member
	.dwattr $C$DW$502, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$502, DW_AT_name("HFSR")
	.dwattr $C$DW$502, DW_AT_TI_symbol_name("HFSR")
	.dwattr $C$DW$502, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$502, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$502, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$502, DW_AT_decl_line(0x1c1)
	.dwattr $C$DW$502, DW_AT_decl_column(0x12)

$C$DW$503	.dwtag  DW_TAG_member
	.dwattr $C$DW$503, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$503, DW_AT_name("DFSR")
	.dwattr $C$DW$503, DW_AT_TI_symbol_name("DFSR")
	.dwattr $C$DW$503, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr $C$DW$503, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$503, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$503, DW_AT_decl_line(0x1c2)
	.dwattr $C$DW$503, DW_AT_decl_column(0x12)

$C$DW$504	.dwtag  DW_TAG_member
	.dwattr $C$DW$504, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$504, DW_AT_name("MMFAR")
	.dwattr $C$DW$504, DW_AT_TI_symbol_name("MMFAR")
	.dwattr $C$DW$504, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr $C$DW$504, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$504, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$504, DW_AT_decl_line(0x1c3)
	.dwattr $C$DW$504, DW_AT_decl_column(0x12)

$C$DW$505	.dwtag  DW_TAG_member
	.dwattr $C$DW$505, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$505, DW_AT_name("BFAR")
	.dwattr $C$DW$505, DW_AT_TI_symbol_name("BFAR")
	.dwattr $C$DW$505, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr $C$DW$505, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$505, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$505, DW_AT_decl_line(0x1c4)
	.dwattr $C$DW$505, DW_AT_decl_column(0x12)

$C$DW$506	.dwtag  DW_TAG_member
	.dwattr $C$DW$506, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$506, DW_AT_name("AFSR")
	.dwattr $C$DW$506, DW_AT_TI_symbol_name("AFSR")
	.dwattr $C$DW$506, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
	.dwattr $C$DW$506, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$506, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$506, DW_AT_decl_line(0x1c5)
	.dwattr $C$DW$506, DW_AT_decl_column(0x12)

$C$DW$507	.dwtag  DW_TAG_member
	.dwattr $C$DW$507, DW_AT_type(*$C$DW$T$40)
	.dwattr $C$DW$507, DW_AT_name("PFR")
	.dwattr $C$DW$507, DW_AT_TI_symbol_name("PFR")
	.dwattr $C$DW$507, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
	.dwattr $C$DW$507, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$507, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$507, DW_AT_decl_line(0x1c6)
	.dwattr $C$DW$507, DW_AT_decl_column(0x12)

$C$DW$508	.dwtag  DW_TAG_member
	.dwattr $C$DW$508, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$508, DW_AT_name("DFR")
	.dwattr $C$DW$508, DW_AT_TI_symbol_name("DFR")
	.dwattr $C$DW$508, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
	.dwattr $C$DW$508, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$508, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$508, DW_AT_decl_line(0x1c7)
	.dwattr $C$DW$508, DW_AT_decl_column(0x12)

$C$DW$509	.dwtag  DW_TAG_member
	.dwattr $C$DW$509, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$509, DW_AT_name("ADR")
	.dwattr $C$DW$509, DW_AT_TI_symbol_name("ADR")
	.dwattr $C$DW$509, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
	.dwattr $C$DW$509, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$509, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$509, DW_AT_decl_line(0x1c8)
	.dwattr $C$DW$509, DW_AT_decl_column(0x12)

$C$DW$510	.dwtag  DW_TAG_member
	.dwattr $C$DW$510, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$510, DW_AT_name("MMFR")
	.dwattr $C$DW$510, DW_AT_TI_symbol_name("MMFR")
	.dwattr $C$DW$510, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
	.dwattr $C$DW$510, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$510, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$510, DW_AT_decl_line(0x1c9)
	.dwattr $C$DW$510, DW_AT_decl_column(0x12)

$C$DW$511	.dwtag  DW_TAG_member
	.dwattr $C$DW$511, DW_AT_type(*$C$DW$T$42)
	.dwattr $C$DW$511, DW_AT_name("ISAR")
	.dwattr $C$DW$511, DW_AT_TI_symbol_name("ISAR")
	.dwattr $C$DW$511, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
	.dwattr $C$DW$511, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$511, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$511, DW_AT_decl_line(0x1ca)
	.dwattr $C$DW$511, DW_AT_decl_column(0x12)

$C$DW$512	.dwtag  DW_TAG_member
	.dwattr $C$DW$512, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$512, DW_AT_name("RESERVED0")
	.dwattr $C$DW$512, DW_AT_TI_symbol_name("RESERVED0")
	.dwattr $C$DW$512, DW_AT_data_member_location[DW_OP_plus_uconst 0x74]
	.dwattr $C$DW$512, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$512, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$512, DW_AT_decl_line(0x1cb)
	.dwattr $C$DW$512, DW_AT_decl_column(0x12)

$C$DW$513	.dwtag  DW_TAG_member
	.dwattr $C$DW$513, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$513, DW_AT_name("CPACR")
	.dwattr $C$DW$513, DW_AT_TI_symbol_name("CPACR")
	.dwattr $C$DW$513, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
	.dwattr $C$DW$513, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$513, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$513, DW_AT_decl_line(0x1cc)
	.dwattr $C$DW$513, DW_AT_decl_column(0x12)

	.dwattr $C$DW$T$44, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$T$44, DW_AT_decl_line(0x1b7)
	.dwattr $C$DW$T$44, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$44

$C$DW$T$208	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$208, DW_AT_name("SCB_Type")
	.dwattr $C$DW$T$208, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$T$208, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$208, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$T$208, DW_AT_decl_line(0x1cd)
	.dwattr $C$DW$T$208, DW_AT_decl_column(0x03)


$C$DW$T$46	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$46, DW_AT_byte_size(0x0c)
$C$DW$514	.dwtag  DW_TAG_member
	.dwattr $C$DW$514, DW_AT_type(*$C$DW$T$45)
	.dwattr $C$DW$514, DW_AT_name("RESERVED0")
	.dwattr $C$DW$514, DW_AT_TI_symbol_name("RESERVED0")
	.dwattr $C$DW$514, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$514, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$514, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$514, DW_AT_decl_line(0x2cf)
	.dwattr $C$DW$514, DW_AT_decl_column(0x12)

$C$DW$515	.dwtag  DW_TAG_member
	.dwattr $C$DW$515, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$515, DW_AT_name("ICTR")
	.dwattr $C$DW$515, DW_AT_TI_symbol_name("ICTR")
	.dwattr $C$DW$515, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$515, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$515, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$515, DW_AT_decl_line(0x2d0)
	.dwattr $C$DW$515, DW_AT_decl_column(0x12)

$C$DW$516	.dwtag  DW_TAG_member
	.dwattr $C$DW$516, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$516, DW_AT_name("ACTLR")
	.dwattr $C$DW$516, DW_AT_TI_symbol_name("ACTLR")
	.dwattr $C$DW$516, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$516, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$516, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$516, DW_AT_decl_line(0x2d1)
	.dwattr $C$DW$516, DW_AT_decl_column(0x12)

	.dwattr $C$DW$T$46, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$T$46, DW_AT_decl_line(0x2ce)
	.dwattr $C$DW$T$46, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$46

$C$DW$T$209	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$209, DW_AT_name("SCnSCB_Type")
	.dwattr $C$DW$T$209, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$T$209, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$209, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$T$209, DW_AT_decl_line(0x2d2)
	.dwattr $C$DW$T$209, DW_AT_decl_column(0x03)


$C$DW$T$47	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$47, DW_AT_byte_size(0x10)
$C$DW$517	.dwtag  DW_TAG_member
	.dwattr $C$DW$517, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$517, DW_AT_name("CTRL")
	.dwattr $C$DW$517, DW_AT_TI_symbol_name("CTRL")
	.dwattr $C$DW$517, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$517, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$517, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$517, DW_AT_decl_line(0x2f7)
	.dwattr $C$DW$517, DW_AT_decl_column(0x12)

$C$DW$518	.dwtag  DW_TAG_member
	.dwattr $C$DW$518, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$518, DW_AT_name("LOAD")
	.dwattr $C$DW$518, DW_AT_TI_symbol_name("LOAD")
	.dwattr $C$DW$518, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$518, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$518, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$518, DW_AT_decl_line(0x2f8)
	.dwattr $C$DW$518, DW_AT_decl_column(0x12)

$C$DW$519	.dwtag  DW_TAG_member
	.dwattr $C$DW$519, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$519, DW_AT_name("VAL")
	.dwattr $C$DW$519, DW_AT_TI_symbol_name("VAL")
	.dwattr $C$DW$519, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$519, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$519, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$519, DW_AT_decl_line(0x2f9)
	.dwattr $C$DW$519, DW_AT_decl_column(0x12)

$C$DW$520	.dwtag  DW_TAG_member
	.dwattr $C$DW$520, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$520, DW_AT_name("CALIB")
	.dwattr $C$DW$520, DW_AT_TI_symbol_name("CALIB")
	.dwattr $C$DW$520, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$520, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$520, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$520, DW_AT_decl_line(0x2fa)
	.dwattr $C$DW$520, DW_AT_decl_column(0x12)

	.dwattr $C$DW$T$47, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$T$47, DW_AT_decl_line(0x2f6)
	.dwattr $C$DW$T$47, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$47

$C$DW$T$210	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$210, DW_AT_name("SysTick_Type")
	.dwattr $C$DW$T$210, DW_AT_type(*$C$DW$T$47)
	.dwattr $C$DW$T$210, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$210, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$T$210, DW_AT_decl_line(0x2fb)
	.dwattr $C$DW$T$210, DW_AT_decl_column(0x03)


$C$DW$T$55	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$55, DW_AT_byte_size(0x1000)
$C$DW$521	.dwtag  DW_TAG_member
	.dwattr $C$DW$521, DW_AT_type(*$C$DW$T$49)
	.dwattr $C$DW$521, DW_AT_name("PORT")
	.dwattr $C$DW$521, DW_AT_TI_symbol_name("PORT")
	.dwattr $C$DW$521, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$521, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$521, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$521, DW_AT_decl_line(0x330)
	.dwattr $C$DW$521, DW_AT_decl_column(0x06)

$C$DW$522	.dwtag  DW_TAG_member
	.dwattr $C$DW$522, DW_AT_type(*$C$DW$T$50)
	.dwattr $C$DW$522, DW_AT_name("RESERVED0")
	.dwattr $C$DW$522, DW_AT_TI_symbol_name("RESERVED0")
	.dwattr $C$DW$522, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
	.dwattr $C$DW$522, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$522, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$522, DW_AT_decl_line(0x331)
	.dwattr $C$DW$522, DW_AT_decl_column(0x12)

$C$DW$523	.dwtag  DW_TAG_member
	.dwattr $C$DW$523, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$523, DW_AT_name("TER")
	.dwattr $C$DW$523, DW_AT_TI_symbol_name("TER")
	.dwattr $C$DW$523, DW_AT_data_member_location[DW_OP_plus_uconst 0xe00]
	.dwattr $C$DW$523, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$523, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$523, DW_AT_decl_line(0x332)
	.dwattr $C$DW$523, DW_AT_decl_column(0x12)

$C$DW$524	.dwtag  DW_TAG_member
	.dwattr $C$DW$524, DW_AT_type(*$C$DW$T$51)
	.dwattr $C$DW$524, DW_AT_name("RESERVED1")
	.dwattr $C$DW$524, DW_AT_TI_symbol_name("RESERVED1")
	.dwattr $C$DW$524, DW_AT_data_member_location[DW_OP_plus_uconst 0xe04]
	.dwattr $C$DW$524, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$524, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$524, DW_AT_decl_line(0x333)
	.dwattr $C$DW$524, DW_AT_decl_column(0x12)

$C$DW$525	.dwtag  DW_TAG_member
	.dwattr $C$DW$525, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$525, DW_AT_name("TPR")
	.dwattr $C$DW$525, DW_AT_TI_symbol_name("TPR")
	.dwattr $C$DW$525, DW_AT_data_member_location[DW_OP_plus_uconst 0xe40]
	.dwattr $C$DW$525, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$525, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$525, DW_AT_decl_line(0x334)
	.dwattr $C$DW$525, DW_AT_decl_column(0x12)

$C$DW$526	.dwtag  DW_TAG_member
	.dwattr $C$DW$526, DW_AT_type(*$C$DW$T$51)
	.dwattr $C$DW$526, DW_AT_name("RESERVED2")
	.dwattr $C$DW$526, DW_AT_TI_symbol_name("RESERVED2")
	.dwattr $C$DW$526, DW_AT_data_member_location[DW_OP_plus_uconst 0xe44]
	.dwattr $C$DW$526, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$526, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$526, DW_AT_decl_line(0x335)
	.dwattr $C$DW$526, DW_AT_decl_column(0x12)

$C$DW$527	.dwtag  DW_TAG_member
	.dwattr $C$DW$527, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$527, DW_AT_name("TCR")
	.dwattr $C$DW$527, DW_AT_TI_symbol_name("TCR")
	.dwattr $C$DW$527, DW_AT_data_member_location[DW_OP_plus_uconst 0xe80]
	.dwattr $C$DW$527, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$527, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$527, DW_AT_decl_line(0x336)
	.dwattr $C$DW$527, DW_AT_decl_column(0x12)

$C$DW$528	.dwtag  DW_TAG_member
	.dwattr $C$DW$528, DW_AT_type(*$C$DW$T$52)
	.dwattr $C$DW$528, DW_AT_name("RESERVED3")
	.dwattr $C$DW$528, DW_AT_TI_symbol_name("RESERVED3")
	.dwattr $C$DW$528, DW_AT_data_member_location[DW_OP_plus_uconst 0xe84]
	.dwattr $C$DW$528, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$528, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$528, DW_AT_decl_line(0x337)
	.dwattr $C$DW$528, DW_AT_decl_column(0x12)

$C$DW$529	.dwtag  DW_TAG_member
	.dwattr $C$DW$529, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$529, DW_AT_name("IWR")
	.dwattr $C$DW$529, DW_AT_TI_symbol_name("IWR")
	.dwattr $C$DW$529, DW_AT_data_member_location[DW_OP_plus_uconst 0xef8]
	.dwattr $C$DW$529, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$529, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$529, DW_AT_decl_line(0x338)
	.dwattr $C$DW$529, DW_AT_decl_column(0x12)

$C$DW$530	.dwtag  DW_TAG_member
	.dwattr $C$DW$530, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$530, DW_AT_name("IRR")
	.dwattr $C$DW$530, DW_AT_TI_symbol_name("IRR")
	.dwattr $C$DW$530, DW_AT_data_member_location[DW_OP_plus_uconst 0xefc]
	.dwattr $C$DW$530, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$530, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$530, DW_AT_decl_line(0x339)
	.dwattr $C$DW$530, DW_AT_decl_column(0x12)

$C$DW$531	.dwtag  DW_TAG_member
	.dwattr $C$DW$531, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$531, DW_AT_name("IMCR")
	.dwattr $C$DW$531, DW_AT_TI_symbol_name("IMCR")
	.dwattr $C$DW$531, DW_AT_data_member_location[DW_OP_plus_uconst 0xf00]
	.dwattr $C$DW$531, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$531, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$531, DW_AT_decl_line(0x33a)
	.dwattr $C$DW$531, DW_AT_decl_column(0x12)

$C$DW$532	.dwtag  DW_TAG_member
	.dwattr $C$DW$532, DW_AT_type(*$C$DW$T$53)
	.dwattr $C$DW$532, DW_AT_name("RESERVED4")
	.dwattr $C$DW$532, DW_AT_TI_symbol_name("RESERVED4")
	.dwattr $C$DW$532, DW_AT_data_member_location[DW_OP_plus_uconst 0xf04]
	.dwattr $C$DW$532, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$532, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$532, DW_AT_decl_line(0x33b)
	.dwattr $C$DW$532, DW_AT_decl_column(0x12)

$C$DW$533	.dwtag  DW_TAG_member
	.dwattr $C$DW$533, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$533, DW_AT_name("LAR")
	.dwattr $C$DW$533, DW_AT_TI_symbol_name("LAR")
	.dwattr $C$DW$533, DW_AT_data_member_location[DW_OP_plus_uconst 0xfb0]
	.dwattr $C$DW$533, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$533, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$533, DW_AT_decl_line(0x33c)
	.dwattr $C$DW$533, DW_AT_decl_column(0x12)

$C$DW$534	.dwtag  DW_TAG_member
	.dwattr $C$DW$534, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$534, DW_AT_name("LSR")
	.dwattr $C$DW$534, DW_AT_TI_symbol_name("LSR")
	.dwattr $C$DW$534, DW_AT_data_member_location[DW_OP_plus_uconst 0xfb4]
	.dwattr $C$DW$534, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$534, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$534, DW_AT_decl_line(0x33d)
	.dwattr $C$DW$534, DW_AT_decl_column(0x12)

$C$DW$535	.dwtag  DW_TAG_member
	.dwattr $C$DW$535, DW_AT_type(*$C$DW$T$54)
	.dwattr $C$DW$535, DW_AT_name("RESERVED5")
	.dwattr $C$DW$535, DW_AT_TI_symbol_name("RESERVED5")
	.dwattr $C$DW$535, DW_AT_data_member_location[DW_OP_plus_uconst 0xfb8]
	.dwattr $C$DW$535, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$535, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$535, DW_AT_decl_line(0x33e)
	.dwattr $C$DW$535, DW_AT_decl_column(0x12)

$C$DW$536	.dwtag  DW_TAG_member
	.dwattr $C$DW$536, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$536, DW_AT_name("PID4")
	.dwattr $C$DW$536, DW_AT_TI_symbol_name("PID4")
	.dwattr $C$DW$536, DW_AT_data_member_location[DW_OP_plus_uconst 0xfd0]
	.dwattr $C$DW$536, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$536, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$536, DW_AT_decl_line(0x33f)
	.dwattr $C$DW$536, DW_AT_decl_column(0x12)

$C$DW$537	.dwtag  DW_TAG_member
	.dwattr $C$DW$537, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$537, DW_AT_name("PID5")
	.dwattr $C$DW$537, DW_AT_TI_symbol_name("PID5")
	.dwattr $C$DW$537, DW_AT_data_member_location[DW_OP_plus_uconst 0xfd4]
	.dwattr $C$DW$537, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$537, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$537, DW_AT_decl_line(0x340)
	.dwattr $C$DW$537, DW_AT_decl_column(0x12)

$C$DW$538	.dwtag  DW_TAG_member
	.dwattr $C$DW$538, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$538, DW_AT_name("PID6")
	.dwattr $C$DW$538, DW_AT_TI_symbol_name("PID6")
	.dwattr $C$DW$538, DW_AT_data_member_location[DW_OP_plus_uconst 0xfd8]
	.dwattr $C$DW$538, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$538, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$538, DW_AT_decl_line(0x341)
	.dwattr $C$DW$538, DW_AT_decl_column(0x12)

$C$DW$539	.dwtag  DW_TAG_member
	.dwattr $C$DW$539, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$539, DW_AT_name("PID7")
	.dwattr $C$DW$539, DW_AT_TI_symbol_name("PID7")
	.dwattr $C$DW$539, DW_AT_data_member_location[DW_OP_plus_uconst 0xfdc]
	.dwattr $C$DW$539, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$539, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$539, DW_AT_decl_line(0x342)
	.dwattr $C$DW$539, DW_AT_decl_column(0x12)

$C$DW$540	.dwtag  DW_TAG_member
	.dwattr $C$DW$540, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$540, DW_AT_name("PID0")
	.dwattr $C$DW$540, DW_AT_TI_symbol_name("PID0")
	.dwattr $C$DW$540, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe0]
	.dwattr $C$DW$540, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$540, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$540, DW_AT_decl_line(0x343)
	.dwattr $C$DW$540, DW_AT_decl_column(0x12)

$C$DW$541	.dwtag  DW_TAG_member
	.dwattr $C$DW$541, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$541, DW_AT_name("PID1")
	.dwattr $C$DW$541, DW_AT_TI_symbol_name("PID1")
	.dwattr $C$DW$541, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe4]
	.dwattr $C$DW$541, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$541, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$541, DW_AT_decl_line(0x344)
	.dwattr $C$DW$541, DW_AT_decl_column(0x12)

$C$DW$542	.dwtag  DW_TAG_member
	.dwattr $C$DW$542, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$542, DW_AT_name("PID2")
	.dwattr $C$DW$542, DW_AT_TI_symbol_name("PID2")
	.dwattr $C$DW$542, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe8]
	.dwattr $C$DW$542, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$542, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$542, DW_AT_decl_line(0x345)
	.dwattr $C$DW$542, DW_AT_decl_column(0x12)

$C$DW$543	.dwtag  DW_TAG_member
	.dwattr $C$DW$543, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$543, DW_AT_name("PID3")
	.dwattr $C$DW$543, DW_AT_TI_symbol_name("PID3")
	.dwattr $C$DW$543, DW_AT_data_member_location[DW_OP_plus_uconst 0xfec]
	.dwattr $C$DW$543, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$543, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$543, DW_AT_decl_line(0x346)
	.dwattr $C$DW$543, DW_AT_decl_column(0x12)

$C$DW$544	.dwtag  DW_TAG_member
	.dwattr $C$DW$544, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$544, DW_AT_name("CID0")
	.dwattr $C$DW$544, DW_AT_TI_symbol_name("CID0")
	.dwattr $C$DW$544, DW_AT_data_member_location[DW_OP_plus_uconst 0xff0]
	.dwattr $C$DW$544, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$544, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$544, DW_AT_decl_line(0x347)
	.dwattr $C$DW$544, DW_AT_decl_column(0x12)

$C$DW$545	.dwtag  DW_TAG_member
	.dwattr $C$DW$545, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$545, DW_AT_name("CID1")
	.dwattr $C$DW$545, DW_AT_TI_symbol_name("CID1")
	.dwattr $C$DW$545, DW_AT_data_member_location[DW_OP_plus_uconst 0xff4]
	.dwattr $C$DW$545, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$545, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$545, DW_AT_decl_line(0x348)
	.dwattr $C$DW$545, DW_AT_decl_column(0x12)

$C$DW$546	.dwtag  DW_TAG_member
	.dwattr $C$DW$546, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$546, DW_AT_name("CID2")
	.dwattr $C$DW$546, DW_AT_TI_symbol_name("CID2")
	.dwattr $C$DW$546, DW_AT_data_member_location[DW_OP_plus_uconst 0xff8]
	.dwattr $C$DW$546, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$546, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$546, DW_AT_decl_line(0x349)
	.dwattr $C$DW$546, DW_AT_decl_column(0x12)

$C$DW$547	.dwtag  DW_TAG_member
	.dwattr $C$DW$547, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$547, DW_AT_name("CID3")
	.dwattr $C$DW$547, DW_AT_TI_symbol_name("CID3")
	.dwattr $C$DW$547, DW_AT_data_member_location[DW_OP_plus_uconst 0xffc]
	.dwattr $C$DW$547, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$547, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$547, DW_AT_decl_line(0x34a)
	.dwattr $C$DW$547, DW_AT_decl_column(0x12)

	.dwattr $C$DW$T$55, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$T$55, DW_AT_decl_line(0x32a)
	.dwattr $C$DW$T$55, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$55

$C$DW$T$211	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$211, DW_AT_name("ITM_Type")
	.dwattr $C$DW$T$211, DW_AT_type(*$C$DW$T$55)
	.dwattr $C$DW$T$211, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$211, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$T$211, DW_AT_decl_line(0x34b)
	.dwattr $C$DW$T$211, DW_AT_decl_column(0x03)


$C$DW$T$56	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$56, DW_AT_byte_size(0x5c)
$C$DW$548	.dwtag  DW_TAG_member
	.dwattr $C$DW$548, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$548, DW_AT_name("CTRL")
	.dwattr $C$DW$548, DW_AT_TI_symbol_name("CTRL")
	.dwattr $C$DW$548, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$548, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$548, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$548, DW_AT_decl_line(0x392)
	.dwattr $C$DW$548, DW_AT_decl_column(0x12)

$C$DW$549	.dwtag  DW_TAG_member
	.dwattr $C$DW$549, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$549, DW_AT_name("CYCCNT")
	.dwattr $C$DW$549, DW_AT_TI_symbol_name("CYCCNT")
	.dwattr $C$DW$549, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$549, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$549, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$549, DW_AT_decl_line(0x393)
	.dwattr $C$DW$549, DW_AT_decl_column(0x12)

$C$DW$550	.dwtag  DW_TAG_member
	.dwattr $C$DW$550, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$550, DW_AT_name("CPICNT")
	.dwattr $C$DW$550, DW_AT_TI_symbol_name("CPICNT")
	.dwattr $C$DW$550, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$550, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$550, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$550, DW_AT_decl_line(0x394)
	.dwattr $C$DW$550, DW_AT_decl_column(0x12)

$C$DW$551	.dwtag  DW_TAG_member
	.dwattr $C$DW$551, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$551, DW_AT_name("EXCCNT")
	.dwattr $C$DW$551, DW_AT_TI_symbol_name("EXCCNT")
	.dwattr $C$DW$551, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$551, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$551, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$551, DW_AT_decl_line(0x395)
	.dwattr $C$DW$551, DW_AT_decl_column(0x12)

$C$DW$552	.dwtag  DW_TAG_member
	.dwattr $C$DW$552, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$552, DW_AT_name("SLEEPCNT")
	.dwattr $C$DW$552, DW_AT_TI_symbol_name("SLEEPCNT")
	.dwattr $C$DW$552, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$552, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$552, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$552, DW_AT_decl_line(0x396)
	.dwattr $C$DW$552, DW_AT_decl_column(0x12)

$C$DW$553	.dwtag  DW_TAG_member
	.dwattr $C$DW$553, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$553, DW_AT_name("LSUCNT")
	.dwattr $C$DW$553, DW_AT_TI_symbol_name("LSUCNT")
	.dwattr $C$DW$553, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$553, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$553, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$553, DW_AT_decl_line(0x397)
	.dwattr $C$DW$553, DW_AT_decl_column(0x12)

$C$DW$554	.dwtag  DW_TAG_member
	.dwattr $C$DW$554, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$554, DW_AT_name("FOLDCNT")
	.dwattr $C$DW$554, DW_AT_TI_symbol_name("FOLDCNT")
	.dwattr $C$DW$554, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$554, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$554, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$554, DW_AT_decl_line(0x398)
	.dwattr $C$DW$554, DW_AT_decl_column(0x12)

$C$DW$555	.dwtag  DW_TAG_member
	.dwattr $C$DW$555, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$555, DW_AT_name("PCSR")
	.dwattr $C$DW$555, DW_AT_TI_symbol_name("PCSR")
	.dwattr $C$DW$555, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$555, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$555, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$555, DW_AT_decl_line(0x399)
	.dwattr $C$DW$555, DW_AT_decl_column(0x12)

$C$DW$556	.dwtag  DW_TAG_member
	.dwattr $C$DW$556, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$556, DW_AT_name("COMP0")
	.dwattr $C$DW$556, DW_AT_TI_symbol_name("COMP0")
	.dwattr $C$DW$556, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$556, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$556, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$556, DW_AT_decl_line(0x39a)
	.dwattr $C$DW$556, DW_AT_decl_column(0x12)

$C$DW$557	.dwtag  DW_TAG_member
	.dwattr $C$DW$557, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$557, DW_AT_name("MASK0")
	.dwattr $C$DW$557, DW_AT_TI_symbol_name("MASK0")
	.dwattr $C$DW$557, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$557, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$557, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$557, DW_AT_decl_line(0x39b)
	.dwattr $C$DW$557, DW_AT_decl_column(0x12)

$C$DW$558	.dwtag  DW_TAG_member
	.dwattr $C$DW$558, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$558, DW_AT_name("FUNCTION0")
	.dwattr $C$DW$558, DW_AT_TI_symbol_name("FUNCTION0")
	.dwattr $C$DW$558, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$558, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$558, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$558, DW_AT_decl_line(0x39c)
	.dwattr $C$DW$558, DW_AT_decl_column(0x12)

$C$DW$559	.dwtag  DW_TAG_member
	.dwattr $C$DW$559, DW_AT_type(*$C$DW$T$45)
	.dwattr $C$DW$559, DW_AT_name("RESERVED0")
	.dwattr $C$DW$559, DW_AT_TI_symbol_name("RESERVED0")
	.dwattr $C$DW$559, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$559, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$559, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$559, DW_AT_decl_line(0x39d)
	.dwattr $C$DW$559, DW_AT_decl_column(0x12)

$C$DW$560	.dwtag  DW_TAG_member
	.dwattr $C$DW$560, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$560, DW_AT_name("COMP1")
	.dwattr $C$DW$560, DW_AT_TI_symbol_name("COMP1")
	.dwattr $C$DW$560, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr $C$DW$560, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$560, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$560, DW_AT_decl_line(0x39e)
	.dwattr $C$DW$560, DW_AT_decl_column(0x12)

$C$DW$561	.dwtag  DW_TAG_member
	.dwattr $C$DW$561, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$561, DW_AT_name("MASK1")
	.dwattr $C$DW$561, DW_AT_TI_symbol_name("MASK1")
	.dwattr $C$DW$561, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr $C$DW$561, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$561, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$561, DW_AT_decl_line(0x39f)
	.dwattr $C$DW$561, DW_AT_decl_column(0x12)

$C$DW$562	.dwtag  DW_TAG_member
	.dwattr $C$DW$562, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$562, DW_AT_name("FUNCTION1")
	.dwattr $C$DW$562, DW_AT_TI_symbol_name("FUNCTION1")
	.dwattr $C$DW$562, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr $C$DW$562, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$562, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$562, DW_AT_decl_line(0x3a0)
	.dwattr $C$DW$562, DW_AT_decl_column(0x12)

$C$DW$563	.dwtag  DW_TAG_member
	.dwattr $C$DW$563, DW_AT_type(*$C$DW$T$45)
	.dwattr $C$DW$563, DW_AT_name("RESERVED1")
	.dwattr $C$DW$563, DW_AT_TI_symbol_name("RESERVED1")
	.dwattr $C$DW$563, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
	.dwattr $C$DW$563, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$563, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$563, DW_AT_decl_line(0x3a1)
	.dwattr $C$DW$563, DW_AT_decl_column(0x12)

$C$DW$564	.dwtag  DW_TAG_member
	.dwattr $C$DW$564, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$564, DW_AT_name("COMP2")
	.dwattr $C$DW$564, DW_AT_TI_symbol_name("COMP2")
	.dwattr $C$DW$564, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
	.dwattr $C$DW$564, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$564, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$564, DW_AT_decl_line(0x3a2)
	.dwattr $C$DW$564, DW_AT_decl_column(0x12)

$C$DW$565	.dwtag  DW_TAG_member
	.dwattr $C$DW$565, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$565, DW_AT_name("MASK2")
	.dwattr $C$DW$565, DW_AT_TI_symbol_name("MASK2")
	.dwattr $C$DW$565, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
	.dwattr $C$DW$565, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$565, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$565, DW_AT_decl_line(0x3a3)
	.dwattr $C$DW$565, DW_AT_decl_column(0x12)

$C$DW$566	.dwtag  DW_TAG_member
	.dwattr $C$DW$566, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$566, DW_AT_name("FUNCTION2")
	.dwattr $C$DW$566, DW_AT_TI_symbol_name("FUNCTION2")
	.dwattr $C$DW$566, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
	.dwattr $C$DW$566, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$566, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$566, DW_AT_decl_line(0x3a4)
	.dwattr $C$DW$566, DW_AT_decl_column(0x12)

$C$DW$567	.dwtag  DW_TAG_member
	.dwattr $C$DW$567, DW_AT_type(*$C$DW$T$45)
	.dwattr $C$DW$567, DW_AT_name("RESERVED2")
	.dwattr $C$DW$567, DW_AT_TI_symbol_name("RESERVED2")
	.dwattr $C$DW$567, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
	.dwattr $C$DW$567, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$567, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$567, DW_AT_decl_line(0x3a5)
	.dwattr $C$DW$567, DW_AT_decl_column(0x12)

$C$DW$568	.dwtag  DW_TAG_member
	.dwattr $C$DW$568, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$568, DW_AT_name("COMP3")
	.dwattr $C$DW$568, DW_AT_TI_symbol_name("COMP3")
	.dwattr $C$DW$568, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
	.dwattr $C$DW$568, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$568, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$568, DW_AT_decl_line(0x3a6)
	.dwattr $C$DW$568, DW_AT_decl_column(0x12)

$C$DW$569	.dwtag  DW_TAG_member
	.dwattr $C$DW$569, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$569, DW_AT_name("MASK3")
	.dwattr $C$DW$569, DW_AT_TI_symbol_name("MASK3")
	.dwattr $C$DW$569, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
	.dwattr $C$DW$569, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$569, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$569, DW_AT_decl_line(0x3a7)
	.dwattr $C$DW$569, DW_AT_decl_column(0x12)

$C$DW$570	.dwtag  DW_TAG_member
	.dwattr $C$DW$570, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$570, DW_AT_name("FUNCTION3")
	.dwattr $C$DW$570, DW_AT_TI_symbol_name("FUNCTION3")
	.dwattr $C$DW$570, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
	.dwattr $C$DW$570, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$570, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$570, DW_AT_decl_line(0x3a8)
	.dwattr $C$DW$570, DW_AT_decl_column(0x12)

	.dwattr $C$DW$T$56, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$T$56, DW_AT_decl_line(0x391)
	.dwattr $C$DW$T$56, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$56

$C$DW$T$212	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$212, DW_AT_name("DWT_Type")
	.dwattr $C$DW$T$212, DW_AT_type(*$C$DW$T$56)
	.dwattr $C$DW$T$212, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$212, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$T$212, DW_AT_decl_line(0x3a9)
	.dwattr $C$DW$T$212, DW_AT_decl_column(0x03)


$C$DW$T$63	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$63, DW_AT_byte_size(0xfd0)
$C$DW$571	.dwtag  DW_TAG_member
	.dwattr $C$DW$571, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$571, DW_AT_name("SSPSR")
	.dwattr $C$DW$571, DW_AT_TI_symbol_name("SSPSR")
	.dwattr $C$DW$571, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$571, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$571, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$571, DW_AT_decl_line(0x425)
	.dwattr $C$DW$571, DW_AT_decl_column(0x12)

$C$DW$572	.dwtag  DW_TAG_member
	.dwattr $C$DW$572, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$572, DW_AT_name("CSPSR")
	.dwattr $C$DW$572, DW_AT_TI_symbol_name("CSPSR")
	.dwattr $C$DW$572, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$572, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$572, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$572, DW_AT_decl_line(0x426)
	.dwattr $C$DW$572, DW_AT_decl_column(0x12)

$C$DW$573	.dwtag  DW_TAG_member
	.dwattr $C$DW$573, DW_AT_type(*$C$DW$T$57)
	.dwattr $C$DW$573, DW_AT_name("RESERVED0")
	.dwattr $C$DW$573, DW_AT_TI_symbol_name("RESERVED0")
	.dwattr $C$DW$573, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$573, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$573, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$573, DW_AT_decl_line(0x427)
	.dwattr $C$DW$573, DW_AT_decl_column(0x12)

$C$DW$574	.dwtag  DW_TAG_member
	.dwattr $C$DW$574, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$574, DW_AT_name("ACPR")
	.dwattr $C$DW$574, DW_AT_TI_symbol_name("ACPR")
	.dwattr $C$DW$574, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$574, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$574, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$574, DW_AT_decl_line(0x428)
	.dwattr $C$DW$574, DW_AT_decl_column(0x12)

$C$DW$575	.dwtag  DW_TAG_member
	.dwattr $C$DW$575, DW_AT_type(*$C$DW$T$58)
	.dwattr $C$DW$575, DW_AT_name("RESERVED1")
	.dwattr $C$DW$575, DW_AT_TI_symbol_name("RESERVED1")
	.dwattr $C$DW$575, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$575, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$575, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$575, DW_AT_decl_line(0x429)
	.dwattr $C$DW$575, DW_AT_decl_column(0x12)

$C$DW$576	.dwtag  DW_TAG_member
	.dwattr $C$DW$576, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$576, DW_AT_name("SPPR")
	.dwattr $C$DW$576, DW_AT_TI_symbol_name("SPPR")
	.dwattr $C$DW$576, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
	.dwattr $C$DW$576, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$576, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$576, DW_AT_decl_line(0x42a)
	.dwattr $C$DW$576, DW_AT_decl_column(0x12)

$C$DW$577	.dwtag  DW_TAG_member
	.dwattr $C$DW$577, DW_AT_type(*$C$DW$T$59)
	.dwattr $C$DW$577, DW_AT_name("RESERVED2")
	.dwattr $C$DW$577, DW_AT_TI_symbol_name("RESERVED2")
	.dwattr $C$DW$577, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
	.dwattr $C$DW$577, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$577, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$577, DW_AT_decl_line(0x42b)
	.dwattr $C$DW$577, DW_AT_decl_column(0x12)

$C$DW$578	.dwtag  DW_TAG_member
	.dwattr $C$DW$578, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$578, DW_AT_name("FFSR")
	.dwattr $C$DW$578, DW_AT_TI_symbol_name("FFSR")
	.dwattr $C$DW$578, DW_AT_data_member_location[DW_OP_plus_uconst 0x300]
	.dwattr $C$DW$578, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$578, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$578, DW_AT_decl_line(0x42c)
	.dwattr $C$DW$578, DW_AT_decl_column(0x12)

$C$DW$579	.dwtag  DW_TAG_member
	.dwattr $C$DW$579, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$579, DW_AT_name("FFCR")
	.dwattr $C$DW$579, DW_AT_TI_symbol_name("FFCR")
	.dwattr $C$DW$579, DW_AT_data_member_location[DW_OP_plus_uconst 0x304]
	.dwattr $C$DW$579, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$579, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$579, DW_AT_decl_line(0x42d)
	.dwattr $C$DW$579, DW_AT_decl_column(0x12)

$C$DW$580	.dwtag  DW_TAG_member
	.dwattr $C$DW$580, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$580, DW_AT_name("FSCR")
	.dwattr $C$DW$580, DW_AT_TI_symbol_name("FSCR")
	.dwattr $C$DW$580, DW_AT_data_member_location[DW_OP_plus_uconst 0x308]
	.dwattr $C$DW$580, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$580, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$580, DW_AT_decl_line(0x42e)
	.dwattr $C$DW$580, DW_AT_decl_column(0x12)

$C$DW$581	.dwtag  DW_TAG_member
	.dwattr $C$DW$581, DW_AT_type(*$C$DW$T$60)
	.dwattr $C$DW$581, DW_AT_name("RESERVED3")
	.dwattr $C$DW$581, DW_AT_TI_symbol_name("RESERVED3")
	.dwattr $C$DW$581, DW_AT_data_member_location[DW_OP_plus_uconst 0x30c]
	.dwattr $C$DW$581, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$581, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$581, DW_AT_decl_line(0x42f)
	.dwattr $C$DW$581, DW_AT_decl_column(0x12)

$C$DW$582	.dwtag  DW_TAG_member
	.dwattr $C$DW$582, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$582, DW_AT_name("TRIGGER")
	.dwattr $C$DW$582, DW_AT_TI_symbol_name("TRIGGER")
	.dwattr $C$DW$582, DW_AT_data_member_location[DW_OP_plus_uconst 0xee8]
	.dwattr $C$DW$582, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$582, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$582, DW_AT_decl_line(0x430)
	.dwattr $C$DW$582, DW_AT_decl_column(0x12)

$C$DW$583	.dwtag  DW_TAG_member
	.dwattr $C$DW$583, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$583, DW_AT_name("FIFO0")
	.dwattr $C$DW$583, DW_AT_TI_symbol_name("FIFO0")
	.dwattr $C$DW$583, DW_AT_data_member_location[DW_OP_plus_uconst 0xeec]
	.dwattr $C$DW$583, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$583, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$583, DW_AT_decl_line(0x431)
	.dwattr $C$DW$583, DW_AT_decl_column(0x12)

$C$DW$584	.dwtag  DW_TAG_member
	.dwattr $C$DW$584, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$584, DW_AT_name("ITATBCTR2")
	.dwattr $C$DW$584, DW_AT_TI_symbol_name("ITATBCTR2")
	.dwattr $C$DW$584, DW_AT_data_member_location[DW_OP_plus_uconst 0xef0]
	.dwattr $C$DW$584, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$584, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$584, DW_AT_decl_line(0x432)
	.dwattr $C$DW$584, DW_AT_decl_column(0x12)

$C$DW$585	.dwtag  DW_TAG_member
	.dwattr $C$DW$585, DW_AT_type(*$C$DW$T$45)
	.dwattr $C$DW$585, DW_AT_name("RESERVED4")
	.dwattr $C$DW$585, DW_AT_TI_symbol_name("RESERVED4")
	.dwattr $C$DW$585, DW_AT_data_member_location[DW_OP_plus_uconst 0xef4]
	.dwattr $C$DW$585, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$585, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$585, DW_AT_decl_line(0x433)
	.dwattr $C$DW$585, DW_AT_decl_column(0x12)

$C$DW$586	.dwtag  DW_TAG_member
	.dwattr $C$DW$586, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$586, DW_AT_name("ITATBCTR0")
	.dwattr $C$DW$586, DW_AT_TI_symbol_name("ITATBCTR0")
	.dwattr $C$DW$586, DW_AT_data_member_location[DW_OP_plus_uconst 0xef8]
	.dwattr $C$DW$586, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$586, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$586, DW_AT_decl_line(0x434)
	.dwattr $C$DW$586, DW_AT_decl_column(0x12)

$C$DW$587	.dwtag  DW_TAG_member
	.dwattr $C$DW$587, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$587, DW_AT_name("FIFO1")
	.dwattr $C$DW$587, DW_AT_TI_symbol_name("FIFO1")
	.dwattr $C$DW$587, DW_AT_data_member_location[DW_OP_plus_uconst 0xefc]
	.dwattr $C$DW$587, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$587, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$587, DW_AT_decl_line(0x435)
	.dwattr $C$DW$587, DW_AT_decl_column(0x12)

$C$DW$588	.dwtag  DW_TAG_member
	.dwattr $C$DW$588, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$588, DW_AT_name("ITCTRL")
	.dwattr $C$DW$588, DW_AT_TI_symbol_name("ITCTRL")
	.dwattr $C$DW$588, DW_AT_data_member_location[DW_OP_plus_uconst 0xf00]
	.dwattr $C$DW$588, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$588, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$588, DW_AT_decl_line(0x436)
	.dwattr $C$DW$588, DW_AT_decl_column(0x12)

$C$DW$589	.dwtag  DW_TAG_member
	.dwattr $C$DW$589, DW_AT_type(*$C$DW$T$61)
	.dwattr $C$DW$589, DW_AT_name("RESERVED5")
	.dwattr $C$DW$589, DW_AT_TI_symbol_name("RESERVED5")
	.dwattr $C$DW$589, DW_AT_data_member_location[DW_OP_plus_uconst 0xf04]
	.dwattr $C$DW$589, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$589, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$589, DW_AT_decl_line(0x437)
	.dwattr $C$DW$589, DW_AT_decl_column(0x12)

$C$DW$590	.dwtag  DW_TAG_member
	.dwattr $C$DW$590, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$590, DW_AT_name("CLAIMSET")
	.dwattr $C$DW$590, DW_AT_TI_symbol_name("CLAIMSET")
	.dwattr $C$DW$590, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa0]
	.dwattr $C$DW$590, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$590, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$590, DW_AT_decl_line(0x438)
	.dwattr $C$DW$590, DW_AT_decl_column(0x12)

$C$DW$591	.dwtag  DW_TAG_member
	.dwattr $C$DW$591, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$591, DW_AT_name("CLAIMCLR")
	.dwattr $C$DW$591, DW_AT_TI_symbol_name("CLAIMCLR")
	.dwattr $C$DW$591, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa4]
	.dwattr $C$DW$591, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$591, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$591, DW_AT_decl_line(0x439)
	.dwattr $C$DW$591, DW_AT_decl_column(0x12)

$C$DW$592	.dwtag  DW_TAG_member
	.dwattr $C$DW$592, DW_AT_type(*$C$DW$T$62)
	.dwattr $C$DW$592, DW_AT_name("RESERVED7")
	.dwattr $C$DW$592, DW_AT_TI_symbol_name("RESERVED7")
	.dwattr $C$DW$592, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa8]
	.dwattr $C$DW$592, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$592, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$592, DW_AT_decl_line(0x43a)
	.dwattr $C$DW$592, DW_AT_decl_column(0x12)

$C$DW$593	.dwtag  DW_TAG_member
	.dwattr $C$DW$593, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$593, DW_AT_name("DEVID")
	.dwattr $C$DW$593, DW_AT_TI_symbol_name("DEVID")
	.dwattr $C$DW$593, DW_AT_data_member_location[DW_OP_plus_uconst 0xfc8]
	.dwattr $C$DW$593, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$593, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$593, DW_AT_decl_line(0x43b)
	.dwattr $C$DW$593, DW_AT_decl_column(0x12)

$C$DW$594	.dwtag  DW_TAG_member
	.dwattr $C$DW$594, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$594, DW_AT_name("DEVTYPE")
	.dwattr $C$DW$594, DW_AT_TI_symbol_name("DEVTYPE")
	.dwattr $C$DW$594, DW_AT_data_member_location[DW_OP_plus_uconst 0xfcc]
	.dwattr $C$DW$594, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$594, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$594, DW_AT_decl_line(0x43c)
	.dwattr $C$DW$594, DW_AT_decl_column(0x12)

	.dwattr $C$DW$T$63, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$T$63, DW_AT_decl_line(0x424)
	.dwattr $C$DW$T$63, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$63

$C$DW$T$213	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$213, DW_AT_name("TPI_Type")
	.dwattr $C$DW$T$213, DW_AT_type(*$C$DW$T$63)
	.dwattr $C$DW$T$213, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$213, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$T$213, DW_AT_decl_line(0x43d)
	.dwattr $C$DW$T$213, DW_AT_decl_column(0x03)


$C$DW$T$64	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$64, DW_AT_byte_size(0x2c)
$C$DW$595	.dwtag  DW_TAG_member
	.dwattr $C$DW$595, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$595, DW_AT_name("TYPE")
	.dwattr $C$DW$595, DW_AT_TI_symbol_name("TYPE")
	.dwattr $C$DW$595, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$595, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$595, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$595, DW_AT_decl_line(0x4c1)
	.dwattr $C$DW$595, DW_AT_decl_column(0x12)

$C$DW$596	.dwtag  DW_TAG_member
	.dwattr $C$DW$596, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$596, DW_AT_name("CTRL")
	.dwattr $C$DW$596, DW_AT_TI_symbol_name("CTRL")
	.dwattr $C$DW$596, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$596, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$596, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$596, DW_AT_decl_line(0x4c2)
	.dwattr $C$DW$596, DW_AT_decl_column(0x12)

$C$DW$597	.dwtag  DW_TAG_member
	.dwattr $C$DW$597, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$597, DW_AT_name("RNR")
	.dwattr $C$DW$597, DW_AT_TI_symbol_name("RNR")
	.dwattr $C$DW$597, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$597, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$597, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$597, DW_AT_decl_line(0x4c3)
	.dwattr $C$DW$597, DW_AT_decl_column(0x12)

$C$DW$598	.dwtag  DW_TAG_member
	.dwattr $C$DW$598, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$598, DW_AT_name("RBAR")
	.dwattr $C$DW$598, DW_AT_TI_symbol_name("RBAR")
	.dwattr $C$DW$598, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$598, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$598, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$598, DW_AT_decl_line(0x4c4)
	.dwattr $C$DW$598, DW_AT_decl_column(0x12)

$C$DW$599	.dwtag  DW_TAG_member
	.dwattr $C$DW$599, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$599, DW_AT_name("RASR")
	.dwattr $C$DW$599, DW_AT_TI_symbol_name("RASR")
	.dwattr $C$DW$599, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$599, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$599, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$599, DW_AT_decl_line(0x4c5)
	.dwattr $C$DW$599, DW_AT_decl_column(0x12)

$C$DW$600	.dwtag  DW_TAG_member
	.dwattr $C$DW$600, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$600, DW_AT_name("RBAR_A1")
	.dwattr $C$DW$600, DW_AT_TI_symbol_name("RBAR_A1")
	.dwattr $C$DW$600, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$600, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$600, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$600, DW_AT_decl_line(0x4c6)
	.dwattr $C$DW$600, DW_AT_decl_column(0x12)

$C$DW$601	.dwtag  DW_TAG_member
	.dwattr $C$DW$601, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$601, DW_AT_name("RASR_A1")
	.dwattr $C$DW$601, DW_AT_TI_symbol_name("RASR_A1")
	.dwattr $C$DW$601, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$601, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$601, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$601, DW_AT_decl_line(0x4c7)
	.dwattr $C$DW$601, DW_AT_decl_column(0x12)

$C$DW$602	.dwtag  DW_TAG_member
	.dwattr $C$DW$602, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$602, DW_AT_name("RBAR_A2")
	.dwattr $C$DW$602, DW_AT_TI_symbol_name("RBAR_A2")
	.dwattr $C$DW$602, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$602, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$602, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$602, DW_AT_decl_line(0x4c8)
	.dwattr $C$DW$602, DW_AT_decl_column(0x12)

$C$DW$603	.dwtag  DW_TAG_member
	.dwattr $C$DW$603, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$603, DW_AT_name("RASR_A2")
	.dwattr $C$DW$603, DW_AT_TI_symbol_name("RASR_A2")
	.dwattr $C$DW$603, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$603, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$603, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$603, DW_AT_decl_line(0x4c9)
	.dwattr $C$DW$603, DW_AT_decl_column(0x12)

$C$DW$604	.dwtag  DW_TAG_member
	.dwattr $C$DW$604, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$604, DW_AT_name("RBAR_A3")
	.dwattr $C$DW$604, DW_AT_TI_symbol_name("RBAR_A3")
	.dwattr $C$DW$604, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$604, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$604, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$604, DW_AT_decl_line(0x4ca)
	.dwattr $C$DW$604, DW_AT_decl_column(0x12)

$C$DW$605	.dwtag  DW_TAG_member
	.dwattr $C$DW$605, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$605, DW_AT_name("RASR_A3")
	.dwattr $C$DW$605, DW_AT_TI_symbol_name("RASR_A3")
	.dwattr $C$DW$605, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$605, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$605, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$605, DW_AT_decl_line(0x4cb)
	.dwattr $C$DW$605, DW_AT_decl_column(0x12)

	.dwattr $C$DW$T$64, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$T$64, DW_AT_decl_line(0x4c0)
	.dwattr $C$DW$T$64, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$64

$C$DW$T$214	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$214, DW_AT_name("MPU_Type")
	.dwattr $C$DW$T$214, DW_AT_type(*$C$DW$T$64)
	.dwattr $C$DW$T$214, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$214, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$T$214, DW_AT_decl_line(0x4cc)
	.dwattr $C$DW$T$214, DW_AT_decl_column(0x03)


$C$DW$T$65	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$65, DW_AT_byte_size(0x18)
$C$DW$606	.dwtag  DW_TAG_member
	.dwattr $C$DW$606, DW_AT_type(*$C$DW$T$45)
	.dwattr $C$DW$606, DW_AT_name("RESERVED0")
	.dwattr $C$DW$606, DW_AT_TI_symbol_name("RESERVED0")
	.dwattr $C$DW$606, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$606, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$606, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$606, DW_AT_decl_line(0x51f)
	.dwattr $C$DW$606, DW_AT_decl_column(0x12)

$C$DW$607	.dwtag  DW_TAG_member
	.dwattr $C$DW$607, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$607, DW_AT_name("FPCCR")
	.dwattr $C$DW$607, DW_AT_TI_symbol_name("FPCCR")
	.dwattr $C$DW$607, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$607, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$607, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$607, DW_AT_decl_line(0x520)
	.dwattr $C$DW$607, DW_AT_decl_column(0x12)

$C$DW$608	.dwtag  DW_TAG_member
	.dwattr $C$DW$608, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$608, DW_AT_name("FPCAR")
	.dwattr $C$DW$608, DW_AT_TI_symbol_name("FPCAR")
	.dwattr $C$DW$608, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$608, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$608, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$608, DW_AT_decl_line(0x521)
	.dwattr $C$DW$608, DW_AT_decl_column(0x12)

$C$DW$609	.dwtag  DW_TAG_member
	.dwattr $C$DW$609, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$609, DW_AT_name("FPDSCR")
	.dwattr $C$DW$609, DW_AT_TI_symbol_name("FPDSCR")
	.dwattr $C$DW$609, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$609, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$609, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$609, DW_AT_decl_line(0x522)
	.dwattr $C$DW$609, DW_AT_decl_column(0x12)

$C$DW$610	.dwtag  DW_TAG_member
	.dwattr $C$DW$610, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$610, DW_AT_name("MVFR0")
	.dwattr $C$DW$610, DW_AT_TI_symbol_name("MVFR0")
	.dwattr $C$DW$610, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$610, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$610, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$610, DW_AT_decl_line(0x523)
	.dwattr $C$DW$610, DW_AT_decl_column(0x12)

$C$DW$611	.dwtag  DW_TAG_member
	.dwattr $C$DW$611, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$611, DW_AT_name("MVFR1")
	.dwattr $C$DW$611, DW_AT_TI_symbol_name("MVFR1")
	.dwattr $C$DW$611, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$611, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$611, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$611, DW_AT_decl_line(0x524)
	.dwattr $C$DW$611, DW_AT_decl_column(0x12)

	.dwattr $C$DW$T$65, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$T$65, DW_AT_decl_line(0x51e)
	.dwattr $C$DW$T$65, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$65

$C$DW$T$215	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$215, DW_AT_name("FPU_Type")
	.dwattr $C$DW$T$215, DW_AT_type(*$C$DW$T$65)
	.dwattr $C$DW$T$215, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$215, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$T$215, DW_AT_decl_line(0x525)
	.dwattr $C$DW$T$215, DW_AT_decl_column(0x03)


$C$DW$T$66	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$66, DW_AT_byte_size(0x10)
$C$DW$612	.dwtag  DW_TAG_member
	.dwattr $C$DW$612, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$612, DW_AT_name("DHCSR")
	.dwattr $C$DW$612, DW_AT_TI_symbol_name("DHCSR")
	.dwattr $C$DW$612, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$612, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$612, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$612, DW_AT_decl_line(0x589)
	.dwattr $C$DW$612, DW_AT_decl_column(0x12)

$C$DW$613	.dwtag  DW_TAG_member
	.dwattr $C$DW$613, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$613, DW_AT_name("DCRSR")
	.dwattr $C$DW$613, DW_AT_TI_symbol_name("DCRSR")
	.dwattr $C$DW$613, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$613, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$613, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$613, DW_AT_decl_line(0x58a)
	.dwattr $C$DW$613, DW_AT_decl_column(0x12)

$C$DW$614	.dwtag  DW_TAG_member
	.dwattr $C$DW$614, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$614, DW_AT_name("DCRDR")
	.dwattr $C$DW$614, DW_AT_TI_symbol_name("DCRDR")
	.dwattr $C$DW$614, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$614, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$614, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$614, DW_AT_decl_line(0x58b)
	.dwattr $C$DW$614, DW_AT_decl_column(0x12)

$C$DW$615	.dwtag  DW_TAG_member
	.dwattr $C$DW$615, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$615, DW_AT_name("DEMCR")
	.dwattr $C$DW$615, DW_AT_TI_symbol_name("DEMCR")
	.dwattr $C$DW$615, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$615, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$615, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$615, DW_AT_decl_line(0x58c)
	.dwattr $C$DW$615, DW_AT_decl_column(0x12)

	.dwattr $C$DW$T$66, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$T$66, DW_AT_decl_line(0x588)
	.dwattr $C$DW$T$66, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$66

$C$DW$T$216	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$216, DW_AT_name("CoreDebug_Type")
	.dwattr $C$DW$T$216, DW_AT_type(*$C$DW$T$66)
	.dwattr $C$DW$T$216, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$216, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$T$216, DW_AT_decl_line(0x58d)
	.dwattr $C$DW$T$216, DW_AT_decl_column(0x03)


$C$DW$T$69	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$69, DW_AT_byte_size(0x158)
$C$DW$616	.dwtag  DW_TAG_member
	.dwattr $C$DW$616, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$616, DW_AT_name("CTL0")
	.dwattr $C$DW$616, DW_AT_TI_symbol_name("CTL0")
	.dwattr $C$DW$616, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$616, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$616, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_2_40_00_10\source\ti\devices\msp432p4xx\inc\msp432p401r.h")
	.dwattr $C$DW$616, DW_AT_decl_line(0x16d)
	.dwattr $C$DW$616, DW_AT_decl_column(0x11)

$C$DW$617	.dwtag  DW_TAG_member
	.dwattr $C$DW$617, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$617, DW_AT_name("CTL1")
	.dwattr $C$DW$617, DW_AT_TI_symbol_name("CTL1")
	.dwattr $C$DW$617, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$617, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$617, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_2_40_00_10\source\ti\devices\msp432p4xx\inc\msp432p401r.h")
	.dwattr $C$DW$617, DW_AT_decl_line(0x16e)
	.dwattr $C$DW$617, DW_AT_decl_column(0x11)

$C$DW$618	.dwtag  DW_TAG_member
	.dwattr $C$DW$618, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$618, DW_AT_name("LO0")
	.dwattr $C$DW$618, DW_AT_TI_symbol_name("LO0")
	.dwattr $C$DW$618, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$618, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$618, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_2_40_00_10\source\ti\devices\msp432p4xx\inc\msp432p401r.h")
	.dwattr $C$DW$618, DW_AT_decl_line(0x16f)
	.dwattr $C$DW$618, DW_AT_decl_column(0x11)

$C$DW$619	.dwtag  DW_TAG_member
	.dwattr $C$DW$619, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$619, DW_AT_name("HI0")
	.dwattr $C$DW$619, DW_AT_TI_symbol_name("HI0")
	.dwattr $C$DW$619, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$619, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$619, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_2_40_00_10\source\ti\devices\msp432p4xx\inc\msp432p401r.h")
	.dwattr $C$DW$619, DW_AT_decl_line(0x170)
	.dwattr $C$DW$619, DW_AT_decl_column(0x11)

$C$DW$620	.dwtag  DW_TAG_member
	.dwattr $C$DW$620, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$620, DW_AT_name("LO1")
	.dwattr $C$DW$620, DW_AT_TI_symbol_name("LO1")
	.dwattr $C$DW$620, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$620, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$620, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_2_40_00_10\source\ti\devices\msp432p4xx\inc\msp432p401r.h")
	.dwattr $C$DW$620, DW_AT_decl_line(0x171)
	.dwattr $C$DW$620, DW_AT_decl_column(0x11)

$C$DW$621	.dwtag  DW_TAG_member
	.dwattr $C$DW$621, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$621, DW_AT_name("HI1")
	.dwattr $C$DW$621, DW_AT_TI_symbol_name("HI1")
	.dwattr $C$DW$621, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$621, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$621, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_2_40_00_10\source\ti\devices\msp432p4xx\inc\msp432p401r.h")
	.dwattr $C$DW$621, DW_AT_decl_line(0x172)
	.dwattr $C$DW$621, DW_AT_decl_column(0x11)

$C$DW$622	.dwtag  DW_TAG_member
	.dwattr $C$DW$622, DW_AT_type(*$C$DW$T$67)
	.dwattr $C$DW$622, DW_AT_name("MCTL")
	.dwattr $C$DW$622, DW_AT_TI_symbol_name("MCTL")
	.dwattr $C$DW$622, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$622, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$622, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_2_40_00_10\source\ti\devices\msp432p4xx\inc\msp432p401r.h")
	.dwattr $C$DW$622, DW_AT_decl_line(0x173)
	.dwattr $C$DW$622, DW_AT_decl_column(0x11)

$C$DW$623	.dwtag  DW_TAG_member
	.dwattr $C$DW$623, DW_AT_type(*$C$DW$T$67)
	.dwattr $C$DW$623, DW_AT_name("MEM")
	.dwattr $C$DW$623, DW_AT_TI_symbol_name("MEM")
	.dwattr $C$DW$623, DW_AT_data_member_location[DW_OP_plus_uconst 0x98]
	.dwattr $C$DW$623, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$623, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_2_40_00_10\source\ti\devices\msp432p4xx\inc\msp432p401r.h")
	.dwattr $C$DW$623, DW_AT_decl_line(0x174)
	.dwattr $C$DW$623, DW_AT_decl_column(0x11)

$C$DW$624	.dwtag  DW_TAG_member
	.dwattr $C$DW$624, DW_AT_type(*$C$DW$T$68)
	.dwattr $C$DW$624, DW_AT_name("RESERVED0")
	.dwattr $C$DW$624, DW_AT_TI_symbol_name("RESERVED0")
	.dwattr $C$DW$624, DW_AT_data_member_location[DW_OP_plus_uconst 0x118]
	.dwattr $C$DW$624, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$624, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_2_40_00_10\source\ti\devices\msp432p4xx\inc\msp432p401r.h")
	.dwattr $C$DW$624, DW_AT_decl_line(0x175)
	.dwattr $C$DW$624, DW_AT_decl_column(0x11)

$C$DW$625	.dwtag  DW_TAG_member
