read_verilog present_encrypt.v present_encrypt_pbox.v present_encrypt_sbox.v

synth -top PRESENT_ENCRYPT

flatten

dfflibmap -liberty msp432_cells.lib
abc -liberty msp432_cells.lib
clean

write_verilog synth.v
write_bitslice synth.slice
write_ccode synth.c
