# read the verilog
read_verilog simon_datapath_shiftreg.v simon_key_expansion_shiftreg.v top_module.v
# map to cells of msp432_cells.lib
synth -top top_module
flatten
dfflibmap -liberty msp432_cells.lib
abc -liberty msp432_cells.lib
clean
# create bitslice code
write_bitslice simon_ser.v
# create c code
write_ccode simon_ser_c.c
