;******************************************************************************
;* TI ARM C/C++ Codegen                                        PC v18.1.4.LTS *
;* Date/Time created: Sun Mar  1 13:08:47 2020                                *
;******************************************************************************
	.compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embedded_constants=on --endian=little --float_support=FPv4SPD16 --hll_source=on --object_format=elf --silicon_version=7M4 --symdebug:dwarf --symdebug:dwarf_version=3 --unaligned_access=on 
	.thumb

$C$DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr $C$DW$CU, DW_AT_name("../main.c")
	.dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v18.1.4.LTS Copyright (c) 1996-2018 Texas Instruments Incorporated")
	.dwattr $C$DW$CU, DW_AT_TI_version(0x01)
	.dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\pante\Desktop\psp_encrypt\aes\performance-evaluation\Debug")

$C$DW$1	.dwtag  DW_TAG_subprogram
	.dwattr $C$DW$1, DW_AT_name("Timer32_getValue")
	.dwattr $C$DW$1, DW_AT_TI_symbol_name("Timer32_getValue")
	.dwattr $C$DW$1, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1, DW_AT_declaration
	.dwattr $C$DW$1, DW_AT_external
	.dwattr $C$DW$1, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_2_40_00_10/source/ti/devices/msp432p4xx/driverlib/timer32.h")
	.dwattr $C$DW$1, DW_AT_decl_line(0xb4)
	.dwattr $C$DW$1, DW_AT_decl_column(0x11)
$C$DW$2	.dwtag  DW_TAG_formal_parameter

        ADD       V3, V3, A1            ; [DPU_V7M3_PIPE] |64| 
	.dwpsn	file "../main.c",line 62,column 16,is_stmt,isa 1
        BNE       ||$C$L6||             ; [DPU_V7M3_PIPE] |62| 
        ; BRANCHCC OCCURS {||$C$L6||}    ; [] |62| 
;* --------------------------------------------------------------------------*
	.dwpsn	file "../main.c",line 67,column 6,is_stmt,isa 1
        MOVS      A1, #10               ; [DPU_V7M3_PIPE] |67| 
        SDIV      A2, V3, A1            ; [DPU_V7M3_PIPE] |67| 
        ADR       A1, $C$SL2            ; [DPU_V7M3_PIPE] |67| 
$C$DW$322	.dwtag  DW_TAG_TI_branch
	.dwattr $C$DW$322, DW_AT_low_pc(0x00)
	.dwattr $C$DW$322, DW_AT_name("printf")
	.dwattr $C$DW$322, DW_AT_TI_call

        BL        printf                ; [DPU_V7M3_PIPE] |67| 
        ; CALL OCCURS {printf }          ; [] |67| 
        ADD       V2, SP, #1028         ; [DPU_V7M3_PIPE] 
	.dwpsn	file "../main.c",line 70,column 17,is_stmt,isa 1
        MOVS      V4, #64               ; [DPU_V7M3_PIPE] |70| 
;* --------------------------------------------------------------------------*
;*   BEGIN LOOP ||$C$L7||
;*
;*   Loop source line                : 70
;*   Loop closing brace source line  : 72
;*   Known Minimum Trip Count        : 64
;*   Known Maximum Trip Count        : 64
;*   Known Max Trip Count Factor     : 64
;* --------------------------------------------------------------------------*
||$C$L7||:    
	.dwpsn	file "../main.c",line 71,column 9,is_stmt,isa 1
        LDR       A1, [V2], #-4         ; [DPU_V7M3_PIPE] |71| 
        LSRS      A2, A1, #31           ; [DPU_V7M3_PIPE] |71| 
        ADR       A1, $C$SL3            ; [DPU_V7M3_PIPE] |71| 
$C$DW$323	.dwtag  DW_TAG_TI_branch
	.dwattr $C$DW$323, DW_AT_low_pc(0x00)
	.dwattr $C$DW$323, DW_AT_name("printf")
	.dwattr $C$DW$323, DW_AT_TI_call

        BL        printf                ; [DPU_V7M3_PIPE] |71| 
        ; CALL OCCURS {printf }          ; [] |71| 
	.dwpsn	file "../main.c",line 70,column 17,is_stmt,isa 1
        SUBS      V4, V4, #1            ; [DPU_V7M3_PIPE] |70| 
        BNE       ||$C$L7||             ; [DPU_V7M3_PIPE] |70| 
        ; BRANCHCC OCCURS {||$C$L7||}    ; [] |70| 
;* --------------------------------------------------------------------------*
	.dwpsn	file "../main.c",line 73,column 5,is_stmt,isa 1
        ADR       A1, $C$SL4            ; [DPU_V7M3_PIPE] |73| 
$C$DW$324	.dwtag  DW_TAG_TI_branch
	.dwattr $C$DW$324, DW_AT_low_pc(0x00)
	.dwattr $C$DW$324, DW_AT_name("printf")
	.dwattr $C$DW$324, DW_AT_TI_call

        BL        printf                ; [DPU_V7M3_PIPE] |73| 
        ; CALL OCCURS {printf }          ; [] |73| 
        LDR       A2, $C$CON3           ; [DPU_V7M3_PIPE] 
        MOV       A1, V1                ; [DPU_V7M3_PIPE] |73| 
        RSBS      A2, A2, #0            ; [DPU_V7M3_PIPE] 
        ADD       SP, SP, A2            ; [DPU_V7M3_PIPE] 
	.dwcfi	cfa_offset, 20
$C$DW$325	.dwtag  DW_TAG_TI_branch
	.dwattr $C$DW$325, DW_AT_low_pc(0x00)
	.dwattr $C$DW$325, DW_AT_TI_return

        POP       {V1, V2, V3, V4, PC}  ; [DPU_V7M3_PIPE] 
	.dwcfi	cfa_offset, 0
	.dwcfi	restore_reg, 7
	.dwcfi	restore_reg, 6
	.dwcfi	restore_reg, 5
	.dwcfi	restore_reg, 4
        ; BRANCH OCCURS                  ; [] 
	.dwattr $C$DW$308, DW_AT_TI_end_file("../main.c")
	.dwattr $C$DW$308, DW_AT_TI_end_line(0x1f3)
	.dwattr $C$DW$308, DW_AT_TI_end_column(0x01)
	.dwendentry
	.dwendtag $C$DW$308

;******************************************************************************
;* STRINGS                                                                    *
;******************************************************************************
	.sect	".text"
	.align	4
||$C$SL1||:	.string	"cycles = %4d ",10,0
	.align	4
||$C$SL2||:	.string	"mean cycle = %d",10,0
	.align	4
||$C$SL3||:	.string	"%1x",0
	.align	4
||$C$SL4||:	.string	10,0
;******************************************************************************
;* CONSTANT TABLE                                                             *
;******************************************************************************
	.sect	".text"
	.align	4
||$C$CON3||:	.bits	-1076,32
	.align	4
||$C$CON4||:	.bits	1073790976,32
;*****************************************************************************
;* UNDEFINED EXTERNAL REFERENCES                                             *
;*****************************************************************************
	.global	Timer32_getValue
	.global	Timer32_initModule
	.global	Timer32_startTimer
	.global	printf

;******************************************************************************
;* BUILD ATTRIBUTES                                                           *
;******************************************************************************
	.battr "TI", Tag_File, 1, Tag_LPM_INFO(1)
	.battr "TI", Tag_File, 1, Tag_PORTS_INIT_INFO("012345678901ABCDEFGHIJ01111111111000000000000000000000000000000000")
	.battr "aeabi", Tag_File, 1, Tag_ABI_PCS_wchar_t(2)
	.battr "aeabi", Tag_File, 1, Tag_ABI_FP_rounding(0)
	.battr "aeabi", Tag_File, 1, Tag_ABI_FP_denormal(0)
	.battr "aeabi", Tag_File, 1, Tag_ABI_FP_exceptions(0)
	.battr "aeabi", Tag_File, 1, Tag_ABI_FP_number_model(1)
	.battr "aeabi", Tag_File, 1, Tag_ABI_enum_size(1)
	.battr "aeabi", Tag_File, 1, Tag_ABI_optimization_goals(0)
	.battr "aeabi", Tag_File, 1, Tag_ABI_FP_optimization_goals(0)
	.battr "TI", Tag_File, 1, Tag_Bitfield_layout(0)
	.battr "aeabi", Tag_File, 1, Tag_ABI_VFP_args(3)
	.battr "TI", Tag_File, 1, Tag_FP_interface(1)

;******************************************************************************
;* TYPE INFORMATION                                                           *
;******************************************************************************

$C$DW$T$21	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$21, DW_AT_byte_size(0x10)
$C$DW$326	.dwtag  DW_TAG_member
	.dwattr $C$DW$326, DW_AT_type(*$C$DW$T$14)
	.dwattr $C$DW$326, DW_AT_name("__max_align1")
	.dwattr $C$DW$326, DW_AT_TI_symbol_name("__max_align1")
	.dwattr $C$DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$326, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$326, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.4.LTS/include/sys/_types.h")
	.dwattr $C$DW$326, DW_AT_decl_line(0x70)
	.dwattr $C$DW$326, DW_AT_decl_column(0x0c)

$C$DW$327	.dwtag  DW_TAG_member
	.dwattr $C$DW$327, DW_AT_type(*$C$DW$T$18)
	.dwattr $C$DW$327, DW_AT_name("__max_align2")
	.dwattr $C$DW$327, DW_AT_TI_symbol_name("__max_align2")
	.dwattr $C$DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$327, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$327, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.4.LTS/include/sys/_types.h")
	.dwattr $C$DW$327, DW_AT_decl_line(0x71)
	.dwattr $C$DW$327, DW_AT_decl_column(0x0e)

	.dwattr $C$DW$T$21, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.4.LTS/include/sys/_types.h")
	.dwattr $C$DW$T$21, DW_AT_decl_line(0x6f)
	.dwattr $C$DW$T$21, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$21

$C$DW$T$206	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$206, DW_AT_name("__max_align_t")
	.dwattr $C$DW$T$206, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$T$206, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$206, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.4.LTS/include/sys/_types.h")
	.dwattr $C$DW$T$206, DW_AT_decl_line(0x72)
	.dwattr $C$DW$T$206, DW_AT_decl_column(0x03)


$C$DW$T$24	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$24, DW_AT_byte_size(0x04)
$C$DW$328	.dwtag  DW_TAG_member
	.dwattr $C$DW$328, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$328, DW_AT_name("_reserved0")
	.dwattr $C$DW$328, DW_AT_TI_symbol_name("_reserved0")
	.dwattr $C$DW$328, DW_AT_bit_offset(0x10)
	.dwattr $C$DW$328, DW_AT_bit_size(0x10)
	.dwattr $C$DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$328, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$328, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$328, DW_AT_decl_line(0x105)
	.dwattr $C$DW$328, DW_AT_decl_column(0x0e)

$C$DW$329	.dwtag  DW_TAG_member
	.dwattr $C$DW$329, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$329, DW_AT_name("GE")
	.dwattr $C$DW$329, DW_AT_TI_symbol_name("GE")
	.dwattr $C$DW$329, DW_AT_bit_offset(0x0c)
	.dwattr $C$DW$329, DW_AT_bit_size(0x04)
	.dwattr $C$DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$329, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$329, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$329, DW_AT_decl_line(0x106)
	.dwattr $C$DW$329, DW_AT_decl_column(0x0e)

$C$DW$330	.dwtag  DW_TAG_member
	.dwattr $C$DW$330, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$330, DW_AT_name("_reserved1")
	.dwattr $C$DW$330, DW_AT_TI_symbol_name("_reserved1")
	.dwattr $C$DW$330, DW_AT_bit_offset(0x05)
	.dwattr $C$DW$330, DW_AT_bit_size(0x07)
	.dwattr $C$DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$330, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$330, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$330, DW_AT_decl_line(0x107)
	.dwattr $C$DW$330, DW_AT_decl_column(0x0e)

$C$DW$331	.dwtag  DW_TAG_member
	.dwattr $C$DW$331, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$331, DW_AT_name("Q")
	.dwattr $C$DW$331, DW_AT_TI_symbol_name("Q")
	.dwattr $C$DW$331, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$331, DW_AT_bit_size(0x01)
	.dwattr $C$DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$331, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$331, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$331, DW_AT_decl_line(0x108)
	.dwattr $C$DW$331, DW_AT_decl_column(0x0e)

$C$DW$332	.dwtag  DW_TAG_member
	.dwattr $C$DW$332, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$332, DW_AT_name("V")
	.dwattr $C$DW$332, DW_AT_TI_symbol_name("V")
	.dwattr $C$DW$332, DW_AT_bit_offset(0x03)
	.dwattr $C$DW$332, DW_AT_bit_size(0x01)
	.dwattr $C$DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$332, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$332, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$332, DW_AT_decl_line(0x109)
	.dwattr $C$DW$332, DW_AT_decl_column(0x0e)

$C$DW$333	.dwtag  DW_TAG_member
	.dwattr $C$DW$333, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$333, DW_AT_name("C")
	.dwattr $C$DW$333, DW_AT_TI_symbol_name("C")
	.dwattr $C$DW$333, DW_AT_bit_offset(0x02)
	.dwattr $C$DW$333, DW_AT_bit_size(0x01)
	.dwattr $C$DW$333, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$333, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$333, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$333, DW_AT_decl_line(0x10a)
	.dwattr $C$DW$333, DW_AT_decl_column(0x0e)

$C$DW$334	.dwtag  DW_TAG_member
	.dwattr $C$DW$334, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$334, DW_AT_name("Z")
	.dwattr $C$DW$334, DW_AT_TI_symbol_name("Z")
	.dwattr $C$DW$334, DW_AT_bit_offset(0x01)
	.dwattr $C$DW$334, DW_AT_bit_size(0x01)
	.dwattr $C$DW$334, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$334, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$334, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$334, DW_AT_decl_line(0x10b)
	.dwattr $C$DW$334, DW_AT_decl_column(0x0e)

$C$DW$335	.dwtag  DW_TAG_member
	.dwattr $C$DW$335, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$335, DW_AT_name("N")
	.dwattr $C$DW$335, DW_AT_TI_symbol_name("N")
	.dwattr $C$DW$335, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$335, DW_AT_bit_size(0x01)
	.dwattr $C$DW$335, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$335, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$335, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$335, DW_AT_decl_line(0x10c)
	.dwattr $C$DW$335, DW_AT_decl_column(0x0e)

	.dwattr $C$DW$T$24, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$T$24, DW_AT_decl_line(0x104)
	.dwattr $C$DW$T$24, DW_AT_decl_column(0x03)
	.dwendtag $C$DW$T$24


$C$DW$T$25	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$25, DW_AT_byte_size(0x04)
$C$DW$336	.dwtag  DW_TAG_member
	.dwattr $C$DW$336, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$336, DW_AT_name("ISR")
	.dwattr $C$DW$336, DW_AT_TI_symbol_name("ISR")
	.dwattr $C$DW$336, DW_AT_bit_offset(0x17)
	.dwattr $C$DW$336, DW_AT_bit_size(0x09)
	.dwattr $C$DW$336, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$336, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$336, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$336, DW_AT_decl_line(0x12c)
	.dwattr $C$DW$336, DW_AT_decl_column(0x0e)

$C$DW$337	.dwtag  DW_TAG_member
	.dwattr $C$DW$337, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$337, DW_AT_name("_reserved0")
	.dwattr $C$DW$337, DW_AT_TI_symbol_name("_reserved0")
	.dwattr $C$DW$337, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$337, DW_AT_bit_size(0x17)
	.dwattr $C$DW$337, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$337, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$337, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$337, DW_AT_decl_line(0x12d)
	.dwattr $C$DW$337, DW_AT_decl_column(0x0e)

	.dwattr $C$DW$T$25, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$T$25, DW_AT_decl_line(0x12b)
	.dwattr $C$DW$T$25, DW_AT_decl_column(0x03)
	.dwendtag $C$DW$T$25


$C$DW$T$26	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$26, DW_AT_byte_size(0x04)
$C$DW$338	.dwtag  DW_TAG_member
	.dwattr $C$DW$338, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$338, DW_AT_name("ISR")
	.dwattr $C$DW$338, DW_AT_TI_symbol_name("ISR")
	.dwattr $C$DW$338, DW_AT_bit_offset(0x17)
	.dwattr $C$DW$338, DW_AT_bit_size(0x09)
	.dwattr $C$DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$338, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$338, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$338, DW_AT_decl_line(0x13e)
	.dwattr $C$DW$338, DW_AT_decl_column(0x0e)

$C$DW$339	.dwtag  DW_TAG_member
	.dwattr $C$DW$339, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$339, DW_AT_name("_reserved0")
	.dwattr $C$DW$339, DW_AT_TI_symbol_name("_reserved0")
	.dwattr $C$DW$339, DW_AT_bit_offset(0x16)
	.dwattr $C$DW$339, DW_AT_bit_size(0x01)
	.dwattr $C$DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$339, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$339, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$339, DW_AT_decl_line(0x13f)
	.dwattr $C$DW$339, DW_AT_decl_column(0x0e)

$C$DW$340	.dwtag  DW_TAG_member
	.dwattr $C$DW$340, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$340, DW_AT_name("ICI_IT_1")
	.dwattr $C$DW$340, DW_AT_TI_symbol_name("ICI_IT_1")
	.dwattr $C$DW$340, DW_AT_bit_offset(0x10)
	.dwattr $C$DW$340, DW_AT_bit_size(0x06)
	.dwattr $C$DW$340, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$340, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$340, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$340, DW_AT_decl_line(0x140)
	.dwattr $C$DW$340, DW_AT_decl_column(0x0e)

$C$DW$341	.dwtag  DW_TAG_member
	.dwattr $C$DW$341, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$341, DW_AT_name("GE")
	.dwattr $C$DW$341, DW_AT_TI_symbol_name("GE")
	.dwattr $C$DW$341, DW_AT_bit_offset(0x0c)
	.dwattr $C$DW$341, DW_AT_bit_size(0x04)
	.dwattr $C$DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$341, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$341, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$341, DW_AT_decl_line(0x141)
	.dwattr $C$DW$341, DW_AT_decl_column(0x0e)

$C$DW$342	.dwtag  DW_TAG_member
	.dwattr $C$DW$342, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$342, DW_AT_name("_reserved1")
	.dwattr $C$DW$342, DW_AT_TI_symbol_name("_reserved1")
	.dwattr $C$DW$342, DW_AT_bit_offset(0x08)
	.dwattr $C$DW$342, DW_AT_bit_size(0x04)
	.dwattr $C$DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$342, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$342, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$342, DW_AT_decl_line(0x142)
	.dwattr $C$DW$342, DW_AT_decl_column(0x0e)

$C$DW$343	.dwtag  DW_TAG_member
	.dwattr $C$DW$343, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$343, DW_AT_name("T")
	.dwattr $C$DW$343, DW_AT_TI_symbol_name("T")
	.dwattr $C$DW$343, DW_AT_bit_offset(0x07)
	.dwattr $C$DW$343, DW_AT_bit_size(0x01)
	.dwattr $C$DW$343, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$343, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$343, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$343, DW_AT_decl_line(0x143)
	.dwattr $C$DW$343, DW_AT_decl_column(0x0e)

$C$DW$344	.dwtag  DW_TAG_member
	.dwattr $C$DW$344, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$344, DW_AT_name("ICI_IT_2")
	.dwattr $C$DW$344, DW_AT_TI_symbol_name("ICI_IT_2")
	.dwattr $C$DW$344, DW_AT_bit_offset(0x05)
	.dwattr $C$DW$344, DW_AT_bit_size(0x02)
	.dwattr $C$DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$344, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$344, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$344, DW_AT_decl_line(0x144)
	.dwattr $C$DW$344, DW_AT_decl_column(0x0e)

$C$DW$345	.dwtag  DW_TAG_member
	.dwattr $C$DW$345, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$345, DW_AT_name("Q")
	.dwattr $C$DW$345, DW_AT_TI_symbol_name("Q")
	.dwattr $C$DW$345, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$345, DW_AT_bit_size(0x01)
	.dwattr $C$DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$345, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$345, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$345, DW_AT_decl_line(0x145)
	.dwattr $C$DW$345, DW_AT_decl_column(0x0e)

$C$DW$346	.dwtag  DW_TAG_member
	.dwattr $C$DW$346, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$346, DW_AT_name("V")
	.dwattr $C$DW$346, DW_AT_TI_symbol_name("V")
	.dwattr $C$DW$346, DW_AT_bit_offset(0x03)
	.dwattr $C$DW$346, DW_AT_bit_size(0x01)
	.dwattr $C$DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$346, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$346, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$346, DW_AT_decl_line(0x146)
	.dwattr $C$DW$346, DW_AT_decl_column(0x0e)

$C$DW$347	.dwtag  DW_TAG_member
	.dwattr $C$DW$347, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$347, DW_AT_name("C")
	.dwattr $C$DW$347, DW_AT_TI_symbol_name("C")
	.dwattr $C$DW$347, DW_AT_bit_offset(0x02)
	.dwattr $C$DW$347, DW_AT_bit_size(0x01)
	.dwattr $C$DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$347, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$347, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$347, DW_AT_decl_line(0x147)
	.dwattr $C$DW$347, DW_AT_decl_column(0x0e)

$C$DW$348	.dwtag  DW_TAG_member
	.dwattr $C$DW$348, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$348, DW_AT_name("Z")
	.dwattr $C$DW$348, DW_AT_TI_symbol_name("Z")
	.dwattr $C$DW$348, DW_AT_bit_offset(0x01)
	.dwattr $C$DW$348, DW_AT_bit_size(0x01)
	.dwattr $C$DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$348, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$348, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$348, DW_AT_decl_line(0x148)
	.dwattr $C$DW$348, DW_AT_decl_column(0x0e)

$C$DW$349	.dwtag  DW_TAG_member
	.dwattr $C$DW$349, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$349, DW_AT_name("N")
	.dwattr $C$DW$349, DW_AT_TI_symbol_name("N")
	.dwattr $C$DW$349, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$349, DW_AT_bit_size(0x01)
	.dwattr $C$DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$349, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$349, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$349, DW_AT_decl_line(0x149)
	.dwattr $C$DW$349, DW_AT_decl_column(0x0e)

	.dwattr $C$DW$T$26, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$T$26, DW_AT_decl_line(0x13d)
	.dwattr $C$DW$T$26, DW_AT_decl_column(0x03)
	.dwendtag $C$DW$T$26


$C$DW$T$27	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$27, DW_AT_byte_size(0x04)
$C$DW$350	.dwtag  DW_TAG_member
	.dwattr $C$DW$350, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$350, DW_AT_name("nPRIV")
	.dwattr $C$DW$350, DW_AT_TI_symbol_name("nPRIV")
	.dwattr $C$DW$350, DW_AT_bit_offset(0x1f)
	.dwattr $C$DW$350, DW_AT_bit_size(0x01)
	.dwattr $C$DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$350, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$350, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$350, DW_AT_decl_line(0x175)
	.dwattr $C$DW$350, DW_AT_decl_column(0x0e)

$C$DW$351	.dwtag  DW_TAG_member
	.dwattr $C$DW$351, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$351, DW_AT_name("SPSEL")
	.dwattr $C$DW$351, DW_AT_TI_symbol_name("SPSEL")
	.dwattr $C$DW$351, DW_AT_bit_offset(0x1e)
	.dwattr $C$DW$351, DW_AT_bit_size(0x01)
	.dwattr $C$DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$351, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$351, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$351, DW_AT_decl_line(0x176)
	.dwattr $C$DW$351, DW_AT_decl_column(0x0e)

$C$DW$352	.dwtag  DW_TAG_member
	.dwattr $C$DW$352, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$352, DW_AT_name("FPCA")
	.dwattr $C$DW$352, DW_AT_TI_symbol_name("FPCA")
	.dwattr $C$DW$352, DW_AT_bit_offset(0x1d)
	.dwattr $C$DW$352, DW_AT_bit_size(0x01)
	.dwattr $C$DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$352, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$352, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$352, DW_AT_decl_line(0x177)
	.dwattr $C$DW$352, DW_AT_decl_column(0x0e)

$C$DW$353	.dwtag  DW_TAG_member
	.dwattr $C$DW$353, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$353, DW_AT_name("_reserved0")
	.dwattr $C$DW$353, DW_AT_TI_symbol_name("_reserved0")
	.dwattr $C$DW$353, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$353, DW_AT_bit_size(0x1d)
	.dwattr $C$DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$353, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$353, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$353, DW_AT_decl_line(0x178)
	.dwattr $C$DW$353, DW_AT_decl_column(0x0e)

	.dwattr $C$DW$T$27, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$T$27, DW_AT_decl_line(0x174)
	.dwattr $C$DW$T$27, DW_AT_decl_column(0x03)
	.dwendtag $C$DW$T$27


$C$DW$T$37	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$37, DW_AT_byte_size(0xe04)
$C$DW$354	.dwtag  DW_TAG_member
	.dwattr $C$DW$354, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$354, DW_AT_name("ISER")
	.dwattr $C$DW$354, DW_AT_TI_symbol_name("ISER")
	.dwattr $C$DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$354, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$354, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$354, DW_AT_decl_line(0x196)
	.dwattr $C$DW$354, DW_AT_decl_column(0x12)

$C$DW$355	.dwtag  DW_TAG_member
	.dwattr $C$DW$355, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$355, DW_AT_name("RESERVED0")
	.dwattr $C$DW$355, DW_AT_TI_symbol_name("RESERVED0")
	.dwattr $C$DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$355, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$355, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$355, DW_AT_decl_line(0x197)
	.dwattr $C$DW$355, DW_AT_decl_column(0x12)

$C$DW$356	.dwtag  DW_TAG_member
	.dwattr $C$DW$356, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$356, DW_AT_name("ICER")
	.dwattr $C$DW$356, DW_AT_TI_symbol_name("ICER")
	.dwattr $C$DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
	.dwattr $C$DW$356, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$356, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$356, DW_AT_decl_line(0x198)
	.dwattr $C$DW$356, DW_AT_decl_column(0x12)

$C$DW$357	.dwtag  DW_TAG_member
	.dwattr $C$DW$357, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$357, DW_AT_name("RSERVED1")
	.dwattr $C$DW$357, DW_AT_TI_symbol_name("RSERVED1")
	.dwattr $C$DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
	.dwattr $C$DW$357, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$357, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$357, DW_AT_decl_line(0x199)
	.dwattr $C$DW$357, DW_AT_decl_column(0x12)

$C$DW$358	.dwtag  DW_TAG_member
	.dwattr $C$DW$358, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$358, DW_AT_name("ISPR")
	.dwattr $C$DW$358, DW_AT_TI_symbol_name("ISPR")
	.dwattr $C$DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
	.dwattr $C$DW$358, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$358, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$358, DW_AT_decl_line(0x19a)
	.dwattr $C$DW$358, DW_AT_decl_column(0x12)

$C$DW$359	.dwtag  DW_TAG_member
	.dwattr $C$DW$359, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$359, DW_AT_name("RESERVED2")
	.dwattr $C$DW$359, DW_AT_TI_symbol_name("RESERVED2")
	.dwattr $C$DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0x120]
	.dwattr $C$DW$359, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$359, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$359, DW_AT_decl_line(0x19b)
	.dwattr $C$DW$359, DW_AT_decl_column(0x12)

$C$DW$360	.dwtag  DW_TAG_member
	.dwattr $C$DW$360, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$360, DW_AT_name("ICPR")
	.dwattr $C$DW$360, DW_AT_TI_symbol_name("ICPR")
	.dwattr $C$DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0x180]
	.dwattr $C$DW$360, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$360, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$360, DW_AT_decl_line(0x19c)
	.dwattr $C$DW$360, DW_AT_decl_column(0x12)

$C$DW$361	.dwtag  DW_TAG_member
	.dwattr $C$DW$361, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$361, DW_AT_name("RESERVED3")
	.dwattr $C$DW$361, DW_AT_TI_symbol_name("RESERVED3")
	.dwattr $C$DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a0]
	.dwattr $C$DW$361, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$361, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$361, DW_AT_decl_line(0x19d)
	.dwattr $C$DW$361, DW_AT_decl_column(0x12)

$C$DW$362	.dwtag  DW_TAG_member
	.dwattr $C$DW$362, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$362, DW_AT_name("IABR")
	.dwattr $C$DW$362, DW_AT_TI_symbol_name("IABR")
	.dwattr $C$DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0x200]
	.dwattr $C$DW$362, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$362, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$362, DW_AT_decl_line(0x19e)
	.dwattr $C$DW$362, DW_AT_decl_column(0x12)

$C$DW$363	.dwtag  DW_TAG_member
	.dwattr $C$DW$363, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$363, DW_AT_name("RESERVED4")
	.dwattr $C$DW$363, DW_AT_TI_symbol_name("RESERVED4")
	.dwattr $C$DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0x220]
	.dwattr $C$DW$363, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$363, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$363, DW_AT_decl_line(0x19f)
	.dwattr $C$DW$363, DW_AT_decl_column(0x12)

$C$DW$364	.dwtag  DW_TAG_member
	.dwattr $C$DW$364, DW_AT_type(*$C$DW$T$35)
	.dwattr $C$DW$364, DW_AT_name("IP")
	.dwattr $C$DW$364, DW_AT_TI_symbol_name("IP")
	.dwattr $C$DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0x300]
	.dwattr $C$DW$364, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$364, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$364, DW_AT_decl_line(0x1a0)
	.dwattr $C$DW$364, DW_AT_decl_column(0x12)

$C$DW$365	.dwtag  DW_TAG_member
	.dwattr $C$DW$365, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$365, DW_AT_name("RESERVED5")
	.dwattr $C$DW$365, DW_AT_TI_symbol_name("RESERVED5")
	.dwattr $C$DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0x3f0]
	.dwattr $C$DW$365, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$365, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$365, DW_AT_decl_line(0x1a1)
	.dwattr $C$DW$365, DW_AT_decl_column(0x12)

$C$DW$366	.dwtag  DW_TAG_member
	.dwattr $C$DW$366, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$366, DW_AT_name("STIR")
	.dwattr $C$DW$366, DW_AT_TI_symbol_name("STIR")
	.dwattr $C$DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0xe00]
	.dwattr $C$DW$366, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$366, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$366, DW_AT_decl_line(0x1a2)
	.dwattr $C$DW$366, DW_AT_decl_column(0x12)

	.dwattr $C$DW$T$37, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$T$37, DW_AT_decl_line(0x195)
	.dwattr $C$DW$T$37, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$37

$C$DW$T$207	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$207, DW_AT_name("NVIC_Type")
	.dwattr $C$DW$T$207, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$T$207, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$207, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$T$207, DW_AT_decl_line(0x1a3)
	.dwattr $C$DW$T$207, DW_AT_decl_column(0x04)


$C$DW$T$44	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$44, DW_AT_byte_size(0x8c)
$C$DW$367	.dwtag  DW_TAG_member
	.dwattr $C$DW$367, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$367, DW_AT_name("CPUID")
	.dwattr $C$DW$367, DW_AT_TI_symbol_name("CPUID")
	.dwattr $C$DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$367, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$367, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$367, DW_AT_decl_line(0x1b8)
	.dwattr $C$DW$367, DW_AT_decl_column(0x12)

$C$DW$368	.dwtag  DW_TAG_member
	.dwattr $C$DW$368, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$368, DW_AT_name("ICSR")
	.dwattr $C$DW$368, DW_AT_TI_symbol_name("ICSR")
	.dwattr $C$DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$368, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$368, DW_AT_decl_line(0x1b9)
	.dwattr $C$DW$368, DW_AT_decl_column(0x12)

$C$DW$369	.dwtag  DW_TAG_member
	.dwattr $C$DW$369, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$369, DW_AT_name("VTOR")
	.dwattr $C$DW$369, DW_AT_TI_symbol_name("VTOR")
	.dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$369, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$369, DW_AT_decl_line(0x1ba)
	.dwattr $C$DW$369, DW_AT_decl_column(0x12)

$C$DW$370	.dwtag  DW_TAG_member
	.dwattr $C$DW$370, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$370, DW_AT_name("AIRCR")
	.dwattr $C$DW$370, DW_AT_TI_symbol_name("AIRCR")
	.dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$370, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$370, DW_AT_decl_line(0x1bb)
	.dwattr $C$DW$370, DW_AT_decl_column(0x12)

$C$DW$371	.dwtag  DW_TAG_member
	.dwattr $C$DW$371, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$371, DW_AT_name("SCR")
	.dwattr $C$DW$371, DW_AT_TI_symbol_name("SCR")
	.dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$371, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$371, DW_AT_decl_line(0x1bc)
	.dwattr $C$DW$371, DW_AT_decl_column(0x12)

$C$DW$372	.dwtag  DW_TAG_member
	.dwattr $C$DW$372, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$372, DW_AT_name("CCR")
	.dwattr $C$DW$372, DW_AT_TI_symbol_name("CCR")
	.dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$372, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$372, DW_AT_decl_line(0x1bd)
	.dwattr $C$DW$372, DW_AT_decl_column(0x12)

$C$DW$373	.dwtag  DW_TAG_member
	.dwattr $C$DW$373, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$373, DW_AT_name("SHP")
	.dwattr $C$DW$373, DW_AT_TI_symbol_name("SHP")
	.dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$373, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$373, DW_AT_decl_line(0x1be)
	.dwattr $C$DW$373, DW_AT_decl_column(0x12)

$C$DW$374	.dwtag  DW_TAG_member
	.dwattr $C$DW$374, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$374, DW_AT_name("SHCSR")
	.dwattr $C$DW$374, DW_AT_TI_symbol_name("SHCSR")
	.dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$374, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$374, DW_AT_decl_line(0x1bf)
	.dwattr $C$DW$374, DW_AT_decl_column(0x12)

$C$DW$375	.dwtag  DW_TAG_member
	.dwattr $C$DW$375, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$375, DW_AT_name("CFSR")
	.dwattr $C$DW$375, DW_AT_TI_symbol_name("CFSR")
	.dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$375, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$375, DW_AT_decl_line(0x1c0)
	.dwattr $C$DW$375, DW_AT_decl_column(0x12)

$C$DW$376	.dwtag  DW_TAG_member
	.dwattr $C$DW$376, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$376, DW_AT_name("HFSR")
	.dwattr $C$DW$376, DW_AT_TI_symbol_name("HFSR")
	.dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$376, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$376, DW_AT_decl_line(0x1c1)
	.dwattr $C$DW$376, DW_AT_decl_column(0x12)

$C$DW$377	.dwtag  DW_TAG_member
	.dwattr $C$DW$377, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$377, DW_AT_name("DFSR")
	.dwattr $C$DW$377, DW_AT_TI_symbol_name("DFSR")
	.dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$377, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$377, DW_AT_decl_line(0x1c2)
	.dwattr $C$DW$377, DW_AT_decl_column(0x12)

$C$DW$378	.dwtag  DW_TAG_member
	.dwattr $C$DW$378, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$378, DW_AT_name("MMFAR")
	.dwattr $C$DW$378, DW_AT_TI_symbol_name("MMFAR")
	.dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$378, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$378, DW_AT_decl_line(0x1c3)
	.dwattr $C$DW$378, DW_AT_decl_column(0x12)

$C$DW$379	.dwtag  DW_TAG_member
	.dwattr $C$DW$379, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$379, DW_AT_name("BFAR")
	.dwattr $C$DW$379, DW_AT_TI_symbol_name("BFAR")
	.dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$379, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$379, DW_AT_decl_line(0x1c4)
	.dwattr $C$DW$379, DW_AT_decl_column(0x12)

$C$DW$380	.dwtag  DW_TAG_member
	.dwattr $C$DW$380, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$380, DW_AT_name("AFSR")
	.dwattr $C$DW$380, DW_AT_TI_symbol_name("AFSR")
	.dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
	.dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$380, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$380, DW_AT_decl_line(0x1c5)
	.dwattr $C$DW$380, DW_AT_decl_column(0x12)

$C$DW$381	.dwtag  DW_TAG_member
	.dwattr $C$DW$381, DW_AT_type(*$C$DW$T$40)
	.dwattr $C$DW$381, DW_AT_name("PFR")
	.dwattr $C$DW$381, DW_AT_TI_symbol_name("PFR")
	.dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
	.dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$381, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$381, DW_AT_decl_line(0x1c6)
	.dwattr $C$DW$381, DW_AT_decl_column(0x12)

$C$DW$382	.dwtag  DW_TAG_member
	.dwattr $C$DW$382, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$382, DW_AT_name("DFR")
	.dwattr $C$DW$382, DW_AT_TI_symbol_name("DFR")
	.dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
	.dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$382, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$382, DW_AT_decl_line(0x1c7)
	.dwattr $C$DW$382, DW_AT_decl_column(0x12)

$C$DW$383	.dwtag  DW_TAG_member
	.dwattr $C$DW$383, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$383, DW_AT_name("ADR")
	.dwattr $C$DW$383, DW_AT_TI_symbol_name("ADR")
	.dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
	.dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$383, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$383, DW_AT_decl_line(0x1c8)
	.dwattr $C$DW$383, DW_AT_decl_column(0x12)

$C$DW$384	.dwtag  DW_TAG_member
	.dwattr $C$DW$384, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$384, DW_AT_name("MMFR")
	.dwattr $C$DW$384, DW_AT_TI_symbol_name("MMFR")
	.dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
	.dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$384, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$384, DW_AT_decl_line(0x1c9)
	.dwattr $C$DW$384, DW_AT_decl_column(0x12)

$C$DW$385	.dwtag  DW_TAG_member
	.dwattr $C$DW$385, DW_AT_type(*$C$DW$T$42)
	.dwattr $C$DW$385, DW_AT_name("ISAR")
	.dwattr $C$DW$385, DW_AT_TI_symbol_name("ISAR")
	.dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
	.dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$385, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$385, DW_AT_decl_line(0x1ca)
	.dwattr $C$DW$385, DW_AT_decl_column(0x12)

$C$DW$386	.dwtag  DW_TAG_member
	.dwattr $C$DW$386, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$386, DW_AT_name("RESERVED0")
	.dwattr $C$DW$386, DW_AT_TI_symbol_name("RESERVED0")
	.dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0x74]
	.dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$386, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$386, DW_AT_decl_line(0x1cb)
	.dwattr $C$DW$386, DW_AT_decl_column(0x12)

$C$DW$387	.dwtag  DW_TAG_member
	.dwattr $C$DW$387, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$387, DW_AT_name("CPACR")
	.dwattr $C$DW$387, DW_AT_TI_symbol_name("CPACR")
	.dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
	.dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$387, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$387, DW_AT_decl_line(0x1cc)
	.dwattr $C$DW$387, DW_AT_decl_column(0x12)

	.dwattr $C$DW$T$44, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$T$44, DW_AT_decl_line(0x1b7)
	.dwattr $C$DW$T$44, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$44

$C$DW$T$208	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$208, DW_AT_name("SCB_Type")
	.dwattr $C$DW$T$208, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$T$208, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$208, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$T$208, DW_AT_decl_line(0x1cd)
	.dwattr $C$DW$T$208, DW_AT_decl_column(0x03)


$C$DW$T$46	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$46, DW_AT_byte_size(0x0c)
$C$DW$388	.dwtag  DW_TAG_member
	.dwattr $C$DW$388, DW_AT_type(*$C$DW$T$45)
	.dwattr $C$DW$388, DW_AT_name("RESERVED0")
	.dwattr $C$DW$388, DW_AT_TI_symbol_name("RESERVED0")
	.dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$388, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$388, DW_AT_decl_line(0x2cf)
	.dwattr $C$DW$388, DW_AT_decl_column(0x12)

$C$DW$389	.dwtag  DW_TAG_member
	.dwattr $C$DW$389, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$389, DW_AT_name("ICTR")
	.dwattr $C$DW$389, DW_AT_TI_symbol_name("ICTR")
	.dwattr $C$DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$389, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$389, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$389, DW_AT_decl_line(0x2d0)
	.dwattr $C$DW$389, DW_AT_decl_column(0x12)

$C$DW$390	.dwtag  DW_TAG_member
	.dwattr $C$DW$390, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$390, DW_AT_name("ACTLR")
	.dwattr $C$DW$390, DW_AT_TI_symbol_name("ACTLR")
	.dwattr $C$DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$390, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$390, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$390, DW_AT_decl_line(0x2d1)
	.dwattr $C$DW$390, DW_AT_decl_column(0x12)

	.dwattr $C$DW$T$46, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$T$46, DW_AT_decl_line(0x2ce)
	.dwattr $C$DW$T$46, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$46

$C$DW$T$209	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$209, DW_AT_name("SCnSCB_Type")
	.dwattr $C$DW$T$209, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$T$209, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$209, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$T$209, DW_AT_decl_line(0x2d2)
	.dwattr $C$DW$T$209, DW_AT_decl_column(0x03)


$C$DW$T$47	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$47, DW_AT_byte_size(0x10)
$C$DW$391	.dwtag  DW_TAG_member
	.dwattr $C$DW$391, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$391, DW_AT_name("CTRL")
	.dwattr $C$DW$391, DW_AT_TI_symbol_name("CTRL")
	.dwattr $C$DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$391, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$391, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$391, DW_AT_decl_line(0x2f7)
	.dwattr $C$DW$391, DW_AT_decl_column(0x12)

$C$DW$392	.dwtag  DW_TAG_member
	.dwattr $C$DW$392, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$392, DW_AT_name("LOAD")
	.dwattr $C$DW$392, DW_AT_TI_symbol_name("LOAD")
	.dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$392, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$392, DW_AT_decl_line(0x2f8)
	.dwattr $C$DW$392, DW_AT_decl_column(0x12)

$C$DW$393	.dwtag  DW_TAG_member
	.dwattr $C$DW$393, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$393, DW_AT_name("VAL")
	.dwattr $C$DW$393, DW_AT_TI_symbol_name("VAL")
	.dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$393, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$393, DW_AT_decl_line(0x2f9)
	.dwattr $C$DW$393, DW_AT_decl_column(0x12)

$C$DW$394	.dwtag  DW_TAG_member
	.dwattr $C$DW$394, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$394, DW_AT_name("CALIB")
	.dwattr $C$DW$394, DW_AT_TI_symbol_name("CALIB")
	.dwattr $C$DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$394, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$394, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$394, DW_AT_decl_line(0x2fa)
	.dwattr $C$DW$394, DW_AT_decl_column(0x12)

	.dwattr $C$DW$T$47, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$T$47, DW_AT_decl_line(0x2f6)
	.dwattr $C$DW$T$47, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$47

$C$DW$T$210	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$210, DW_AT_name("SysTick_Type")
	.dwattr $C$DW$T$210, DW_AT_type(*$C$DW$T$47)
	.dwattr $C$DW$T$210, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$210, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$T$210, DW_AT_decl_line(0x2fb)
	.dwattr $C$DW$T$210, DW_AT_decl_column(0x03)


$C$DW$T$55	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$55, DW_AT_byte_size(0x1000)
$C$DW$395	.dwtag  DW_TAG_member
	.dwattr $C$DW$395, DW_AT_type(*$C$DW$T$49)
	.dwattr $C$DW$395, DW_AT_name("PORT")
	.dwattr $C$DW$395, DW_AT_TI_symbol_name("PORT")
	.dwattr $C$DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$395, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$395, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$395, DW_AT_decl_line(0x330)
	.dwattr $C$DW$395, DW_AT_decl_column(0x06)

$C$DW$396	.dwtag  DW_TAG_member
	.dwattr $C$DW$396, DW_AT_type(*$C$DW$T$50)
	.dwattr $C$DW$396, DW_AT_name("RESERVED0")
	.dwattr $C$DW$396, DW_AT_TI_symbol_name("RESERVED0")
	.dwattr $C$DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
	.dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$396, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$396, DW_AT_decl_line(0x331)
	.dwattr $C$DW$396, DW_AT_decl_column(0x12)

$C$DW$397	.dwtag  DW_TAG_member
	.dwattr $C$DW$397, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$397, DW_AT_name("TER")
	.dwattr $C$DW$397, DW_AT_TI_symbol_name("TER")
	.dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0xe00]
	.dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$397, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$397, DW_AT_decl_line(0x332)
	.dwattr $C$DW$397, DW_AT_decl_column(0x12)

$C$DW$398	.dwtag  DW_TAG_member
	.dwattr $C$DW$398, DW_AT_type(*$C$DW$T$51)
	.dwattr $C$DW$398, DW_AT_name("RESERVED1")
	.dwattr $C$DW$398, DW_AT_TI_symbol_name("RESERVED1")
	.dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0xe04]
	.dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$398, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$398, DW_AT_decl_line(0x333)
	.dwattr $C$DW$398, DW_AT_decl_column(0x12)

$C$DW$399	.dwtag  DW_TAG_member
	.dwattr $C$DW$399, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$399, DW_AT_name("TPR")
	.dwattr $C$DW$399, DW_AT_TI_symbol_name("TPR")
	.dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0xe40]
	.dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$399, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$399, DW_AT_decl_line(0x334)
	.dwattr $C$DW$399, DW_AT_decl_column(0x12)

$C$DW$400	.dwtag  DW_TAG_member
	.dwattr $C$DW$400, DW_AT_type(*$C$DW$T$51)
	.dwattr $C$DW$400, DW_AT_name("RESERVED2")
	.dwattr $C$DW$400, DW_AT_TI_symbol_name("RESERVED2")
	.dwattr $C$DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0xe44]
	.dwattr $C$DW$400, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$400, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$400, DW_AT_decl_line(0x335)
	.dwattr $C$DW$400, DW_AT_decl_column(0x12)

$C$DW$401	.dwtag  DW_TAG_member
	.dwattr $C$DW$401, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$401, DW_AT_name("TCR")
	.dwattr $C$DW$401, DW_AT_TI_symbol_name("TCR")
	.dwattr $C$DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0xe80]
	.dwattr $C$DW$401, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$401, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$401, DW_AT_decl_line(0x336)
	.dwattr $C$DW$401, DW_AT_decl_column(0x12)

$C$DW$402	.dwtag  DW_TAG_member
	.dwattr $C$DW$402, DW_AT_type(*$C$DW$T$52)
	.dwattr $C$DW$402, DW_AT_name("RESERVED3")
	.dwattr $C$DW$402, DW_AT_TI_symbol_name("RESERVED3")
	.dwattr $C$DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0xe84]
	.dwattr $C$DW$402, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$402, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$402, DW_AT_decl_line(0x337)
	.dwattr $C$DW$402, DW_AT_decl_column(0x12)

$C$DW$403	.dwtag  DW_TAG_member
	.dwattr $C$DW$403, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$403, DW_AT_name("IWR")
	.dwattr $C$DW$403, DW_AT_TI_symbol_name("IWR")
	.dwattr $C$DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0xef8]
	.dwattr $C$DW$403, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$403, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$403, DW_AT_decl_line(0x338)
	.dwattr $C$DW$403, DW_AT_decl_column(0x12)

$C$DW$404	.dwtag  DW_TAG_member
	.dwattr $C$DW$404, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$404, DW_AT_name("IRR")
	.dwattr $C$DW$404, DW_AT_TI_symbol_name("IRR")
	.dwattr $C$DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0xefc]
	.dwattr $C$DW$404, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$404, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$404, DW_AT_decl_line(0x339)
	.dwattr $C$DW$404, DW_AT_decl_column(0x12)

$C$DW$405	.dwtag  DW_TAG_member
	.dwattr $C$DW$405, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$405, DW_AT_name("IMCR")
	.dwattr $C$DW$405, DW_AT_TI_symbol_name("IMCR")
	.dwattr $C$DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0xf00]
	.dwattr $C$DW$405, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$405, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$405, DW_AT_decl_line(0x33a)
	.dwattr $C$DW$405, DW_AT_decl_column(0x12)

$C$DW$406	.dwtag  DW_TAG_member
	.dwattr $C$DW$406, DW_AT_type(*$C$DW$T$53)
	.dwattr $C$DW$406, DW_AT_name("RESERVED4")
	.dwattr $C$DW$406, DW_AT_TI_symbol_name("RESERVED4")
	.dwattr $C$DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0xf04]
	.dwattr $C$DW$406, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$406, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$406, DW_AT_decl_line(0x33b)
	.dwattr $C$DW$406, DW_AT_decl_column(0x12)

$C$DW$407	.dwtag  DW_TAG_member
	.dwattr $C$DW$407, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$407, DW_AT_name("LAR")
	.dwattr $C$DW$407, DW_AT_TI_symbol_name("LAR")
	.dwattr $C$DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0xfb0]
	.dwattr $C$DW$407, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$407, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$407, DW_AT_decl_line(0x33c)
	.dwattr $C$DW$407, DW_AT_decl_column(0x12)

$C$DW$408	.dwtag  DW_TAG_member
	.dwattr $C$DW$408, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$408, DW_AT_name("LSR")
	.dwattr $C$DW$408, DW_AT_TI_symbol_name("LSR")
	.dwattr $C$DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0xfb4]
	.dwattr $C$DW$408, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$408, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$408, DW_AT_decl_line(0x33d)
	.dwattr $C$DW$408, DW_AT_decl_column(0x12)

$C$DW$409	.dwtag  DW_TAG_member
	.dwattr $C$DW$409, DW_AT_type(*$C$DW$T$54)
	.dwattr $C$DW$409, DW_AT_name("RESERVED5")
	.dwattr $C$DW$409, DW_AT_TI_symbol_name("RESERVED5")
	.dwattr $C$DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0xfb8]
	.dwattr $C$DW$409, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$409, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$409, DW_AT_decl_line(0x33e)
	.dwattr $C$DW$409, DW_AT_decl_column(0x12)

$C$DW$410	.dwtag  DW_TAG_member
	.dwattr $C$DW$410, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$410, DW_AT_name("PID4")
	.dwattr $C$DW$410, DW_AT_TI_symbol_name("PID4")
	.dwattr $C$DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0xfd0]
	.dwattr $C$DW$410, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$410, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$410, DW_AT_decl_line(0x33f)
	.dwattr $C$DW$410, DW_AT_decl_column(0x12)

$C$DW$411	.dwtag  DW_TAG_member
	.dwattr $C$DW$411, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$411, DW_AT_name("PID5")
	.dwattr $C$DW$411, DW_AT_TI_symbol_name("PID5")
	.dwattr $C$DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0xfd4]
	.dwattr $C$DW$411, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$411, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$411, DW_AT_decl_line(0x340)
	.dwattr $C$DW$411, DW_AT_decl_column(0x12)

$C$DW$412	.dwtag  DW_TAG_member
	.dwattr $C$DW$412, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$412, DW_AT_name("PID6")
	.dwattr $C$DW$412, DW_AT_TI_symbol_name("PID6")
	.dwattr $C$DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0xfd8]
	.dwattr $C$DW$412, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$412, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$412, DW_AT_decl_line(0x341)
	.dwattr $C$DW$412, DW_AT_decl_column(0x12)

$C$DW$413	.dwtag  DW_TAG_member
	.dwattr $C$DW$413, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$413, DW_AT_name("PID7")
	.dwattr $C$DW$413, DW_AT_TI_symbol_name("PID7")
	.dwattr $C$DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0xfdc]
	.dwattr $C$DW$413, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$413, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$413, DW_AT_decl_line(0x342)
	.dwattr $C$DW$413, DW_AT_decl_column(0x12)

$C$DW$414	.dwtag  DW_TAG_member
	.dwattr $C$DW$414, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$414, DW_AT_name("PID0")
	.dwattr $C$DW$414, DW_AT_TI_symbol_name("PID0")
	.dwattr $C$DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe0]
	.dwattr $C$DW$414, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$414, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$414, DW_AT_decl_line(0x343)
	.dwattr $C$DW$414, DW_AT_decl_column(0x12)

$C$DW$415	.dwtag  DW_TAG_member
	.dwattr $C$DW$415, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$415, DW_AT_name("PID1")
	.dwattr $C$DW$415, DW_AT_TI_symbol_name("PID1")
	.dwattr $C$DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe4]
	.dwattr $C$DW$415, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$415, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$415, DW_AT_decl_line(0x344)
	.dwattr $C$DW$415, DW_AT_decl_column(0x12)

$C$DW$416	.dwtag  DW_TAG_member
	.dwattr $C$DW$416, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$416, DW_AT_name("PID2")
	.dwattr $C$DW$416, DW_AT_TI_symbol_name("PID2")
	.dwattr $C$DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe8]
	.dwattr $C$DW$416, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$416, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$416, DW_AT_decl_line(0x345)
	.dwattr $C$DW$416, DW_AT_decl_column(0x12)

$C$DW$417	.dwtag  DW_TAG_member
	.dwattr $C$DW$417, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$417, DW_AT_name("PID3")
	.dwattr $C$DW$417, DW_AT_TI_symbol_name("PID3")
	.dwattr $C$DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0xfec]
	.dwattr $C$DW$417, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$417, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$417, DW_AT_decl_line(0x346)
	.dwattr $C$DW$417, DW_AT_decl_column(0x12)

$C$DW$418	.dwtag  DW_TAG_member
	.dwattr $C$DW$418, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$418, DW_AT_name("CID0")
	.dwattr $C$DW$418, DW_AT_TI_symbol_name("CID0")
	.dwattr $C$DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0xff0]
	.dwattr $C$DW$418, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$418, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$418, DW_AT_decl_line(0x347)
	.dwattr $C$DW$418, DW_AT_decl_column(0x12)

$C$DW$419	.dwtag  DW_TAG_member
	.dwattr $C$DW$419, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$419, DW_AT_name("CID1")
	.dwattr $C$DW$419, DW_AT_TI_symbol_name("CID1")
	.dwattr $C$DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0xff4]
	.dwattr $C$DW$419, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$419, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$419, DW_AT_decl_line(0x348)
	.dwattr $C$DW$419, DW_AT_decl_column(0x12)

$C$DW$420	.dwtag  DW_TAG_member
	.dwattr $C$DW$420, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$420, DW_AT_name("CID2")
	.dwattr $C$DW$420, DW_AT_TI_symbol_name("CID2")
	.dwattr $C$DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0xff8]
	.dwattr $C$DW$420, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$420, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$420, DW_AT_decl_line(0x349)
	.dwattr $C$DW$420, DW_AT_decl_column(0x12)

$C$DW$421	.dwtag  DW_TAG_member
	.dwattr $C$DW$421, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$421, DW_AT_name("CID3")
	.dwattr $C$DW$421, DW_AT_TI_symbol_name("CID3")
	.dwattr $C$DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0xffc]
	.dwattr $C$DW$421, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$421, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$421, DW_AT_decl_line(0x34a)
	.dwattr $C$DW$421, DW_AT_decl_column(0x12)

	.dwattr $C$DW$T$55, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$T$55, DW_AT_decl_line(0x32a)
	.dwattr $C$DW$T$55, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$55

$C$DW$T$211	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$211, DW_AT_name("ITM_Type")
	.dwattr $C$DW$T$211, DW_AT_type(*$C$DW$T$55)
	.dwattr $C$DW$T$211, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$211, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$T$211, DW_AT_decl_line(0x34b)
	.dwattr $C$DW$T$211, DW_AT_decl_column(0x03)


$C$DW$T$56	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$56, DW_AT_byte_size(0x5c)
$C$DW$422	.dwtag  DW_TAG_member
	.dwattr $C$DW$422, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$422, DW_AT_name("CTRL")
	.dwattr $C$DW$422, DW_AT_TI_symbol_name("CTRL")
	.dwattr $C$DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$422, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$422, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$422, DW_AT_decl_line(0x392)
	.dwattr $C$DW$422, DW_AT_decl_column(0x12)

$C$DW$423	.dwtag  DW_TAG_member
	.dwattr $C$DW$423, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$423, DW_AT_name("CYCCNT")
	.dwattr $C$DW$423, DW_AT_TI_symbol_name("CYCCNT")
	.dwattr $C$DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$423, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$423, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$423, DW_AT_decl_line(0x393)
	.dwattr $C$DW$423, DW_AT_decl_column(0x12)

$C$DW$424	.dwtag  DW_TAG_member
	.dwattr $C$DW$424, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$424, DW_AT_name("CPICNT")
	.dwattr $C$DW$424, DW_AT_TI_symbol_name("CPICNT")
	.dwattr $C$DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$424, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$424, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$424, DW_AT_decl_line(0x394)
	.dwattr $C$DW$424, DW_AT_decl_column(0x12)

$C$DW$425	.dwtag  DW_TAG_member
	.dwattr $C$DW$425, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$425, DW_AT_name("EXCCNT")
	.dwattr $C$DW$425, DW_AT_TI_symbol_name("EXCCNT")
	.dwattr $C$DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$425, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$425, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$425, DW_AT_decl_line(0x395)
	.dwattr $C$DW$425, DW_AT_decl_column(0x12)

$C$DW$426	.dwtag  DW_TAG_member
	.dwattr $C$DW$426, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$426, DW_AT_name("SLEEPCNT")
	.dwattr $C$DW$426, DW_AT_TI_symbol_name("SLEEPCNT")
	.dwattr $C$DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$426, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$426, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$426, DW_AT_decl_line(0x396)
	.dwattr $C$DW$426, DW_AT_decl_column(0x12)

$C$DW$427	.dwtag  DW_TAG_member
	.dwattr $C$DW$427, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$427, DW_AT_name("LSUCNT")
	.dwattr $C$DW$427, DW_AT_TI_symbol_name("LSUCNT")
	.dwattr $C$DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$427, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$427, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$427, DW_AT_decl_line(0x397)
	.dwattr $C$DW$427, DW_AT_decl_column(0x12)

$C$DW$428	.dwtag  DW_TAG_member
	.dwattr $C$DW$428, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$428, DW_AT_name("FOLDCNT")
	.dwattr $C$DW$428, DW_AT_TI_symbol_name("FOLDCNT")
	.dwattr $C$DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$428, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$428, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$428, DW_AT_decl_line(0x398)
	.dwattr $C$DW$428, DW_AT_decl_column(0x12)

$C$DW$429	.dwtag  DW_TAG_member
	.dwattr $C$DW$429, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$429, DW_AT_name("PCSR")
	.dwattr $C$DW$429, DW_AT_TI_symbol_name("PCSR")
	.dwattr $C$DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$429, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$429, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$429, DW_AT_decl_line(0x399)
	.dwattr $C$DW$429, DW_AT_decl_column(0x12)

$C$DW$430	.dwtag  DW_TAG_member
	.dwattr $C$DW$430, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$430, DW_AT_name("COMP0")
	.dwattr $C$DW$430, DW_AT_TI_symbol_name("COMP0")
	.dwattr $C$DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$430, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$430, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$430, DW_AT_decl_line(0x39a)
	.dwattr $C$DW$430, DW_AT_decl_column(0x12)

$C$DW$431	.dwtag  DW_TAG_member
	.dwattr $C$DW$431, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$431, DW_AT_name("MASK0")
	.dwattr $C$DW$431, DW_AT_TI_symbol_name("MASK0")
	.dwattr $C$DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$431, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$431, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$431, DW_AT_decl_line(0x39b)
	.dwattr $C$DW$431, DW_AT_decl_column(0x12)

$C$DW$432	.dwtag  DW_TAG_member
	.dwattr $C$DW$432, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$432, DW_AT_name("FUNCTION0")
	.dwattr $C$DW$432, DW_AT_TI_symbol_name("FUNCTION0")
	.dwattr $C$DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$432, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$432, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$432, DW_AT_decl_line(0x39c)
	.dwattr $C$DW$432, DW_AT_decl_column(0x12)

$C$DW$433	.dwtag  DW_TAG_member
	.dwattr $C$DW$433, DW_AT_type(*$C$DW$T$45)
	.dwattr $C$DW$433, DW_AT_name("RESERVED0")
	.dwattr $C$DW$433, DW_AT_TI_symbol_name("RESERVED0")
	.dwattr $C$DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$433, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$433, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$433, DW_AT_decl_line(0x39d)
	.dwattr $C$DW$433, DW_AT_decl_column(0x12)

$C$DW$434	.dwtag  DW_TAG_member
	.dwattr $C$DW$434, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$434, DW_AT_name("COMP1")
	.dwattr $C$DW$434, DW_AT_TI_symbol_name("COMP1")
	.dwattr $C$DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr $C$DW$434, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$434, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$434, DW_AT_decl_line(0x39e)
	.dwattr $C$DW$434, DW_AT_decl_column(0x12)

$C$DW$435	.dwtag  DW_TAG_member
	.dwattr $C$DW$435, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$435, DW_AT_name("MASK1")
	.dwattr $C$DW$435, DW_AT_TI_symbol_name("MASK1")
	.dwattr $C$DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr $C$DW$435, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$435, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$435, DW_AT_decl_line(0x39f)
	.dwattr $C$DW$435, DW_AT_decl_column(0x12)

$C$DW$436	.dwtag  DW_TAG_member
	.dwattr $C$DW$436, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$436, DW_AT_name("FUNCTION1")
	.dwattr $C$DW$436, DW_AT_TI_symbol_name("FUNCTION1")
	.dwattr $C$DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr $C$DW$436, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$436, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$436, DW_AT_decl_line(0x3a0)
	.dwattr $C$DW$436, DW_AT_decl_column(0x12)

$C$DW$437	.dwtag  DW_TAG_member
	.dwattr $C$DW$437, DW_AT_type(*$C$DW$T$45)
	.dwattr $C$DW$437, DW_AT_name("RESERVED1")
	.dwattr $C$DW$437, DW_AT_TI_symbol_name("RESERVED1")
	.dwattr $C$DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
	.dwattr $C$DW$437, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$437, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$437, DW_AT_decl_line(0x3a1)
	.dwattr $C$DW$437, DW_AT_decl_column(0x12)

$C$DW$438	.dwtag  DW_TAG_member
	.dwattr $C$DW$438, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$438, DW_AT_name("COMP2")
	.dwattr $C$DW$438, DW_AT_TI_symbol_name("COMP2")
	.dwattr $C$DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
	.dwattr $C$DW$438, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$438, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$438, DW_AT_decl_line(0x3a2)
	.dwattr $C$DW$438, DW_AT_decl_column(0x12)

$C$DW$439	.dwtag  DW_TAG_member
	.dwattr $C$DW$439, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$439, DW_AT_name("MASK2")
	.dwattr $C$DW$439, DW_AT_TI_symbol_name("MASK2")
	.dwattr $C$DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
	.dwattr $C$DW$439, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$439, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$439, DW_AT_decl_line(0x3a3)
	.dwattr $C$DW$439, DW_AT_decl_column(0x12)

$C$DW$440	.dwtag  DW_TAG_member
	.dwattr $C$DW$440, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$440, DW_AT_name("FUNCTION2")
	.dwattr $C$DW$440, DW_AT_TI_symbol_name("FUNCTION2")
	.dwattr $C$DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
	.dwattr $C$DW$440, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$440, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$440, DW_AT_decl_line(0x3a4)
	.dwattr $C$DW$440, DW_AT_decl_column(0x12)

$C$DW$441	.dwtag  DW_TAG_member
	.dwattr $C$DW$441, DW_AT_type(*$C$DW$T$45)
	.dwattr $C$DW$441, DW_AT_name("RESERVED2")
	.dwattr $C$DW$441, DW_AT_TI_symbol_name("RESERVED2")
	.dwattr $C$DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
	.dwattr $C$DW$441, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$441, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$441, DW_AT_decl_line(0x3a5)
	.dwattr $C$DW$441, DW_AT_decl_column(0x12)

$C$DW$442	.dwtag  DW_TAG_member
	.dwattr $C$DW$442, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$442, DW_AT_name("COMP3")
	.dwattr $C$DW$442, DW_AT_TI_symbol_name("COMP3")
	.dwattr $C$DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
	.dwattr $C$DW$442, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$442, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$442, DW_AT_decl_line(0x3a6)
	.dwattr $C$DW$442, DW_AT_decl_column(0x12)

$C$DW$443	.dwtag  DW_TAG_member
	.dwattr $C$DW$443, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$443, DW_AT_name("MASK3")
	.dwattr $C$DW$443, DW_AT_TI_symbol_name("MASK3")
	.dwattr $C$DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
	.dwattr $C$DW$443, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$443, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$443, DW_AT_decl_line(0x3a7)
	.dwattr $C$DW$443, DW_AT_decl_column(0x12)

$C$DW$444	.dwtag  DW_TAG_member
	.dwattr $C$DW$444, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$444, DW_AT_name("FUNCTION3")
	.dwattr $C$DW$444, DW_AT_TI_symbol_name("FUNCTION3")
	.dwattr $C$DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
	.dwattr $C$DW$444, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$444, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$444, DW_AT_decl_line(0x3a8)
	.dwattr $C$DW$444, DW_AT_decl_column(0x12)

	.dwattr $C$DW$T$56, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$T$56, DW_AT_decl_line(0x391)
	.dwattr $C$DW$T$56, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$56

$C$DW$T$212	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$212, DW_AT_name("DWT_Type")
	.dwattr $C$DW$T$212, DW_AT_type(*$C$DW$T$56)
	.dwattr $C$DW$T$212, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$212, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$T$212, DW_AT_decl_line(0x3a9)
	.dwattr $C$DW$T$212, DW_AT_decl_column(0x03)


$C$DW$T$63	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$63, DW_AT_byte_size(0xfd0)
$C$DW$445	.dwtag  DW_TAG_member
	.dwattr $C$DW$445, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$445, DW_AT_name("SSPSR")
	.dwattr $C$DW$445, DW_AT_TI_symbol_name("SSPSR")
	.dwattr $C$DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$445, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$445, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$445, DW_AT_decl_line(0x425)
	.dwattr $C$DW$445, DW_AT_decl_column(0x12)

$C$DW$446	.dwtag  DW_TAG_member
	.dwattr $C$DW$446, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$446, DW_AT_name("CSPSR")
	.dwattr $C$DW$446, DW_AT_TI_symbol_name("CSPSR")
	.dwattr $C$DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$446, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$446, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$446, DW_AT_decl_line(0x426)
	.dwattr $C$DW$446, DW_AT_decl_column(0x12)

$C$DW$447	.dwtag  DW_TAG_member
	.dwattr $C$DW$447, DW_AT_type(*$C$DW$T$57)
	.dwattr $C$DW$447, DW_AT_name("RESERVED0")
	.dwattr $C$DW$447, DW_AT_TI_symbol_name("RESERVED0")
	.dwattr $C$DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$447, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$447, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$447, DW_AT_decl_line(0x427)
	.dwattr $C$DW$447, DW_AT_decl_column(0x12)

$C$DW$448	.dwtag  DW_TAG_member
	.dwattr $C$DW$448, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$448, DW_AT_name("ACPR")
	.dwattr $C$DW$448, DW_AT_TI_symbol_name("ACPR")
	.dwattr $C$DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$448, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$448, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$448, DW_AT_decl_line(0x428)
	.dwattr $C$DW$448, DW_AT_decl_column(0x12)

$C$DW$449	.dwtag  DW_TAG_member
	.dwattr $C$DW$449, DW_AT_type(*$C$DW$T$58)
	.dwattr $C$DW$449, DW_AT_name("RESERVED1")
	.dwattr $C$DW$449, DW_AT_TI_symbol_name("RESERVED1")
	.dwattr $C$DW$449, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$449, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$449, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$449, DW_AT_decl_line(0x429)
	.dwattr $C$DW$449, DW_AT_decl_column(0x12)

$C$DW$450	.dwtag  DW_TAG_member
	.dwattr $C$DW$450, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$450, DW_AT_name("SPPR")
	.dwattr $C$DW$450, DW_AT_TI_symbol_name("SPPR")
	.dwattr $C$DW$450, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
	.dwattr $C$DW$450, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$450, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$450, DW_AT_decl_line(0x42a)
	.dwattr $C$DW$450, DW_AT_decl_column(0x12)

$C$DW$451	.dwtag  DW_TAG_member
	.dwattr $C$DW$451, DW_AT_type(*$C$DW$T$59)
	.dwattr $C$DW$451, DW_AT_name("RESERVED2")
	.dwattr $C$DW$451, DW_AT_TI_symbol_name("RESERVED2")
	.dwattr $C$DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
	.dwattr $C$DW$451, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$451, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$451, DW_AT_decl_line(0x42b)
	.dwattr $C$DW$451, DW_AT_decl_column(0x12)

$C$DW$452	.dwtag  DW_TAG_member
	.dwattr $C$DW$452, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$452, DW_AT_name("FFSR")
	.dwattr $C$DW$452, DW_AT_TI_symbol_name("FFSR")
	.dwattr $C$DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0x300]
	.dwattr $C$DW$452, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$452, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$452, DW_AT_decl_line(0x42c)
	.dwattr $C$DW$452, DW_AT_decl_column(0x12)

$C$DW$453	.dwtag  DW_TAG_member
	.dwattr $C$DW$453, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$453, DW_AT_name("FFCR")
	.dwattr $C$DW$453, DW_AT_TI_symbol_name("FFCR")
	.dwattr $C$DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0x304]
	.dwattr $C$DW$453, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$453, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$453, DW_AT_decl_line(0x42d)
	.dwattr $C$DW$453, DW_AT_decl_column(0x12)

$C$DW$454	.dwtag  DW_TAG_member
	.dwattr $C$DW$454, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$454, DW_AT_name("FSCR")
	.dwattr $C$DW$454, DW_AT_TI_symbol_name("FSCR")
	.dwattr $C$DW$454, DW_AT_data_member_location[DW_OP_plus_uconst 0x308]
	.dwattr $C$DW$454, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$454, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$454, DW_AT_decl_line(0x42e)
	.dwattr $C$DW$454, DW_AT_decl_column(0x12)

$C$DW$455	.dwtag  DW_TAG_member
	.dwattr $C$DW$455, DW_AT_type(*$C$DW$T$60)
	.dwattr $C$DW$455, DW_AT_name("RESERVED3")
	.dwattr $C$DW$455, DW_AT_TI_symbol_name("RESERVED3")
	.dwattr $C$DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0x30c]
	.dwattr $C$DW$455, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$455, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$455, DW_AT_decl_line(0x42f)
	.dwattr $C$DW$455, DW_AT_decl_column(0x12)

$C$DW$456	.dwtag  DW_TAG_member
	.dwattr $C$DW$456, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$456, DW_AT_name("TRIGGER")
	.dwattr $C$DW$456, DW_AT_TI_symbol_name("TRIGGER")
	.dwattr $C$DW$456, DW_AT_data_member_location[DW_OP_plus_uconst 0xee8]
	.dwattr $C$DW$456, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$456, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$456, DW_AT_decl_line(0x430)
	.dwattr $C$DW$456, DW_AT_decl_column(0x12)

$C$DW$457	.dwtag  DW_TAG_member
	.dwattr $C$DW$457, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$457, DW_AT_name("FIFO0")
	.dwattr $C$DW$457, DW_AT_TI_symbol_name("FIFO0")
	.dwattr $C$DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0xeec]
	.dwattr $C$DW$457, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$457, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$457, DW_AT_decl_line(0x431)
	.dwattr $C$DW$457, DW_AT_decl_column(0x12)

$C$DW$458	.dwtag  DW_TAG_member
	.dwattr $C$DW$458, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$458, DW_AT_name("ITATBCTR2")
	.dwattr $C$DW$458, DW_AT_TI_symbol_name("ITATBCTR2")
	.dwattr $C$DW$458, DW_AT_data_member_location[DW_OP_plus_uconst 0xef0]
	.dwattr $C$DW$458, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$458, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$458, DW_AT_decl_line(0x432)
	.dwattr $C$DW$458, DW_AT_decl_column(0x12)

$C$DW$459	.dwtag  DW_TAG_member
	.dwattr $C$DW$459, DW_AT_type(*$C$DW$T$45)
	.dwattr $C$DW$459, DW_AT_name("RESERVED4")
	.dwattr $C$DW$459, DW_AT_TI_symbol_name("RESERVED4")
	.dwattr $C$DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0xef4]
	.dwattr $C$DW$459, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$459, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$459, DW_AT_decl_line(0x433)
	.dwattr $C$DW$459, DW_AT_decl_column(0x12)

$C$DW$460	.dwtag  DW_TAG_member
	.dwattr $C$DW$460, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$460, DW_AT_name("ITATBCTR0")
	.dwattr $C$DW$460, DW_AT_TI_symbol_name("ITATBCTR0")
	.dwattr $C$DW$460, DW_AT_data_member_location[DW_OP_plus_uconst 0xef8]
	.dwattr $C$DW$460, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$460, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$460, DW_AT_decl_line(0x434)
	.dwattr $C$DW$460, DW_AT_decl_column(0x12)

$C$DW$461	.dwtag  DW_TAG_member
	.dwattr $C$DW$461, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$461, DW_AT_name("FIFO1")
	.dwattr $C$DW$461, DW_AT_TI_symbol_name("FIFO1")
	.dwattr $C$DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0xefc]
	.dwattr $C$DW$461, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$461, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$461, DW_AT_decl_line(0x435)
	.dwattr $C$DW$461, DW_AT_decl_column(0x12)

$C$DW$462	.dwtag  DW_TAG_member
	.dwattr $C$DW$462, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$462, DW_AT_name("ITCTRL")
	.dwattr $C$DW$462, DW_AT_TI_symbol_name("ITCTRL")
	.dwattr $C$DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0xf00]
	.dwattr $C$DW$462, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$462, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$462, DW_AT_decl_line(0x436)
	.dwattr $C$DW$462, DW_AT_decl_column(0x12)

$C$DW$463	.dwtag  DW_TAG_member
	.dwattr $C$DW$463, DW_AT_type(*$C$DW$T$61)
	.dwattr $C$DW$463, DW_AT_name("RESERVED5")
	.dwattr $C$DW$463, DW_AT_TI_symbol_name("RESERVED5")
	.dwattr $C$DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0xf04]
	.dwattr $C$DW$463, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$463, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$463, DW_AT_decl_line(0x437)
	.dwattr $C$DW$463, DW_AT_decl_column(0x12)

$C$DW$464	.dwtag  DW_TAG_member
	.dwattr $C$DW$464, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$464, DW_AT_name("CLAIMSET")
	.dwattr $C$DW$464, DW_AT_TI_symbol_name("CLAIMSET")
	.dwattr $C$DW$464, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa0]
	.dwattr $C$DW$464, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$464, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$464, DW_AT_decl_line(0x438)
	.dwattr $C$DW$464, DW_AT_decl_column(0x12)

$C$DW$465	.dwtag  DW_TAG_member
	.dwattr $C$DW$465, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$465, DW_AT_name("CLAIMCLR")
	.dwattr $C$DW$465, DW_AT_TI_symbol_name("CLAIMCLR")
	.dwattr $C$DW$465, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa4]
	.dwattr $C$DW$465, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$465, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$465, DW_AT_decl_line(0x439)
	.dwattr $C$DW$465, DW_AT_decl_column(0x12)

$C$DW$466	.dwtag  DW_TAG_member
	.dwattr $C$DW$466, DW_AT_type(*$C$DW$T$62)
	.dwattr $C$DW$466, DW_AT_name("RESERVED7")
	.dwattr $C$DW$466, DW_AT_TI_symbol_name("RESERVED7")
	.dwattr $C$DW$466, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa8]
	.dwattr $C$DW$466, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$466, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$466, DW_AT_decl_line(0x43a)
	.dwattr $C$DW$466, DW_AT_decl_column(0x12)

$C$DW$467	.dwtag  DW_TAG_member
	.dwattr $C$DW$467, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$467, DW_AT_name("DEVID")
	.dwattr $C$DW$467, DW_AT_TI_symbol_name("DEVID")
	.dwattr $C$DW$467, DW_AT_data_member_location[DW_OP_plus_uconst 0xfc8]
	.dwattr $C$DW$467, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$467, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$467, DW_AT_decl_line(0x43b)
	.dwattr $C$DW$467, DW_AT_decl_column(0x12)

$C$DW$468	.dwtag  DW_TAG_member
	.dwattr $C$DW$468, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$468, DW_AT_name("DEVTYPE")
	.dwattr $C$DW$468, DW_AT_TI_symbol_name("DEVTYPE")
	.dwattr $C$DW$468, DW_AT_data_member_location[DW_OP_plus_uconst 0xfcc]
	.dwattr $C$DW$468, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$468, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$468, DW_AT_decl_line(0x43c)
	.dwattr $C$DW$468, DW_AT_decl_column(0x12)

	.dwattr $C$DW$T$63, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$T$63, DW_AT_decl_line(0x424)
	.dwattr $C$DW$T$63, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$63

$C$DW$T$213	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$213, DW_AT_name("TPI_Type")
	.dwattr $C$DW$T$213, DW_AT_type(*$C$DW$T$63)
	.dwattr $C$DW$T$213, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$213, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$T$213, DW_AT_decl_line(0x43d)
	.dwattr $C$DW$T$213, DW_AT_decl_column(0x03)


$C$DW$T$64	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$64, DW_AT_byte_size(0x2c)
$C$DW$469	.dwtag  DW_TAG_member
	.dwattr $C$DW$469, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$469, DW_AT_name("TYPE")
	.dwattr $C$DW$469, DW_AT_TI_symbol_name("TYPE")
	.dwattr $C$DW$469, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$469, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$469, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$469, DW_AT_decl_line(0x4c1)
	.dwattr $C$DW$469, DW_AT_decl_column(0x12)

$C$DW$470	.dwtag  DW_TAG_member
	.dwattr $C$DW$470, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$470, DW_AT_name("CTRL")
	.dwattr $C$DW$470, DW_AT_TI_symbol_name("CTRL")
	.dwattr $C$DW$470, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$470, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$470, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$470, DW_AT_decl_line(0x4c2)
	.dwattr $C$DW$470, DW_AT_decl_column(0x12)

$C$DW$471	.dwtag  DW_TAG_member
	.dwattr $C$DW$471, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$471, DW_AT_name("RNR")
	.dwattr $C$DW$471, DW_AT_TI_symbol_name("RNR")
	.dwattr $C$DW$471, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$471, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$471, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$471, DW_AT_decl_line(0x4c3)
	.dwattr $C$DW$471, DW_AT_decl_column(0x12)

$C$DW$472	.dwtag  DW_TAG_member
	.dwattr $C$DW$472, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$472, DW_AT_name("RBAR")
	.dwattr $C$DW$472, DW_AT_TI_symbol_name("RBAR")
	.dwattr $C$DW$472, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$472, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$472, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$472, DW_AT_decl_line(0x4c4)
	.dwattr $C$DW$472, DW_AT_decl_column(0x12)

$C$DW$473	.dwtag  DW_TAG_member
	.dwattr $C$DW$473, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$473, DW_AT_name("RASR")
	.dwattr $C$DW$473, DW_AT_TI_symbol_name("RASR")
	.dwattr $C$DW$473, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$473, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$473, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$473, DW_AT_decl_line(0x4c5)
	.dwattr $C$DW$473, DW_AT_decl_column(0x12)

$C$DW$474	.dwtag  DW_TAG_member
	.dwattr $C$DW$474, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$474, DW_AT_name("RBAR_A1")
	.dwattr $C$DW$474, DW_AT_TI_symbol_name("RBAR_A1")
	.dwattr $C$DW$474, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$474, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$474, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$474, DW_AT_decl_line(0x4c6)
	.dwattr $C$DW$474, DW_AT_decl_column(0x12)

$C$DW$475	.dwtag  DW_TAG_member
	.dwattr $C$DW$475, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$475, DW_AT_name("RASR_A1")
	.dwattr $C$DW$475, DW_AT_TI_symbol_name("RASR_A1")
	.dwattr $C$DW$475, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$475, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$475, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$475, DW_AT_decl_line(0x4c7)
	.dwattr $C$DW$475, DW_AT_decl_column(0x12)

$C$DW$476	.dwtag  DW_TAG_member
	.dwattr $C$DW$476, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$476, DW_AT_name("RBAR_A2")
	.dwattr $C$DW$476, DW_AT_TI_symbol_name("RBAR_A2")
	.dwattr $C$DW$476, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$476, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$476, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$476, DW_AT_decl_line(0x4c8)
	.dwattr $C$DW$476, DW_AT_decl_column(0x12)

$C$DW$477	.dwtag  DW_TAG_member
	.dwattr $C$DW$477, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$477, DW_AT_name("RASR_A2")
	.dwattr $C$DW$477, DW_AT_TI_symbol_name("RASR_A2")
	.dwattr $C$DW$477, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$477, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$477, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$477, DW_AT_decl_line(0x4c9)
	.dwattr $C$DW$477, DW_AT_decl_column(0x12)

$C$DW$478	.dwtag  DW_TAG_member
	.dwattr $C$DW$478, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$478, DW_AT_name("RBAR_A3")
	.dwattr $C$DW$478, DW_AT_TI_symbol_name("RBAR_A3")
	.dwattr $C$DW$478, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$478, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$478, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$478, DW_AT_decl_line(0x4ca)
	.dwattr $C$DW$478, DW_AT_decl_column(0x12)

$C$DW$479	.dwtag  DW_TAG_member
	.dwattr $C$DW$479, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$479, DW_AT_name("RASR_A3")
	.dwattr $C$DW$479, DW_AT_TI_symbol_name("RASR_A3")
	.dwattr $C$DW$479, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$479, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$479, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$479, DW_AT_decl_line(0x4cb)
	.dwattr $C$DW$479, DW_AT_decl_column(0x12)

	.dwattr $C$DW$T$64, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$T$64, DW_AT_decl_line(0x4c0)
	.dwattr $C$DW$T$64, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$64

$C$DW$T$214	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$214, DW_AT_name("MPU_Type")
	.dwattr $C$DW$T$214, DW_AT_type(*$C$DW$T$64)
	.dwattr $C$DW$T$214, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$214, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$T$214, DW_AT_decl_line(0x4cc)
	.dwattr $C$DW$T$214, DW_AT_decl_column(0x03)


$C$DW$T$65	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$65, DW_AT_byte_size(0x18)
$C$DW$480	.dwtag  DW_TAG_member
	.dwattr $C$DW$480, DW_AT_type(*$C$DW$T$45)
	.dwattr $C$DW$480, DW_AT_name("RESERVED0")
	.dwattr $C$DW$480, DW_AT_TI_symbol_name("RESERVED0")
	.dwattr $C$DW$480, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$480, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$480, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$480, DW_AT_decl_line(0x51f)
	.dwattr $C$DW$480, DW_AT_decl_column(0x12)

$C$DW$481	.dwtag  DW_TAG_member
	.dwattr $C$DW$481, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$481, DW_AT_name("FPCCR")
	.dwattr $C$DW$481, DW_AT_TI_symbol_name("FPCCR")
	.dwattr $C$DW$481, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$481, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$481, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$481, DW_AT_decl_line(0x520)
	.dwattr $C$DW$481, DW_AT_decl_column(0x12)

$C$DW$482	.dwtag  DW_TAG_member
	.dwattr $C$DW$482, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$482, DW_AT_name("FPCAR")
	.dwattr $C$DW$482, DW_AT_TI_symbol_name("FPCAR")
	.dwattr $C$DW$482, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$482, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$482, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$482, DW_AT_decl_line(0x521)
	.dwattr $C$DW$482, DW_AT_decl_column(0x12)

$C$DW$483	.dwtag  DW_TAG_member
	.dwattr $C$DW$483, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$483, DW_AT_name("FPDSCR")
	.dwattr $C$DW$483, DW_AT_TI_symbol_name("FPDSCR")
	.dwattr $C$DW$483, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$483, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$483, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$483, DW_AT_decl_line(0x522)
	.dwattr $C$DW$483, DW_AT_decl_column(0x12)

$C$DW$484	.dwtag  DW_TAG_member
	.dwattr $C$DW$484, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$484, DW_AT_name("MVFR0")
	.dwattr $C$DW$484, DW_AT_TI_symbol_name("MVFR0")
	.dwattr $C$DW$484, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$484, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$484, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$484, DW_AT_decl_line(0x523)
	.dwattr $C$DW$484, DW_AT_decl_column(0x12)

$C$DW$485	.dwtag  DW_TAG_member
	.dwattr $C$DW$485, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$485, DW_AT_name("MVFR1")
	.dwattr $C$DW$485, DW_AT_TI_symbol_name("MVFR1")
	.dwattr $C$DW$485, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$485, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$485, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$485, DW_AT_decl_line(0x524)
	.dwattr $C$DW$485, DW_AT_decl_column(0x12)

	.dwattr $C$DW$T$65, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$T$65, DW_AT_decl_line(0x51e)
	.dwattr $C$DW$T$65, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$65

$C$DW$T$215	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$215, DW_AT_name("FPU_Type")
	.dwattr $C$DW$T$215, DW_AT_type(*$C$DW$T$65)
	.dwattr $C$DW$T$215, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$215, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$T$215, DW_AT_decl_line(0x525)
	.dwattr $C$DW$T$215, DW_AT_decl_column(0x03)


$C$DW$T$66	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$66, DW_AT_byte_size(0x10)
$C$DW$486	.dwtag  DW_TAG_member
	.dwattr $C$DW$486, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$486, DW_AT_name("DHCSR")
	.dwattr $C$DW$486, DW_AT_TI_symbol_name("DHCSR")
	.dwattr $C$DW$486, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$486, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$486, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$486, DW_AT_decl_line(0x589)
	.dwattr $C$DW$486, DW_AT_decl_column(0x12)

$C$DW$487	.dwtag  DW_TAG_member
	.dwattr $C$DW$487, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$487, DW_AT_name("DCRSR")
	.dwattr $C$DW$487, DW_AT_TI_symbol_name("DCRSR")
	.dwattr $C$DW$487, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$487, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$487, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$487, DW_AT_decl_line(0x58a)
	.dwattr $C$DW$487, DW_AT_decl_column(0x12)

$C$DW$488	.dwtag  DW_TAG_member
	.dwattr $C$DW$488, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$488, DW_AT_name("DCRDR")
	.dwattr $C$DW$488, DW_AT_TI_symbol_name("DCRDR")
	.dwattr $C$DW$488, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$488, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$488, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$488, DW_AT_decl_line(0x58b)
	.dwattr $C$DW$488, DW_AT_decl_column(0x12)

$C$DW$489	.dwtag  DW_TAG_member
	.dwattr $C$DW$489, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$489, DW_AT_name("DEMCR")
	.dwattr $C$DW$489, DW_AT_TI_symbol_name("DEMCR")
	.dwattr $C$DW$489, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$489, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$489, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$489, DW_AT_decl_line(0x58c)
	.dwattr $C$DW$489, DW_AT_decl_column(0x12)

	.dwattr $C$DW$T$66, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$T$66, DW_AT_decl_line(0x588)
	.dwattr $C$DW$T$66, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$66

$C$DW$T$216	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$216, DW_AT_name("CoreDebug_Type")
	.dwattr $C$DW$T$216, DW_AT_type(*$C$DW$T$66)
	.dwattr $C$DW$T$216, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$216, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$T$216, DW_AT_decl_line(0x58d)
	.dwattr $C$DW$T$216, DW_AT_decl_column(0x03)


$C$DW$T$69	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$69, DW_AT_byte_size(0x158)
$C$DW$490	.dwtag  DW_TAG_member
	.dwattr $C$DW$490, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$490, DW_AT_name("CTL0")
	.dwattr $C$DW$490, DW_AT_TI_symbol_name("CTL0")
	.dwattr $C$DW$490, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$490, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$490, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_2_40_00_10\source\ti\devices\msp432p4xx\inc\msp432p401r.h")
	.dwattr $C$DW$490, DW_AT_decl_line(0x16d)
	.dwattr $C$DW$490, DW_AT_decl_column(0x11)

$C$DW$491	.dwtag  DW_TAG_member
	.dwattr $C$DW$491, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$491, DW_AT_name("CTL1")
	.dwattr $C$DW$491, DW_AT_TI_symbol_name("CTL1")
	.dwattr $C$DW$491, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$491, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$491, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_2_40_00_10\source\ti\devices\msp432p4xx\inc\msp432p401r.h")
	.dwattr $C$DW$491, DW_AT_decl_line(0x16e)
	.dwattr $C$DW$491, DW_AT_decl_column(0x11)

$C$DW$492	.dwtag  DW_TAG_member
	.dwattr $C$DW$492, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$492, DW_AT_name("LO0")
	.dwattr $C$DW$492, DW_AT_TI_symbol_name("LO0")
	.dwattr $C$DW$492, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$492, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$492, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_2_40_00_10\source\ti\devices\msp432p4xx\inc\msp432p401r.h")
	.dwattr $C$DW$492, DW_AT_decl_line(0x16f)
	.dwattr $C$DW$492, DW_AT_decl_column(0x11)

$C$DW$493	.dwtag  DW_TAG_member
	.dwattr $C$DW$493, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$493, DW_AT_name("HI0")
	.dwattr $C$DW$493, DW_AT_TI_symbol_name("HI0")
	.dwattr $C$DW$493, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$493, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$493, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_2_40_00_10\source\ti\devices\msp432p4xx\inc\msp432p401r.h")
	.dwattr $C$DW$493, DW_AT_decl_line(0x170)
	.dwattr $C$DW$493, DW_AT_decl_column(0x11)

$C$DW$494	.dwtag  DW_TAG_member
	.dwattr $C$DW$494, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$494, DW_AT_name("LO1")
	.dwattr $C$DW$494, DW_AT_TI_symbol_name("LO1")
	.dwattr $C$DW$494, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$494, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$494, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_2_40_00_10\source\ti\devices\msp432p4xx\inc\msp432p401r.h")
	.dwattr $C$DW$494, DW_AT_decl_line(0x171)
	.dwattr $C$DW$494, DW_AT_decl_column(0x11)

$C$DW$495	.dwtag  DW_TAG_member
	.dwattr $C$DW$495, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$495, DW_AT_name("HI1")
	.dwattr $C$DW$495, DW_AT_TI_symbol_name("HI1")
	.dwattr $C$DW$495, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$495, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$495, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_2_40_00_10\source\ti\devices\msp432p4xx\inc\msp432p401r.h")
	.dwattr $C$DW$495, DW_AT_decl_line(0x172)
	.dwattr $C$DW$495, DW_AT_decl_column(0x11)

$C$DW$496	.dwtag  DW_TAG_member
	.dwattr $C$DW$496, DW_AT_type(*$C$DW$T$67)
	.dwattr $C$DW$496, DW_AT_name("MCTL")
	.dwattr $C$DW$496, DW_AT_TI_symbol_name("MCTL")
	.dwattr $C$DW$496, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$496, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$496, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_2_40_00_10\source\ti\devices\msp432p4xx\inc\msp432p401r.h")
	.dwattr $C$DW$496, DW_AT_decl_line(0x173)
	.dwattr $C$DW$496, DW_AT_decl_column(0x11)

$C$DW$497	.dwtag  DW_TAG_member
	.dwattr $C$DW$497, DW_AT_type(*$C$DW$T$67)
	.dwattr $C$DW$497, DW_AT_name("MEM")
	.dwattr $C$DW$497, DW_AT_TI_symbol_name("MEM")
	.dwattr $C$DW$497, DW_AT_data_member_location[DW_OP_plus_uconst 0x98]
	.dwattr $C$DW$497, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$497, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_2_40_00_10\source\ti\devices\msp432p4xx\inc\msp432p401r.h")
	.dwattr $C$DW$497, DW_AT_decl_line(0x174)
	.dwattr $C$DW$497, DW_AT_decl_column(0x11)

$C$DW$498	.dwtag  DW_TAG_member
	.dwattr $C$DW$498, DW_AT_type(*$C$DW$T$68)
	.dwattr $C$DW$498, DW_AT_name("RESERVED0")
	.dwattr $C$DW$498, DW_AT_TI_symbol_name("RESERVED0")
	.dwattr $C$DW$498, DW_AT_data_member_location[DW_OP_plus_uconst 0x118]
	.dwattr $C$DW$498, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$498, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_2_40_00_10\source\ti\devices\msp432p4xx\inc\msp432p401r.h")
	.dwattr $C$DW$498, DW_AT_decl_line(0x175)
	.dwattr $C$DW$498, DW_AT_decl_column(0x11)

$C$DW$499	.dwtag  DW_TAG_member
