# read the verilog
read_verilog simon_clk.v
# map to cells of msp432_cells.lib
synth -top simon
flatten
dfflibmap -liberty msp432_cells.lib
abc -liberty msp432_cells.lib
clean
# create bitslice code
write_bitslice simon_clk_bit.v
# create c code
write_ccode simon_clk_c.c
