;******************************************************************************
;* TI ARM C/C++ Codegen                                        PC v18.1.4.LTS *
;* Date/Time created: Tue Feb 25 16:19:05 2020                                *
;******************************************************************************
	.compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embedded_constants=on --endian=little --float_support=FPv4SPD16 --hll_source=on --object_format=elf --silicon_version=7M4 --symdebug:dwarf --symdebug:dwarf_version=3 --unaligned_access=on 
	.thumb

$C$DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr $C$DW$CU, DW_AT_name("../main.c")
	.dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v18.1.4.LTS Copyright (c) 1996-2018 Texas Instruments Incorporated")
	.dwattr $C$DW$CU, DW_AT_TI_version(0x01)
	.dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\pante\Desktop\psp_encrypt\aes\performance-evaluation\Debug")

$C$DW$1	.dwtag  DW_TAG_subprogram
	.dwattr $C$DW$1, DW_AT_name("Timer32_getValue")
	.dwattr $C$DW$1, DW_AT_TI_symbol_name("Timer32_getValue")
	.dwattr $C$DW$1, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1, DW_AT_declaration
	.dwattr $C$DW$1, DW_AT_external
	.dwattr $C$DW$1, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_2_40_00_10/source/ti/devices/msp432p4xx/driverlib/timer32.h")
	.dwattr $C$DW$1, DW_AT_decl_line(0xb4)
	.dwattr $C$DW$1, DW_AT_decl_column(0x11)
$C$DW$2	.dwtag  DW_TAG_formal_parameter

;* --------------------------------------------------------------------------*
	.dwpsn	file "../main.c",line 183,column 5,is_stmt,isa 1
        MOVW      A1, #26215            ; [DPU_V7M3_PIPE] |183| 
        MOVT      A1, #26214            ; [DPU_V7M3_PIPE] |183| 
        SMULL     A2, A1, A1, V2        ; [DPU_V7M3_PIPE] |183| 
        ASRS      A2, A1, #2            ; [DPU_V7M3_PIPE] |183| 
	.dwpsn	file "../main.c",line 184,column 5,is_stmt,isa 1
        ADR       A1, $C$SL2            ; [DPU_V7M3_PIPE] |184| 
	.dwpsn	file "../main.c",line 183,column 5,is_stmt,isa 1
        SUB       A2, A2, V2, ASR #31   ; [DPU_V7M3_PIPE] |183| 
	.dwpsn	file "../main.c",line 184,column 5,is_stmt,isa 1
$C$DW$53	.dwtag  DW_TAG_TI_branch
	.dwattr $C$DW$53, DW_AT_low_pc(0x00)
	.dwattr $C$DW$53, DW_AT_name("printf")
	.dwattr $C$DW$53, DW_AT_TI_call

        BL        printf                ; [DPU_V7M3_PIPE] |184| 
        ; CALL OCCURS {printf }          ; [] |184| 
        ADD       V1, SP, #576          ; [DPU_V7M3_PIPE] 
	.dwpsn	file "../main.c",line 187,column 17,is_stmt,isa 1
        MOVS      V4, #64               ; [DPU_V7M3_PIPE] |187| 
;* --------------------------------------------------------------------------*
;*   BEGIN LOOP ||$C$L31||
;*
;*   Loop source line                : 187
;*   Loop closing brace source line  : 189
;*   Known Minimum Trip Count        : 64
;*   Known Maximum Trip Count        : 64
;*   Known Max Trip Count Factor     : 64
;* --------------------------------------------------------------------------*
	.align	8
||$C$L31||:    
	.dwpsn	file "../main.c",line 188,column 9,is_stmt,isa 1
        LDR       A1, [V1], #-4         ; [DPU_V7M3_PIPE] |188| 
        LSRS      A2, A1, #31           ; [DPU_V7M3_PIPE] |188| 
        ADR       A1, $C$SL3            ; [DPU_V7M3_PIPE] |188| 
$C$DW$54	.dwtag  DW_TAG_TI_branch
	.dwattr $C$DW$54, DW_AT_low_pc(0x00)
	.dwattr $C$DW$54, DW_AT_name("printf")
	.dwattr $C$DW$54, DW_AT_TI_call

        BL        printf                ; [DPU_V7M3_PIPE] |188| 
        ; CALL OCCURS {printf }          ; [] |188| 
	.dwpsn	file "../main.c",line 187,column 17,is_stmt,isa 1
        SUBS      V4, V4, #1            ; [DPU_V7M3_PIPE] |187| 
        BNE       ||$C$L31||            ; [DPU_V7M3_PIPE] |187| 
        ; BRANCHCC OCCURS {||$C$L31||}   ; [] |187| 
;* --------------------------------------------------------------------------*
	.dwpsn	file "../main.c",line 190,column 5,is_stmt,isa 1
        ADR       A1, $C$SL4            ; [DPU_V7M3_PIPE] |190| 
$C$DW$55	.dwtag  DW_TAG_TI_branch
	.dwattr $C$DW$55, DW_AT_low_pc(0x00)
	.dwattr $C$DW$55, DW_AT_name("printf")
	.dwattr $C$DW$55, DW_AT_TI_call

        BL        printf                ; [DPU_V7M3_PIPE] |190| 
        ; CALL OCCURS {printf }          ; [] |190| 
        ADD       SP, SP, #508          ; [DPU_V7M3_PIPE] 
	.dwcfi	cfa_offset, 404
        MOV       A1, V8                ; [DPU_V7M3_PIPE] |190| 
        ADD       SP, SP, #368          ; [DPU_V7M3_PIPE] 
	.dwcfi	cfa_offset, 36
$C$DW$56	.dwtag  DW_TAG_TI_branch
	.dwattr $C$DW$56, DW_AT_low_pc(0x00)
	.dwattr $C$DW$56, DW_AT_TI_return

        POP       {V1, V2, V3, V4, V5, V6, V7, V8, PC} ; [DPU_V7M3_PIPE] 
	.dwcfi	cfa_offset, 0
	.dwcfi	restore_reg, 11
	.dwcfi	restore_reg, 10
	.dwcfi	restore_reg, 9
	.dwcfi	restore_reg, 8
	.dwcfi	restore_reg, 7
	.dwcfi	restore_reg, 6
	.dwcfi	restore_reg, 5
	.dwcfi	restore_reg, 4
        ; BRANCH OCCURS                  ; [] 
	.dwattr $C$DW$34, DW_AT_TI_end_file("../main.c")
	.dwattr $C$DW$34, DW_AT_TI_end_line(0xff)
	.dwattr $C$DW$34, DW_AT_TI_end_column(0x01)
	.dwendentry
	.dwendtag $C$DW$34

;******************************************************************************
;* STRINGS                                                                    *
;******************************************************************************
	.sect	".text"
	.align	4
||$C$SL1||:	.string	"cycles = %4d ",10,0
	.align	4
||$C$SL2||:	.string	"mean cycle = %d",10,0
	.align	4
||$C$SL3||:	.string	"%1x",0
	.align	4
||$C$SL4||:	.string	10,0
;*****************************************************************************
;* UNDEFINED EXTERNAL REFERENCES                                             *
;*****************************************************************************
	.global	Timer32_getValue
	.global	Timer32_initModule
	.global	Timer32_startTimer
	.global	printf

;******************************************************************************
;* BUILD ATTRIBUTES                                                           *
;******************************************************************************
	.battr "TI", Tag_File, 1, Tag_LPM_INFO(1)
	.battr "TI", Tag_File, 1, Tag_PORTS_INIT_INFO("012345678901ABCDEFGHIJ01111111111000000000000000000000000000000000")
	.battr "aeabi", Tag_File, 1, Tag_ABI_PCS_wchar_t(2)
	.battr "aeabi", Tag_File, 1, Tag_ABI_FP_rounding(0)
	.battr "aeabi", Tag_File, 1, Tag_ABI_FP_denormal(0)
	.battr "aeabi", Tag_File, 1, Tag_ABI_FP_exceptions(0)
	.battr "aeabi", Tag_File, 1, Tag_ABI_FP_number_model(1)
	.battr "aeabi", Tag_File, 1, Tag_ABI_enum_size(1)
	.battr "aeabi", Tag_File, 1, Tag_ABI_optimization_goals(0)
	.battr "aeabi", Tag_File, 1, Tag_ABI_FP_optimization_goals(0)
	.battr "TI", Tag_File, 1, Tag_Bitfield_layout(0)
	.battr "aeabi", Tag_File, 1, Tag_ABI_VFP_args(3)
	.battr "TI", Tag_File, 1, Tag_FP_interface(1)

;******************************************************************************
;* TYPE INFORMATION                                                           *
;******************************************************************************

$C$DW$T$21	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$21, DW_AT_byte_size(0x10)
$C$DW$57	.dwtag  DW_TAG_member
	.dwattr $C$DW$57, DW_AT_type(*$C$DW$T$14)
	.dwattr $C$DW$57, DW_AT_name("__max_align1")
	.dwattr $C$DW$57, DW_AT_TI_symbol_name("__max_align1")
	.dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$57, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.4.LTS/include/sys/_types.h")
	.dwattr $C$DW$57, DW_AT_decl_line(0x70)
	.dwattr $C$DW$57, DW_AT_decl_column(0x0c)

$C$DW$58	.dwtag  DW_TAG_member
	.dwattr $C$DW$58, DW_AT_type(*$C$DW$T$18)
	.dwattr $C$DW$58, DW_AT_name("__max_align2")
	.dwattr $C$DW$58, DW_AT_TI_symbol_name("__max_align2")
	.dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$58, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.4.LTS/include/sys/_types.h")
	.dwattr $C$DW$58, DW_AT_decl_line(0x71)
	.dwattr $C$DW$58, DW_AT_decl_column(0x0e)

	.dwattr $C$DW$T$21, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.4.LTS/include/sys/_types.h")
	.dwattr $C$DW$T$21, DW_AT_decl_line(0x6f)
	.dwattr $C$DW$T$21, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$21

$C$DW$T$209	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$209, DW_AT_name("__max_align_t")
	.dwattr $C$DW$T$209, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$T$209, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$209, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.4.LTS/include/sys/_types.h")
	.dwattr $C$DW$T$209, DW_AT_decl_line(0x72)
	.dwattr $C$DW$T$209, DW_AT_decl_column(0x03)


$C$DW$T$24	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$24, DW_AT_byte_size(0x04)
$C$DW$59	.dwtag  DW_TAG_member
	.dwattr $C$DW$59, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$59, DW_AT_name("_reserved0")
	.dwattr $C$DW$59, DW_AT_TI_symbol_name("_reserved0")
	.dwattr $C$DW$59, DW_AT_bit_offset(0x10)
	.dwattr $C$DW$59, DW_AT_bit_size(0x10)
	.dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$59, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$59, DW_AT_decl_line(0x105)
	.dwattr $C$DW$59, DW_AT_decl_column(0x0e)

$C$DW$60	.dwtag  DW_TAG_member
	.dwattr $C$DW$60, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$60, DW_AT_name("GE")
	.dwattr $C$DW$60, DW_AT_TI_symbol_name("GE")
	.dwattr $C$DW$60, DW_AT_bit_offset(0x0c)
	.dwattr $C$DW$60, DW_AT_bit_size(0x04)
	.dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$60, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$60, DW_AT_decl_line(0x106)
	.dwattr $C$DW$60, DW_AT_decl_column(0x0e)

$C$DW$61	.dwtag  DW_TAG_member
	.dwattr $C$DW$61, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$61, DW_AT_name("_reserved1")
	.dwattr $C$DW$61, DW_AT_TI_symbol_name("_reserved1")
	.dwattr $C$DW$61, DW_AT_bit_offset(0x05)
	.dwattr $C$DW$61, DW_AT_bit_size(0x07)
	.dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$61, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$61, DW_AT_decl_line(0x107)
	.dwattr $C$DW$61, DW_AT_decl_column(0x0e)

$C$DW$62	.dwtag  DW_TAG_member
	.dwattr $C$DW$62, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$62, DW_AT_name("Q")
	.dwattr $C$DW$62, DW_AT_TI_symbol_name("Q")
	.dwattr $C$DW$62, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$62, DW_AT_bit_size(0x01)
	.dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$62, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$62, DW_AT_decl_line(0x108)
	.dwattr $C$DW$62, DW_AT_decl_column(0x0e)

$C$DW$63	.dwtag  DW_TAG_member
	.dwattr $C$DW$63, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$63, DW_AT_name("V")
	.dwattr $C$DW$63, DW_AT_TI_symbol_name("V")
	.dwattr $C$DW$63, DW_AT_bit_offset(0x03)
	.dwattr $C$DW$63, DW_AT_bit_size(0x01)
	.dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$63, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$63, DW_AT_decl_line(0x109)
	.dwattr $C$DW$63, DW_AT_decl_column(0x0e)

$C$DW$64	.dwtag  DW_TAG_member
	.dwattr $C$DW$64, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$64, DW_AT_name("C")
	.dwattr $C$DW$64, DW_AT_TI_symbol_name("C")
	.dwattr $C$DW$64, DW_AT_bit_offset(0x02)
	.dwattr $C$DW$64, DW_AT_bit_size(0x01)
	.dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$64, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$64, DW_AT_decl_line(0x10a)
	.dwattr $C$DW$64, DW_AT_decl_column(0x0e)

$C$DW$65	.dwtag  DW_TAG_member
	.dwattr $C$DW$65, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$65, DW_AT_name("Z")
	.dwattr $C$DW$65, DW_AT_TI_symbol_name("Z")
	.dwattr $C$DW$65, DW_AT_bit_offset(0x01)
	.dwattr $C$DW$65, DW_AT_bit_size(0x01)
	.dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$65, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$65, DW_AT_decl_line(0x10b)
	.dwattr $C$DW$65, DW_AT_decl_column(0x0e)

$C$DW$66	.dwtag  DW_TAG_member
	.dwattr $C$DW$66, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$66, DW_AT_name("N")
	.dwattr $C$DW$66, DW_AT_TI_symbol_name("N")
	.dwattr $C$DW$66, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$66, DW_AT_bit_size(0x01)
	.dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$66, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$66, DW_AT_decl_line(0x10c)
	.dwattr $C$DW$66, DW_AT_decl_column(0x0e)

	.dwattr $C$DW$T$24, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$T$24, DW_AT_decl_line(0x104)
	.dwattr $C$DW$T$24, DW_AT_decl_column(0x03)
	.dwendtag $C$DW$T$24


$C$DW$T$25	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$25, DW_AT_byte_size(0x04)
$C$DW$67	.dwtag  DW_TAG_member
	.dwattr $C$DW$67, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$67, DW_AT_name("ISR")
	.dwattr $C$DW$67, DW_AT_TI_symbol_name("ISR")
	.dwattr $C$DW$67, DW_AT_bit_offset(0x17)
	.dwattr $C$DW$67, DW_AT_bit_size(0x09)
	.dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$67, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$67, DW_AT_decl_line(0x12c)
	.dwattr $C$DW$67, DW_AT_decl_column(0x0e)

$C$DW$68	.dwtag  DW_TAG_member
	.dwattr $C$DW$68, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$68, DW_AT_name("_reserved0")
	.dwattr $C$DW$68, DW_AT_TI_symbol_name("_reserved0")
	.dwattr $C$DW$68, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$68, DW_AT_bit_size(0x17)
	.dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$68, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$68, DW_AT_decl_line(0x12d)
	.dwattr $C$DW$68, DW_AT_decl_column(0x0e)

	.dwattr $C$DW$T$25, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$T$25, DW_AT_decl_line(0x12b)
	.dwattr $C$DW$T$25, DW_AT_decl_column(0x03)
	.dwendtag $C$DW$T$25


$C$DW$T$26	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$26, DW_AT_byte_size(0x04)
$C$DW$69	.dwtag  DW_TAG_member
	.dwattr $C$DW$69, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$69, DW_AT_name("ISR")
	.dwattr $C$DW$69, DW_AT_TI_symbol_name("ISR")
	.dwattr $C$DW$69, DW_AT_bit_offset(0x17)
	.dwattr $C$DW$69, DW_AT_bit_size(0x09)
	.dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$69, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$69, DW_AT_decl_line(0x13e)
	.dwattr $C$DW$69, DW_AT_decl_column(0x0e)

$C$DW$70	.dwtag  DW_TAG_member
	.dwattr $C$DW$70, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$70, DW_AT_name("_reserved0")
	.dwattr $C$DW$70, DW_AT_TI_symbol_name("_reserved0")
	.dwattr $C$DW$70, DW_AT_bit_offset(0x16)
	.dwattr $C$DW$70, DW_AT_bit_size(0x01)
	.dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$70, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$70, DW_AT_decl_line(0x13f)
	.dwattr $C$DW$70, DW_AT_decl_column(0x0e)

$C$DW$71	.dwtag  DW_TAG_member
	.dwattr $C$DW$71, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$71, DW_AT_name("ICI_IT_1")
	.dwattr $C$DW$71, DW_AT_TI_symbol_name("ICI_IT_1")
	.dwattr $C$DW$71, DW_AT_bit_offset(0x10)
	.dwattr $C$DW$71, DW_AT_bit_size(0x06)
	.dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$71, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$71, DW_AT_decl_line(0x140)
	.dwattr $C$DW$71, DW_AT_decl_column(0x0e)

$C$DW$72	.dwtag  DW_TAG_member
	.dwattr $C$DW$72, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$72, DW_AT_name("GE")
	.dwattr $C$DW$72, DW_AT_TI_symbol_name("GE")
	.dwattr $C$DW$72, DW_AT_bit_offset(0x0c)
	.dwattr $C$DW$72, DW_AT_bit_size(0x04)
	.dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$72, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$72, DW_AT_decl_line(0x141)
	.dwattr $C$DW$72, DW_AT_decl_column(0x0e)

$C$DW$73	.dwtag  DW_TAG_member
	.dwattr $C$DW$73, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$73, DW_AT_name("_reserved1")
	.dwattr $C$DW$73, DW_AT_TI_symbol_name("_reserved1")
	.dwattr $C$DW$73, DW_AT_bit_offset(0x08)
	.dwattr $C$DW$73, DW_AT_bit_size(0x04)
	.dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$73, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$73, DW_AT_decl_line(0x142)
	.dwattr $C$DW$73, DW_AT_decl_column(0x0e)

$C$DW$74	.dwtag  DW_TAG_member
	.dwattr $C$DW$74, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$74, DW_AT_name("T")
	.dwattr $C$DW$74, DW_AT_TI_symbol_name("T")
	.dwattr $C$DW$74, DW_AT_bit_offset(0x07)
	.dwattr $C$DW$74, DW_AT_bit_size(0x01)
	.dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$74, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$74, DW_AT_decl_line(0x143)
	.dwattr $C$DW$74, DW_AT_decl_column(0x0e)

$C$DW$75	.dwtag  DW_TAG_member
	.dwattr $C$DW$75, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$75, DW_AT_name("ICI_IT_2")
	.dwattr $C$DW$75, DW_AT_TI_symbol_name("ICI_IT_2")
	.dwattr $C$DW$75, DW_AT_bit_offset(0x05)
	.dwattr $C$DW$75, DW_AT_bit_size(0x02)
	.dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$75, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$75, DW_AT_decl_line(0x144)
	.dwattr $C$DW$75, DW_AT_decl_column(0x0e)

$C$DW$76	.dwtag  DW_TAG_member
	.dwattr $C$DW$76, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$76, DW_AT_name("Q")
	.dwattr $C$DW$76, DW_AT_TI_symbol_name("Q")
	.dwattr $C$DW$76, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$76, DW_AT_bit_size(0x01)
	.dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$76, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$76, DW_AT_decl_line(0x145)
	.dwattr $C$DW$76, DW_AT_decl_column(0x0e)

$C$DW$77	.dwtag  DW_TAG_member
	.dwattr $C$DW$77, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$77, DW_AT_name("V")
	.dwattr $C$DW$77, DW_AT_TI_symbol_name("V")
	.dwattr $C$DW$77, DW_AT_bit_offset(0x03)
	.dwattr $C$DW$77, DW_AT_bit_size(0x01)
	.dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$77, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$77, DW_AT_decl_line(0x146)
	.dwattr $C$DW$77, DW_AT_decl_column(0x0e)

$C$DW$78	.dwtag  DW_TAG_member
	.dwattr $C$DW$78, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$78, DW_AT_name("C")
	.dwattr $C$DW$78, DW_AT_TI_symbol_name("C")
	.dwattr $C$DW$78, DW_AT_bit_offset(0x02)
	.dwattr $C$DW$78, DW_AT_bit_size(0x01)
	.dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$78, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$78, DW_AT_decl_line(0x147)
	.dwattr $C$DW$78, DW_AT_decl_column(0x0e)

$C$DW$79	.dwtag  DW_TAG_member
	.dwattr $C$DW$79, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$79, DW_AT_name("Z")
	.dwattr $C$DW$79, DW_AT_TI_symbol_name("Z")
	.dwattr $C$DW$79, DW_AT_bit_offset(0x01)
	.dwattr $C$DW$79, DW_AT_bit_size(0x01)
	.dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$79, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$79, DW_AT_decl_line(0x148)
	.dwattr $C$DW$79, DW_AT_decl_column(0x0e)

$C$DW$80	.dwtag  DW_TAG_member
	.dwattr $C$DW$80, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$80, DW_AT_name("N")
	.dwattr $C$DW$80, DW_AT_TI_symbol_name("N")
	.dwattr $C$DW$80, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$80, DW_AT_bit_size(0x01)
	.dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$80, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$80, DW_AT_decl_line(0x149)
	.dwattr $C$DW$80, DW_AT_decl_column(0x0e)

	.dwattr $C$DW$T$26, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$T$26, DW_AT_decl_line(0x13d)
	.dwattr $C$DW$T$26, DW_AT_decl_column(0x03)
	.dwendtag $C$DW$T$26


$C$DW$T$27	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$27, DW_AT_byte_size(0x04)
$C$DW$81	.dwtag  DW_TAG_member
	.dwattr $C$DW$81, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$81, DW_AT_name("nPRIV")
	.dwattr $C$DW$81, DW_AT_TI_symbol_name("nPRIV")
	.dwattr $C$DW$81, DW_AT_bit_offset(0x1f)
	.dwattr $C$DW$81, DW_AT_bit_size(0x01)
	.dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$81, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$81, DW_AT_decl_line(0x175)
	.dwattr $C$DW$81, DW_AT_decl_column(0x0e)

$C$DW$82	.dwtag  DW_TAG_member
	.dwattr $C$DW$82, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$82, DW_AT_name("SPSEL")
	.dwattr $C$DW$82, DW_AT_TI_symbol_name("SPSEL")
	.dwattr $C$DW$82, DW_AT_bit_offset(0x1e)
	.dwattr $C$DW$82, DW_AT_bit_size(0x01)
	.dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$82, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$82, DW_AT_decl_line(0x176)
	.dwattr $C$DW$82, DW_AT_decl_column(0x0e)

$C$DW$83	.dwtag  DW_TAG_member
	.dwattr $C$DW$83, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$83, DW_AT_name("FPCA")
	.dwattr $C$DW$83, DW_AT_TI_symbol_name("FPCA")
	.dwattr $C$DW$83, DW_AT_bit_offset(0x1d)
	.dwattr $C$DW$83, DW_AT_bit_size(0x01)
	.dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$83, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$83, DW_AT_decl_line(0x177)
	.dwattr $C$DW$83, DW_AT_decl_column(0x0e)

$C$DW$84	.dwtag  DW_TAG_member
	.dwattr $C$DW$84, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$84, DW_AT_name("_reserved0")
	.dwattr $C$DW$84, DW_AT_TI_symbol_name("_reserved0")
	.dwattr $C$DW$84, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$84, DW_AT_bit_size(0x1d)
	.dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$84, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$84, DW_AT_decl_line(0x178)
	.dwattr $C$DW$84, DW_AT_decl_column(0x0e)

	.dwattr $C$DW$T$27, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$T$27, DW_AT_decl_line(0x174)
	.dwattr $C$DW$T$27, DW_AT_decl_column(0x03)
	.dwendtag $C$DW$T$27


$C$DW$T$37	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$37, DW_AT_byte_size(0xe04)
$C$DW$85	.dwtag  DW_TAG_member
	.dwattr $C$DW$85, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$85, DW_AT_name("ISER")
	.dwattr $C$DW$85, DW_AT_TI_symbol_name("ISER")
	.dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$85, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$85, DW_AT_decl_line(0x196)
	.dwattr $C$DW$85, DW_AT_decl_column(0x12)

$C$DW$86	.dwtag  DW_TAG_member
	.dwattr $C$DW$86, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$86, DW_AT_name("RESERVED0")
	.dwattr $C$DW$86, DW_AT_TI_symbol_name("RESERVED0")
	.dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$86, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$86, DW_AT_decl_line(0x197)
	.dwattr $C$DW$86, DW_AT_decl_column(0x12)

$C$DW$87	.dwtag  DW_TAG_member
	.dwattr $C$DW$87, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$87, DW_AT_name("ICER")
	.dwattr $C$DW$87, DW_AT_TI_symbol_name("ICER")
	.dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
	.dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$87, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$87, DW_AT_decl_line(0x198)
	.dwattr $C$DW$87, DW_AT_decl_column(0x12)

$C$DW$88	.dwtag  DW_TAG_member
	.dwattr $C$DW$88, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$88, DW_AT_name("RSERVED1")
	.dwattr $C$DW$88, DW_AT_TI_symbol_name("RSERVED1")
	.dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
	.dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$88, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$88, DW_AT_decl_line(0x199)
	.dwattr $C$DW$88, DW_AT_decl_column(0x12)

$C$DW$89	.dwtag  DW_TAG_member
	.dwattr $C$DW$89, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$89, DW_AT_name("ISPR")
	.dwattr $C$DW$89, DW_AT_TI_symbol_name("ISPR")
	.dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
	.dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$89, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$89, DW_AT_decl_line(0x19a)
	.dwattr $C$DW$89, DW_AT_decl_column(0x12)

$C$DW$90	.dwtag  DW_TAG_member
	.dwattr $C$DW$90, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$90, DW_AT_name("RESERVED2")
	.dwattr $C$DW$90, DW_AT_TI_symbol_name("RESERVED2")
	.dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x120]
	.dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$90, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$90, DW_AT_decl_line(0x19b)
	.dwattr $C$DW$90, DW_AT_decl_column(0x12)

$C$DW$91	.dwtag  DW_TAG_member
	.dwattr $C$DW$91, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$91, DW_AT_name("ICPR")
	.dwattr $C$DW$91, DW_AT_TI_symbol_name("ICPR")
	.dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x180]
	.dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$91, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$91, DW_AT_decl_line(0x19c)
	.dwattr $C$DW$91, DW_AT_decl_column(0x12)

$C$DW$92	.dwtag  DW_TAG_member
	.dwattr $C$DW$92, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$92, DW_AT_name("RESERVED3")
	.dwattr $C$DW$92, DW_AT_TI_symbol_name("RESERVED3")
	.dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a0]
	.dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$92, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$92, DW_AT_decl_line(0x19d)
	.dwattr $C$DW$92, DW_AT_decl_column(0x12)

$C$DW$93	.dwtag  DW_TAG_member
	.dwattr $C$DW$93, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$93, DW_AT_name("IABR")
	.dwattr $C$DW$93, DW_AT_TI_symbol_name("IABR")
	.dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x200]
	.dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$93, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$93, DW_AT_decl_line(0x19e)
	.dwattr $C$DW$93, DW_AT_decl_column(0x12)

$C$DW$94	.dwtag  DW_TAG_member
	.dwattr $C$DW$94, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$94, DW_AT_name("RESERVED4")
	.dwattr $C$DW$94, DW_AT_TI_symbol_name("RESERVED4")
	.dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x220]
	.dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$94, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$94, DW_AT_decl_line(0x19f)
	.dwattr $C$DW$94, DW_AT_decl_column(0x12)

$C$DW$95	.dwtag  DW_TAG_member
	.dwattr $C$DW$95, DW_AT_type(*$C$DW$T$35)
	.dwattr $C$DW$95, DW_AT_name("IP")
	.dwattr $C$DW$95, DW_AT_TI_symbol_name("IP")
	.dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x300]
	.dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$95, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$95, DW_AT_decl_line(0x1a0)
	.dwattr $C$DW$95, DW_AT_decl_column(0x12)

$C$DW$96	.dwtag  DW_TAG_member
	.dwattr $C$DW$96, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$96, DW_AT_name("RESERVED5")
	.dwattr $C$DW$96, DW_AT_TI_symbol_name("RESERVED5")
	.dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x3f0]
	.dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$96, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$96, DW_AT_decl_line(0x1a1)
	.dwattr $C$DW$96, DW_AT_decl_column(0x12)

$C$DW$97	.dwtag  DW_TAG_member
	.dwattr $C$DW$97, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$97, DW_AT_name("STIR")
	.dwattr $C$DW$97, DW_AT_TI_symbol_name("STIR")
	.dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0xe00]
	.dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$97, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$97, DW_AT_decl_line(0x1a2)
	.dwattr $C$DW$97, DW_AT_decl_column(0x12)

	.dwattr $C$DW$T$37, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$T$37, DW_AT_decl_line(0x195)
	.dwattr $C$DW$T$37, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$37

$C$DW$T$210	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$210, DW_AT_name("NVIC_Type")
	.dwattr $C$DW$T$210, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$T$210, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$210, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$T$210, DW_AT_decl_line(0x1a3)
	.dwattr $C$DW$T$210, DW_AT_decl_column(0x04)


$C$DW$T$44	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$44, DW_AT_byte_size(0x8c)
$C$DW$98	.dwtag  DW_TAG_member
	.dwattr $C$DW$98, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$98, DW_AT_name("CPUID")
	.dwattr $C$DW$98, DW_AT_TI_symbol_name("CPUID")
	.dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$98, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$98, DW_AT_decl_line(0x1b8)
	.dwattr $C$DW$98, DW_AT_decl_column(0x12)

$C$DW$99	.dwtag  DW_TAG_member
	.dwattr $C$DW$99, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$99, DW_AT_name("ICSR")
	.dwattr $C$DW$99, DW_AT_TI_symbol_name("ICSR")
	.dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$99, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$99, DW_AT_decl_line(0x1b9)
	.dwattr $C$DW$99, DW_AT_decl_column(0x12)

$C$DW$100	.dwtag  DW_TAG_member
	.dwattr $C$DW$100, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$100, DW_AT_name("VTOR")
	.dwattr $C$DW$100, DW_AT_TI_symbol_name("VTOR")
	.dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$100, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$100, DW_AT_decl_line(0x1ba)
	.dwattr $C$DW$100, DW_AT_decl_column(0x12)

$C$DW$101	.dwtag  DW_TAG_member
	.dwattr $C$DW$101, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$101, DW_AT_name("AIRCR")
	.dwattr $C$DW$101, DW_AT_TI_symbol_name("AIRCR")
	.dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$101, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$101, DW_AT_decl_line(0x1bb)
	.dwattr $C$DW$101, DW_AT_decl_column(0x12)

$C$DW$102	.dwtag  DW_TAG_member
	.dwattr $C$DW$102, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$102, DW_AT_name("SCR")
	.dwattr $C$DW$102, DW_AT_TI_symbol_name("SCR")
	.dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$102, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$102, DW_AT_decl_line(0x1bc)
	.dwattr $C$DW$102, DW_AT_decl_column(0x12)

$C$DW$103	.dwtag  DW_TAG_member
	.dwattr $C$DW$103, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$103, DW_AT_name("CCR")
	.dwattr $C$DW$103, DW_AT_TI_symbol_name("CCR")
	.dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$103, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$103, DW_AT_decl_line(0x1bd)
	.dwattr $C$DW$103, DW_AT_decl_column(0x12)

$C$DW$104	.dwtag  DW_TAG_member
	.dwattr $C$DW$104, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$104, DW_AT_name("SHP")
	.dwattr $C$DW$104, DW_AT_TI_symbol_name("SHP")
	.dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$104, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$104, DW_AT_decl_line(0x1be)
	.dwattr $C$DW$104, DW_AT_decl_column(0x12)

$C$DW$105	.dwtag  DW_TAG_member
	.dwattr $C$DW$105, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$105, DW_AT_name("SHCSR")
	.dwattr $C$DW$105, DW_AT_TI_symbol_name("SHCSR")
	.dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$105, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$105, DW_AT_decl_line(0x1bf)
	.dwattr $C$DW$105, DW_AT_decl_column(0x12)

$C$DW$106	.dwtag  DW_TAG_member
	.dwattr $C$DW$106, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$106, DW_AT_name("CFSR")
	.dwattr $C$DW$106, DW_AT_TI_symbol_name("CFSR")
	.dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$106, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$106, DW_AT_decl_line(0x1c0)
	.dwattr $C$DW$106, DW_AT_decl_column(0x12)

$C$DW$107	.dwtag  DW_TAG_member
	.dwattr $C$DW$107, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$107, DW_AT_name("HFSR")
	.dwattr $C$DW$107, DW_AT_TI_symbol_name("HFSR")
	.dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$107, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$107, DW_AT_decl_line(0x1c1)
	.dwattr $C$DW$107, DW_AT_decl_column(0x12)

$C$DW$108	.dwtag  DW_TAG_member
	.dwattr $C$DW$108, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$108, DW_AT_name("DFSR")
	.dwattr $C$DW$108, DW_AT_TI_symbol_name("DFSR")
	.dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$108, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$108, DW_AT_decl_line(0x1c2)
	.dwattr $C$DW$108, DW_AT_decl_column(0x12)

$C$DW$109	.dwtag  DW_TAG_member
	.dwattr $C$DW$109, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$109, DW_AT_name("MMFAR")
	.dwattr $C$DW$109, DW_AT_TI_symbol_name("MMFAR")
	.dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$109, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$109, DW_AT_decl_line(0x1c3)
	.dwattr $C$DW$109, DW_AT_decl_column(0x12)

$C$DW$110	.dwtag  DW_TAG_member
	.dwattr $C$DW$110, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$110, DW_AT_name("BFAR")
	.dwattr $C$DW$110, DW_AT_TI_symbol_name("BFAR")
	.dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$110, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$110, DW_AT_decl_line(0x1c4)
	.dwattr $C$DW$110, DW_AT_decl_column(0x12)

$C$DW$111	.dwtag  DW_TAG_member
	.dwattr $C$DW$111, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$111, DW_AT_name("AFSR")
	.dwattr $C$DW$111, DW_AT_TI_symbol_name("AFSR")
	.dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
	.dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$111, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$111, DW_AT_decl_line(0x1c5)
	.dwattr $C$DW$111, DW_AT_decl_column(0x12)

$C$DW$112	.dwtag  DW_TAG_member
	.dwattr $C$DW$112, DW_AT_type(*$C$DW$T$40)
	.dwattr $C$DW$112, DW_AT_name("PFR")
	.dwattr $C$DW$112, DW_AT_TI_symbol_name("PFR")
	.dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
	.dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$112, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$112, DW_AT_decl_line(0x1c6)
	.dwattr $C$DW$112, DW_AT_decl_column(0x12)

$C$DW$113	.dwtag  DW_TAG_member
	.dwattr $C$DW$113, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$113, DW_AT_name("DFR")
	.dwattr $C$DW$113, DW_AT_TI_symbol_name("DFR")
	.dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
	.dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$113, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$113, DW_AT_decl_line(0x1c7)
	.dwattr $C$DW$113, DW_AT_decl_column(0x12)

$C$DW$114	.dwtag  DW_TAG_member
	.dwattr $C$DW$114, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$114, DW_AT_name("ADR")
	.dwattr $C$DW$114, DW_AT_TI_symbol_name("ADR")
	.dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
	.dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$114, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$114, DW_AT_decl_line(0x1c8)
	.dwattr $C$DW$114, DW_AT_decl_column(0x12)

$C$DW$115	.dwtag  DW_TAG_member
	.dwattr $C$DW$115, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$115, DW_AT_name("MMFR")
	.dwattr $C$DW$115, DW_AT_TI_symbol_name("MMFR")
	.dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
	.dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$115, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$115, DW_AT_decl_line(0x1c9)
	.dwattr $C$DW$115, DW_AT_decl_column(0x12)

$C$DW$116	.dwtag  DW_TAG_member
	.dwattr $C$DW$116, DW_AT_type(*$C$DW$T$42)
	.dwattr $C$DW$116, DW_AT_name("ISAR")
	.dwattr $C$DW$116, DW_AT_TI_symbol_name("ISAR")
	.dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
	.dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$116, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$116, DW_AT_decl_line(0x1ca)
	.dwattr $C$DW$116, DW_AT_decl_column(0x12)

$C$DW$117	.dwtag  DW_TAG_member
	.dwattr $C$DW$117, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$117, DW_AT_name("RESERVED0")
	.dwattr $C$DW$117, DW_AT_TI_symbol_name("RESERVED0")
	.dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x74]
	.dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$117, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$117, DW_AT_decl_line(0x1cb)
	.dwattr $C$DW$117, DW_AT_decl_column(0x12)

$C$DW$118	.dwtag  DW_TAG_member
	.dwattr $C$DW$118, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$118, DW_AT_name("CPACR")
	.dwattr $C$DW$118, DW_AT_TI_symbol_name("CPACR")
	.dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
	.dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$118, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$118, DW_AT_decl_line(0x1cc)
	.dwattr $C$DW$118, DW_AT_decl_column(0x12)

	.dwattr $C$DW$T$44, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$T$44, DW_AT_decl_line(0x1b7)
	.dwattr $C$DW$T$44, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$44

$C$DW$T$211	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$211, DW_AT_name("SCB_Type")
	.dwattr $C$DW$T$211, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$T$211, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$211, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$T$211, DW_AT_decl_line(0x1cd)
	.dwattr $C$DW$T$211, DW_AT_decl_column(0x03)


$C$DW$T$46	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$46, DW_AT_byte_size(0x0c)
$C$DW$119	.dwtag  DW_TAG_member
	.dwattr $C$DW$119, DW_AT_type(*$C$DW$T$45)
	.dwattr $C$DW$119, DW_AT_name("RESERVED0")
	.dwattr $C$DW$119, DW_AT_TI_symbol_name("RESERVED0")
	.dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$119, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$119, DW_AT_decl_line(0x2cf)
	.dwattr $C$DW$119, DW_AT_decl_column(0x12)

$C$DW$120	.dwtag  DW_TAG_member
	.dwattr $C$DW$120, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$120, DW_AT_name("ICTR")
	.dwattr $C$DW$120, DW_AT_TI_symbol_name("ICTR")
	.dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$120, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$120, DW_AT_decl_line(0x2d0)
	.dwattr $C$DW$120, DW_AT_decl_column(0x12)

$C$DW$121	.dwtag  DW_TAG_member
	.dwattr $C$DW$121, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$121, DW_AT_name("ACTLR")
	.dwattr $C$DW$121, DW_AT_TI_symbol_name("ACTLR")
	.dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$121, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$121, DW_AT_decl_line(0x2d1)
	.dwattr $C$DW$121, DW_AT_decl_column(0x12)

	.dwattr $C$DW$T$46, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$T$46, DW_AT_decl_line(0x2ce)
	.dwattr $C$DW$T$46, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$46

$C$DW$T$212	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$212, DW_AT_name("SCnSCB_Type")
	.dwattr $C$DW$T$212, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$T$212, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$212, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$T$212, DW_AT_decl_line(0x2d2)
	.dwattr $C$DW$T$212, DW_AT_decl_column(0x03)


$C$DW$T$47	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$47, DW_AT_byte_size(0x10)
$C$DW$122	.dwtag  DW_TAG_member
	.dwattr $C$DW$122, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$122, DW_AT_name("CTRL")
	.dwattr $C$DW$122, DW_AT_TI_symbol_name("CTRL")
	.dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$122, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$122, DW_AT_decl_line(0x2f7)
	.dwattr $C$DW$122, DW_AT_decl_column(0x12)

$C$DW$123	.dwtag  DW_TAG_member
	.dwattr $C$DW$123, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$123, DW_AT_name("LOAD")
	.dwattr $C$DW$123, DW_AT_TI_symbol_name("LOAD")
	.dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$123, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$123, DW_AT_decl_line(0x2f8)
	.dwattr $C$DW$123, DW_AT_decl_column(0x12)

$C$DW$124	.dwtag  DW_TAG_member
	.dwattr $C$DW$124, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$124, DW_AT_name("VAL")
	.dwattr $C$DW$124, DW_AT_TI_symbol_name("VAL")
	.dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$124, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$124, DW_AT_decl_line(0x2f9)
	.dwattr $C$DW$124, DW_AT_decl_column(0x12)

$C$DW$125	.dwtag  DW_TAG_member
	.dwattr $C$DW$125, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$125, DW_AT_name("CALIB")
	.dwattr $C$DW$125, DW_AT_TI_symbol_name("CALIB")
	.dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$125, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$125, DW_AT_decl_line(0x2fa)
	.dwattr $C$DW$125, DW_AT_decl_column(0x12)

	.dwattr $C$DW$T$47, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$T$47, DW_AT_decl_line(0x2f6)
	.dwattr $C$DW$T$47, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$47

$C$DW$T$213	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$213, DW_AT_name("SysTick_Type")
	.dwattr $C$DW$T$213, DW_AT_type(*$C$DW$T$47)
	.dwattr $C$DW$T$213, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$213, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$T$213, DW_AT_decl_line(0x2fb)
	.dwattr $C$DW$T$213, DW_AT_decl_column(0x03)


$C$DW$T$55	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$55, DW_AT_byte_size(0x1000)
$C$DW$126	.dwtag  DW_TAG_member
	.dwattr $C$DW$126, DW_AT_type(*$C$DW$T$49)
	.dwattr $C$DW$126, DW_AT_name("PORT")
	.dwattr $C$DW$126, DW_AT_TI_symbol_name("PORT")
	.dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$126, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$126, DW_AT_decl_line(0x330)
	.dwattr $C$DW$126, DW_AT_decl_column(0x06)

$C$DW$127	.dwtag  DW_TAG_member
	.dwattr $C$DW$127, DW_AT_type(*$C$DW$T$50)
	.dwattr $C$DW$127, DW_AT_name("RESERVED0")
	.dwattr $C$DW$127, DW_AT_TI_symbol_name("RESERVED0")
	.dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
	.dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$127, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$127, DW_AT_decl_line(0x331)
	.dwattr $C$DW$127, DW_AT_decl_column(0x12)

$C$DW$128	.dwtag  DW_TAG_member
	.dwattr $C$DW$128, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$128, DW_AT_name("TER")
	.dwattr $C$DW$128, DW_AT_TI_symbol_name("TER")
	.dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0xe00]
	.dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$128, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$128, DW_AT_decl_line(0x332)
	.dwattr $C$DW$128, DW_AT_decl_column(0x12)

$C$DW$129	.dwtag  DW_TAG_member
	.dwattr $C$DW$129, DW_AT_type(*$C$DW$T$51)
	.dwattr $C$DW$129, DW_AT_name("RESERVED1")
	.dwattr $C$DW$129, DW_AT_TI_symbol_name("RESERVED1")
	.dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0xe04]
	.dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$129, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$129, DW_AT_decl_line(0x333)
	.dwattr $C$DW$129, DW_AT_decl_column(0x12)

$C$DW$130	.dwtag  DW_TAG_member
	.dwattr $C$DW$130, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$130, DW_AT_name("TPR")
	.dwattr $C$DW$130, DW_AT_TI_symbol_name("TPR")
	.dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0xe40]
	.dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$130, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$130, DW_AT_decl_line(0x334)
	.dwattr $C$DW$130, DW_AT_decl_column(0x12)

$C$DW$131	.dwtag  DW_TAG_member
	.dwattr $C$DW$131, DW_AT_type(*$C$DW$T$51)
	.dwattr $C$DW$131, DW_AT_name("RESERVED2")
	.dwattr $C$DW$131, DW_AT_TI_symbol_name("RESERVED2")
	.dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0xe44]
	.dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$131, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$131, DW_AT_decl_line(0x335)
	.dwattr $C$DW$131, DW_AT_decl_column(0x12)

$C$DW$132	.dwtag  DW_TAG_member
	.dwattr $C$DW$132, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$132, DW_AT_name("TCR")
	.dwattr $C$DW$132, DW_AT_TI_symbol_name("TCR")
	.dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0xe80]
	.dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$132, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$132, DW_AT_decl_line(0x336)
	.dwattr $C$DW$132, DW_AT_decl_column(0x12)

$C$DW$133	.dwtag  DW_TAG_member
	.dwattr $C$DW$133, DW_AT_type(*$C$DW$T$52)
	.dwattr $C$DW$133, DW_AT_name("RESERVED3")
	.dwattr $C$DW$133, DW_AT_TI_symbol_name("RESERVED3")
	.dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0xe84]
	.dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$133, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$133, DW_AT_decl_line(0x337)
	.dwattr $C$DW$133, DW_AT_decl_column(0x12)

$C$DW$134	.dwtag  DW_TAG_member
	.dwattr $C$DW$134, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$134, DW_AT_name("IWR")
	.dwattr $C$DW$134, DW_AT_TI_symbol_name("IWR")
	.dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0xef8]
	.dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$134, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$134, DW_AT_decl_line(0x338)
	.dwattr $C$DW$134, DW_AT_decl_column(0x12)

$C$DW$135	.dwtag  DW_TAG_member
	.dwattr $C$DW$135, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$135, DW_AT_name("IRR")
	.dwattr $C$DW$135, DW_AT_TI_symbol_name("IRR")
	.dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0xefc]
	.dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$135, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$135, DW_AT_decl_line(0x339)
	.dwattr $C$DW$135, DW_AT_decl_column(0x12)

$C$DW$136	.dwtag  DW_TAG_member
	.dwattr $C$DW$136, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$136, DW_AT_name("IMCR")
	.dwattr $C$DW$136, DW_AT_TI_symbol_name("IMCR")
	.dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0xf00]
	.dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$136, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$136, DW_AT_decl_line(0x33a)
	.dwattr $C$DW$136, DW_AT_decl_column(0x12)

$C$DW$137	.dwtag  DW_TAG_member
	.dwattr $C$DW$137, DW_AT_type(*$C$DW$T$53)
	.dwattr $C$DW$137, DW_AT_name("RESERVED4")
	.dwattr $C$DW$137, DW_AT_TI_symbol_name("RESERVED4")
	.dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0xf04]
	.dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$137, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$137, DW_AT_decl_line(0x33b)
	.dwattr $C$DW$137, DW_AT_decl_column(0x12)

$C$DW$138	.dwtag  DW_TAG_member
	.dwattr $C$DW$138, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$138, DW_AT_name("LAR")
	.dwattr $C$DW$138, DW_AT_TI_symbol_name("LAR")
	.dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0xfb0]
	.dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$138, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$138, DW_AT_decl_line(0x33c)
	.dwattr $C$DW$138, DW_AT_decl_column(0x12)

$C$DW$139	.dwtag  DW_TAG_member
	.dwattr $C$DW$139, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$139, DW_AT_name("LSR")
	.dwattr $C$DW$139, DW_AT_TI_symbol_name("LSR")
	.dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0xfb4]
	.dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$139, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$139, DW_AT_decl_line(0x33d)
	.dwattr $C$DW$139, DW_AT_decl_column(0x12)

$C$DW$140	.dwtag  DW_TAG_member
	.dwattr $C$DW$140, DW_AT_type(*$C$DW$T$54)
	.dwattr $C$DW$140, DW_AT_name("RESERVED5")
	.dwattr $C$DW$140, DW_AT_TI_symbol_name("RESERVED5")
	.dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0xfb8]
	.dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$140, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$140, DW_AT_decl_line(0x33e)
	.dwattr $C$DW$140, DW_AT_decl_column(0x12)

$C$DW$141	.dwtag  DW_TAG_member
	.dwattr $C$DW$141, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$141, DW_AT_name("PID4")
	.dwattr $C$DW$141, DW_AT_TI_symbol_name("PID4")
	.dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0xfd0]
	.dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$141, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$141, DW_AT_decl_line(0x33f)
	.dwattr $C$DW$141, DW_AT_decl_column(0x12)

$C$DW$142	.dwtag  DW_TAG_member
	.dwattr $C$DW$142, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$142, DW_AT_name("PID5")
	.dwattr $C$DW$142, DW_AT_TI_symbol_name("PID5")
	.dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0xfd4]
	.dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$142, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$142, DW_AT_decl_line(0x340)
	.dwattr $C$DW$142, DW_AT_decl_column(0x12)

$C$DW$143	.dwtag  DW_TAG_member
	.dwattr $C$DW$143, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$143, DW_AT_name("PID6")
	.dwattr $C$DW$143, DW_AT_TI_symbol_name("PID6")
	.dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0xfd8]
	.dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$143, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$143, DW_AT_decl_line(0x341)
	.dwattr $C$DW$143, DW_AT_decl_column(0x12)

$C$DW$144	.dwtag  DW_TAG_member
	.dwattr $C$DW$144, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$144, DW_AT_name("PID7")
	.dwattr $C$DW$144, DW_AT_TI_symbol_name("PID7")
	.dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0xfdc]
	.dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$144, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$144, DW_AT_decl_line(0x342)
	.dwattr $C$DW$144, DW_AT_decl_column(0x12)

$C$DW$145	.dwtag  DW_TAG_member
	.dwattr $C$DW$145, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$145, DW_AT_name("PID0")
	.dwattr $C$DW$145, DW_AT_TI_symbol_name("PID0")
	.dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe0]
	.dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$145, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$145, DW_AT_decl_line(0x343)
	.dwattr $C$DW$145, DW_AT_decl_column(0x12)

$C$DW$146	.dwtag  DW_TAG_member
	.dwattr $C$DW$146, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$146, DW_AT_name("PID1")
	.dwattr $C$DW$146, DW_AT_TI_symbol_name("PID1")
	.dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe4]
	.dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$146, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$146, DW_AT_decl_line(0x344)
	.dwattr $C$DW$146, DW_AT_decl_column(0x12)

$C$DW$147	.dwtag  DW_TAG_member
	.dwattr $C$DW$147, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$147, DW_AT_name("PID2")
	.dwattr $C$DW$147, DW_AT_TI_symbol_name("PID2")
	.dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe8]
	.dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$147, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$147, DW_AT_decl_line(0x345)
	.dwattr $C$DW$147, DW_AT_decl_column(0x12)

$C$DW$148	.dwtag  DW_TAG_member
	.dwattr $C$DW$148, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$148, DW_AT_name("PID3")
	.dwattr $C$DW$148, DW_AT_TI_symbol_name("PID3")
	.dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0xfec]
	.dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$148, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$148, DW_AT_decl_line(0x346)
	.dwattr $C$DW$148, DW_AT_decl_column(0x12)

$C$DW$149	.dwtag  DW_TAG_member
	.dwattr $C$DW$149, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$149, DW_AT_name("CID0")
	.dwattr $C$DW$149, DW_AT_TI_symbol_name("CID0")
	.dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0xff0]
	.dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$149, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$149, DW_AT_decl_line(0x347)
	.dwattr $C$DW$149, DW_AT_decl_column(0x12)

$C$DW$150	.dwtag  DW_TAG_member
	.dwattr $C$DW$150, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$150, DW_AT_name("CID1")
	.dwattr $C$DW$150, DW_AT_TI_symbol_name("CID1")
	.dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0xff4]
	.dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$150, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$150, DW_AT_decl_line(0x348)
	.dwattr $C$DW$150, DW_AT_decl_column(0x12)

$C$DW$151	.dwtag  DW_TAG_member
	.dwattr $C$DW$151, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$151, DW_AT_name("CID2")
	.dwattr $C$DW$151, DW_AT_TI_symbol_name("CID2")
	.dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0xff8]
	.dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$151, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$151, DW_AT_decl_line(0x349)
	.dwattr $C$DW$151, DW_AT_decl_column(0x12)

$C$DW$152	.dwtag  DW_TAG_member
	.dwattr $C$DW$152, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$152, DW_AT_name("CID3")
	.dwattr $C$DW$152, DW_AT_TI_symbol_name("CID3")
	.dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0xffc]
	.dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$152, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$152, DW_AT_decl_line(0x34a)
	.dwattr $C$DW$152, DW_AT_decl_column(0x12)

	.dwattr $C$DW$T$55, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$T$55, DW_AT_decl_line(0x32a)
	.dwattr $C$DW$T$55, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$55

$C$DW$T$214	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$214, DW_AT_name("ITM_Type")
	.dwattr $C$DW$T$214, DW_AT_type(*$C$DW$T$55)
	.dwattr $C$DW$T$214, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$214, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$T$214, DW_AT_decl_line(0x34b)
	.dwattr $C$DW$T$214, DW_AT_decl_column(0x03)


$C$DW$T$56	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$56, DW_AT_byte_size(0x5c)
$C$DW$153	.dwtag  DW_TAG_member
	.dwattr $C$DW$153, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$153, DW_AT_name("CTRL")
	.dwattr $C$DW$153, DW_AT_TI_symbol_name("CTRL")
	.dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$153, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$153, DW_AT_decl_line(0x392)
	.dwattr $C$DW$153, DW_AT_decl_column(0x12)

$C$DW$154	.dwtag  DW_TAG_member
	.dwattr $C$DW$154, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$154, DW_AT_name("CYCCNT")
	.dwattr $C$DW$154, DW_AT_TI_symbol_name("CYCCNT")
	.dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$154, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$154, DW_AT_decl_line(0x393)
	.dwattr $C$DW$154, DW_AT_decl_column(0x12)

$C$DW$155	.dwtag  DW_TAG_member
	.dwattr $C$DW$155, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$155, DW_AT_name("CPICNT")
	.dwattr $C$DW$155, DW_AT_TI_symbol_name("CPICNT")
	.dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$155, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$155, DW_AT_decl_line(0x394)
	.dwattr $C$DW$155, DW_AT_decl_column(0x12)

$C$DW$156	.dwtag  DW_TAG_member
	.dwattr $C$DW$156, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$156, DW_AT_name("EXCCNT")
	.dwattr $C$DW$156, DW_AT_TI_symbol_name("EXCCNT")
	.dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$156, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$156, DW_AT_decl_line(0x395)
	.dwattr $C$DW$156, DW_AT_decl_column(0x12)

$C$DW$157	.dwtag  DW_TAG_member
	.dwattr $C$DW$157, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$157, DW_AT_name("SLEEPCNT")
	.dwattr $C$DW$157, DW_AT_TI_symbol_name("SLEEPCNT")
	.dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$157, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$157, DW_AT_decl_line(0x396)
	.dwattr $C$DW$157, DW_AT_decl_column(0x12)

$C$DW$158	.dwtag  DW_TAG_member
	.dwattr $C$DW$158, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$158, DW_AT_name("LSUCNT")
	.dwattr $C$DW$158, DW_AT_TI_symbol_name("LSUCNT")
	.dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$158, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$158, DW_AT_decl_line(0x397)
	.dwattr $C$DW$158, DW_AT_decl_column(0x12)

$C$DW$159	.dwtag  DW_TAG_member
	.dwattr $C$DW$159, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$159, DW_AT_name("FOLDCNT")
	.dwattr $C$DW$159, DW_AT_TI_symbol_name("FOLDCNT")
	.dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$159, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$159, DW_AT_decl_line(0x398)
	.dwattr $C$DW$159, DW_AT_decl_column(0x12)

$C$DW$160	.dwtag  DW_TAG_member
	.dwattr $C$DW$160, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$160, DW_AT_name("PCSR")
	.dwattr $C$DW$160, DW_AT_TI_symbol_name("PCSR")
	.dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$160, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$160, DW_AT_decl_line(0x399)
	.dwattr $C$DW$160, DW_AT_decl_column(0x12)

$C$DW$161	.dwtag  DW_TAG_member
	.dwattr $C$DW$161, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$161, DW_AT_name("COMP0")
	.dwattr $C$DW$161, DW_AT_TI_symbol_name("COMP0")
	.dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$161, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$161, DW_AT_decl_line(0x39a)
	.dwattr $C$DW$161, DW_AT_decl_column(0x12)

$C$DW$162	.dwtag  DW_TAG_member
	.dwattr $C$DW$162, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$162, DW_AT_name("MASK0")
	.dwattr $C$DW$162, DW_AT_TI_symbol_name("MASK0")
	.dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$162, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$162, DW_AT_decl_line(0x39b)
	.dwattr $C$DW$162, DW_AT_decl_column(0x12)

$C$DW$163	.dwtag  DW_TAG_member
	.dwattr $C$DW$163, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$163, DW_AT_name("FUNCTION0")
	.dwattr $C$DW$163, DW_AT_TI_symbol_name("FUNCTION0")
	.dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$163, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$163, DW_AT_decl_line(0x39c)
	.dwattr $C$DW$163, DW_AT_decl_column(0x12)

$C$DW$164	.dwtag  DW_TAG_member
	.dwattr $C$DW$164, DW_AT_type(*$C$DW$T$45)
	.dwattr $C$DW$164, DW_AT_name("RESERVED0")
	.dwattr $C$DW$164, DW_AT_TI_symbol_name("RESERVED0")
	.dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$164, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$164, DW_AT_decl_line(0x39d)
	.dwattr $C$DW$164, DW_AT_decl_column(0x12)

$C$DW$165	.dwtag  DW_TAG_member
	.dwattr $C$DW$165, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$165, DW_AT_name("COMP1")
	.dwattr $C$DW$165, DW_AT_TI_symbol_name("COMP1")
	.dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$165, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$165, DW_AT_decl_line(0x39e)
	.dwattr $C$DW$165, DW_AT_decl_column(0x12)

$C$DW$166	.dwtag  DW_TAG_member
	.dwattr $C$DW$166, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$166, DW_AT_name("MASK1")
	.dwattr $C$DW$166, DW_AT_TI_symbol_name("MASK1")
	.dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$166, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$166, DW_AT_decl_line(0x39f)
	.dwattr $C$DW$166, DW_AT_decl_column(0x12)

$C$DW$167	.dwtag  DW_TAG_member
	.dwattr $C$DW$167, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$167, DW_AT_name("FUNCTION1")
	.dwattr $C$DW$167, DW_AT_TI_symbol_name("FUNCTION1")
	.dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$167, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$167, DW_AT_decl_line(0x3a0)
	.dwattr $C$DW$167, DW_AT_decl_column(0x12)

$C$DW$168	.dwtag  DW_TAG_member
	.dwattr $C$DW$168, DW_AT_type(*$C$DW$T$45)
	.dwattr $C$DW$168, DW_AT_name("RESERVED1")
	.dwattr $C$DW$168, DW_AT_TI_symbol_name("RESERVED1")
	.dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
	.dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$168, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$168, DW_AT_decl_line(0x3a1)
	.dwattr $C$DW$168, DW_AT_decl_column(0x12)

$C$DW$169	.dwtag  DW_TAG_member
	.dwattr $C$DW$169, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$169, DW_AT_name("COMP2")
	.dwattr $C$DW$169, DW_AT_TI_symbol_name("COMP2")
	.dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
	.dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$169, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$169, DW_AT_decl_line(0x3a2)
	.dwattr $C$DW$169, DW_AT_decl_column(0x12)

$C$DW$170	.dwtag  DW_TAG_member
	.dwattr $C$DW$170, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$170, DW_AT_name("MASK2")
	.dwattr $C$DW$170, DW_AT_TI_symbol_name("MASK2")
	.dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
	.dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$170, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$170, DW_AT_decl_line(0x3a3)
	.dwattr $C$DW$170, DW_AT_decl_column(0x12)

$C$DW$171	.dwtag  DW_TAG_member
	.dwattr $C$DW$171, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$171, DW_AT_name("FUNCTION2")
	.dwattr $C$DW$171, DW_AT_TI_symbol_name("FUNCTION2")
	.dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
	.dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$171, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$171, DW_AT_decl_line(0x3a4)
	.dwattr $C$DW$171, DW_AT_decl_column(0x12)

$C$DW$172	.dwtag  DW_TAG_member
	.dwattr $C$DW$172, DW_AT_type(*$C$DW$T$45)
	.dwattr $C$DW$172, DW_AT_name("RESERVED2")
	.dwattr $C$DW$172, DW_AT_TI_symbol_name("RESERVED2")
	.dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
	.dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$172, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$172, DW_AT_decl_line(0x3a5)
	.dwattr $C$DW$172, DW_AT_decl_column(0x12)

$C$DW$173	.dwtag  DW_TAG_member
	.dwattr $C$DW$173, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$173, DW_AT_name("COMP3")
	.dwattr $C$DW$173, DW_AT_TI_symbol_name("COMP3")
	.dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
	.dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$173, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$173, DW_AT_decl_line(0x3a6)
	.dwattr $C$DW$173, DW_AT_decl_column(0x12)

$C$DW$174	.dwtag  DW_TAG_member
	.dwattr $C$DW$174, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$174, DW_AT_name("MASK3")
	.dwattr $C$DW$174, DW_AT_TI_symbol_name("MASK3")
	.dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
	.dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$174, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$174, DW_AT_decl_line(0x3a7)
	.dwattr $C$DW$174, DW_AT_decl_column(0x12)

$C$DW$175	.dwtag  DW_TAG_member
	.dwattr $C$DW$175, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$175, DW_AT_name("FUNCTION3")
	.dwattr $C$DW$175, DW_AT_TI_symbol_name("FUNCTION3")
	.dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
	.dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$175, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$175, DW_AT_decl_line(0x3a8)
	.dwattr $C$DW$175, DW_AT_decl_column(0x12)

	.dwattr $C$DW$T$56, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$T$56, DW_AT_decl_line(0x391)
	.dwattr $C$DW$T$56, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$56

$C$DW$T$215	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$215, DW_AT_name("DWT_Type")
	.dwattr $C$DW$T$215, DW_AT_type(*$C$DW$T$56)
	.dwattr $C$DW$T$215, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$215, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$T$215, DW_AT_decl_line(0x3a9)
	.dwattr $C$DW$T$215, DW_AT_decl_column(0x03)


$C$DW$T$63	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$63, DW_AT_byte_size(0xfd0)
$C$DW$176	.dwtag  DW_TAG_member
	.dwattr $C$DW$176, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$176, DW_AT_name("SSPSR")
	.dwattr $C$DW$176, DW_AT_TI_symbol_name("SSPSR")
	.dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$176, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$176, DW_AT_decl_line(0x425)
	.dwattr $C$DW$176, DW_AT_decl_column(0x12)

$C$DW$177	.dwtag  DW_TAG_member
	.dwattr $C$DW$177, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$177, DW_AT_name("CSPSR")
	.dwattr $C$DW$177, DW_AT_TI_symbol_name("CSPSR")
	.dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$177, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$177, DW_AT_decl_line(0x426)
	.dwattr $C$DW$177, DW_AT_decl_column(0x12)

$C$DW$178	.dwtag  DW_TAG_member
	.dwattr $C$DW$178, DW_AT_type(*$C$DW$T$57)
	.dwattr $C$DW$178, DW_AT_name("RESERVED0")
	.dwattr $C$DW$178, DW_AT_TI_symbol_name("RESERVED0")
	.dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$178, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$178, DW_AT_decl_line(0x427)
	.dwattr $C$DW$178, DW_AT_decl_column(0x12)

$C$DW$179	.dwtag  DW_TAG_member
	.dwattr $C$DW$179, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$179, DW_AT_name("ACPR")
	.dwattr $C$DW$179, DW_AT_TI_symbol_name("ACPR")
	.dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$179, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$179, DW_AT_decl_line(0x428)
	.dwattr $C$DW$179, DW_AT_decl_column(0x12)

$C$DW$180	.dwtag  DW_TAG_member
	.dwattr $C$DW$180, DW_AT_type(*$C$DW$T$58)
	.dwattr $C$DW$180, DW_AT_name("RESERVED1")
	.dwattr $C$DW$180, DW_AT_TI_symbol_name("RESERVED1")
	.dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$180, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$180, DW_AT_decl_line(0x429)
	.dwattr $C$DW$180, DW_AT_decl_column(0x12)

$C$DW$181	.dwtag  DW_TAG_member
	.dwattr $C$DW$181, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$181, DW_AT_name("SPPR")
	.dwattr $C$DW$181, DW_AT_TI_symbol_name("SPPR")
	.dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
	.dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$181, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$181, DW_AT_decl_line(0x42a)
	.dwattr $C$DW$181, DW_AT_decl_column(0x12)

$C$DW$182	.dwtag  DW_TAG_member
	.dwattr $C$DW$182, DW_AT_type(*$C$DW$T$59)
	.dwattr $C$DW$182, DW_AT_name("RESERVED2")
	.dwattr $C$DW$182, DW_AT_TI_symbol_name("RESERVED2")
	.dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
	.dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$182, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$182, DW_AT_decl_line(0x42b)
	.dwattr $C$DW$182, DW_AT_decl_column(0x12)

$C$DW$183	.dwtag  DW_TAG_member
	.dwattr $C$DW$183, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$183, DW_AT_name("FFSR")
	.dwattr $C$DW$183, DW_AT_TI_symbol_name("FFSR")
	.dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x300]
	.dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$183, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$183, DW_AT_decl_line(0x42c)
	.dwattr $C$DW$183, DW_AT_decl_column(0x12)

$C$DW$184	.dwtag  DW_TAG_member
	.dwattr $C$DW$184, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$184, DW_AT_name("FFCR")
	.dwattr $C$DW$184, DW_AT_TI_symbol_name("FFCR")
	.dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x304]
	.dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$184, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$184, DW_AT_decl_line(0x42d)
	.dwattr $C$DW$184, DW_AT_decl_column(0x12)

$C$DW$185	.dwtag  DW_TAG_member
	.dwattr $C$DW$185, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$185, DW_AT_name("FSCR")
	.dwattr $C$DW$185, DW_AT_TI_symbol_name("FSCR")
	.dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x308]
	.dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$185, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$185, DW_AT_decl_line(0x42e)
	.dwattr $C$DW$185, DW_AT_decl_column(0x12)

$C$DW$186	.dwtag  DW_TAG_member
	.dwattr $C$DW$186, DW_AT_type(*$C$DW$T$60)
	.dwattr $C$DW$186, DW_AT_name("RESERVED3")
	.dwattr $C$DW$186, DW_AT_TI_symbol_name("RESERVED3")
	.dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x30c]
	.dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$186, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$186, DW_AT_decl_line(0x42f)
	.dwattr $C$DW$186, DW_AT_decl_column(0x12)

$C$DW$187	.dwtag  DW_TAG_member
	.dwattr $C$DW$187, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$187, DW_AT_name("TRIGGER")
	.dwattr $C$DW$187, DW_AT_TI_symbol_name("TRIGGER")
	.dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0xee8]
	.dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$187, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$187, DW_AT_decl_line(0x430)
	.dwattr $C$DW$187, DW_AT_decl_column(0x12)

$C$DW$188	.dwtag  DW_TAG_member
	.dwattr $C$DW$188, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$188, DW_AT_name("FIFO0")
	.dwattr $C$DW$188, DW_AT_TI_symbol_name("FIFO0")
	.dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0xeec]
	.dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$188, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$188, DW_AT_decl_line(0x431)
	.dwattr $C$DW$188, DW_AT_decl_column(0x12)

$C$DW$189	.dwtag  DW_TAG_member
	.dwattr $C$DW$189, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$189, DW_AT_name("ITATBCTR2")
	.dwattr $C$DW$189, DW_AT_TI_symbol_name("ITATBCTR2")
	.dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0xef0]
	.dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$189, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$189, DW_AT_decl_line(0x432)
	.dwattr $C$DW$189, DW_AT_decl_column(0x12)

$C$DW$190	.dwtag  DW_TAG_member
	.dwattr $C$DW$190, DW_AT_type(*$C$DW$T$45)
	.dwattr $C$DW$190, DW_AT_name("RESERVED4")
	.dwattr $C$DW$190, DW_AT_TI_symbol_name("RESERVED4")
	.dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0xef4]
	.dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$190, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$190, DW_AT_decl_line(0x433)
	.dwattr $C$DW$190, DW_AT_decl_column(0x12)

$C$DW$191	.dwtag  DW_TAG_member
	.dwattr $C$DW$191, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$191, DW_AT_name("ITATBCTR0")
	.dwattr $C$DW$191, DW_AT_TI_symbol_name("ITATBCTR0")
	.dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0xef8]
	.dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$191, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$191, DW_AT_decl_line(0x434)
	.dwattr $C$DW$191, DW_AT_decl_column(0x12)

$C$DW$192	.dwtag  DW_TAG_member
	.dwattr $C$DW$192, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$192, DW_AT_name("FIFO1")
	.dwattr $C$DW$192, DW_AT_TI_symbol_name("FIFO1")
	.dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0xefc]
	.dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$192, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$192, DW_AT_decl_line(0x435)
	.dwattr $C$DW$192, DW_AT_decl_column(0x12)

$C$DW$193	.dwtag  DW_TAG_member
	.dwattr $C$DW$193, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$193, DW_AT_name("ITCTRL")
	.dwattr $C$DW$193, DW_AT_TI_symbol_name("ITCTRL")
	.dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0xf00]
	.dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$193, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$193, DW_AT_decl_line(0x436)
	.dwattr $C$DW$193, DW_AT_decl_column(0x12)

$C$DW$194	.dwtag  DW_TAG_member
	.dwattr $C$DW$194, DW_AT_type(*$C$DW$T$61)
	.dwattr $C$DW$194, DW_AT_name("RESERVED5")
	.dwattr $C$DW$194, DW_AT_TI_symbol_name("RESERVED5")
	.dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0xf04]
	.dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$194, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$194, DW_AT_decl_line(0x437)
	.dwattr $C$DW$194, DW_AT_decl_column(0x12)

$C$DW$195	.dwtag  DW_TAG_member
	.dwattr $C$DW$195, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$195, DW_AT_name("CLAIMSET")
	.dwattr $C$DW$195, DW_AT_TI_symbol_name("CLAIMSET")
	.dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa0]
	.dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$195, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$195, DW_AT_decl_line(0x438)
	.dwattr $C$DW$195, DW_AT_decl_column(0x12)

$C$DW$196	.dwtag  DW_TAG_member
	.dwattr $C$DW$196, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$196, DW_AT_name("CLAIMCLR")
	.dwattr $C$DW$196, DW_AT_TI_symbol_name("CLAIMCLR")
	.dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa4]
	.dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$196, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$196, DW_AT_decl_line(0x439)
	.dwattr $C$DW$196, DW_AT_decl_column(0x12)

$C$DW$197	.dwtag  DW_TAG_member
	.dwattr $C$DW$197, DW_AT_type(*$C$DW$T$62)
	.dwattr $C$DW$197, DW_AT_name("RESERVED7")
	.dwattr $C$DW$197, DW_AT_TI_symbol_name("RESERVED7")
	.dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa8]
	.dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$197, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$197, DW_AT_decl_line(0x43a)
	.dwattr $C$DW$197, DW_AT_decl_column(0x12)

$C$DW$198	.dwtag  DW_TAG_member
	.dwattr $C$DW$198, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$198, DW_AT_name("DEVID")
	.dwattr $C$DW$198, DW_AT_TI_symbol_name("DEVID")
	.dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0xfc8]
	.dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$198, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$198, DW_AT_decl_line(0x43b)
	.dwattr $C$DW$198, DW_AT_decl_column(0x12)

$C$DW$199	.dwtag  DW_TAG_member
	.dwattr $C$DW$199, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$199, DW_AT_name("DEVTYPE")
	.dwattr $C$DW$199, DW_AT_TI_symbol_name("DEVTYPE")
	.dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0xfcc]
	.dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$199, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$199, DW_AT_decl_line(0x43c)
	.dwattr $C$DW$199, DW_AT_decl_column(0x12)

	.dwattr $C$DW$T$63, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$T$63, DW_AT_decl_line(0x424)
	.dwattr $C$DW$T$63, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$63

$C$DW$T$216	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$216, DW_AT_name("TPI_Type")
	.dwattr $C$DW$T$216, DW_AT_type(*$C$DW$T$63)
	.dwattr $C$DW$T$216, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$216, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$T$216, DW_AT_decl_line(0x43d)
	.dwattr $C$DW$T$216, DW_AT_decl_column(0x03)


$C$DW$T$64	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$64, DW_AT_byte_size(0x2c)
$C$DW$200	.dwtag  DW_TAG_member
	.dwattr $C$DW$200, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$200, DW_AT_name("TYPE")
	.dwattr $C$DW$200, DW_AT_TI_symbol_name("TYPE")
	.dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$200, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$200, DW_AT_decl_line(0x4c1)
	.dwattr $C$DW$200, DW_AT_decl_column(0x12)

$C$DW$201	.dwtag  DW_TAG_member
	.dwattr $C$DW$201, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$201, DW_AT_name("CTRL")
	.dwattr $C$DW$201, DW_AT_TI_symbol_name("CTRL")
	.dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$201, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$201, DW_AT_decl_line(0x4c2)
	.dwattr $C$DW$201, DW_AT_decl_column(0x12)

$C$DW$202	.dwtag  DW_TAG_member
	.dwattr $C$DW$202, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$202, DW_AT_name("RNR")
	.dwattr $C$DW$202, DW_AT_TI_symbol_name("RNR")
	.dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$202, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$202, DW_AT_decl_line(0x4c3)
	.dwattr $C$DW$202, DW_AT_decl_column(0x12)

$C$DW$203	.dwtag  DW_TAG_member
	.dwattr $C$DW$203, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$203, DW_AT_name("RBAR")
	.dwattr $C$DW$203, DW_AT_TI_symbol_name("RBAR")
	.dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$203, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$203, DW_AT_decl_line(0x4c4)
	.dwattr $C$DW$203, DW_AT_decl_column(0x12)

$C$DW$204	.dwtag  DW_TAG_member
	.dwattr $C$DW$204, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$204, DW_AT_name("RASR")
	.dwattr $C$DW$204, DW_AT_TI_symbol_name("RASR")
	.dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$204, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$204, DW_AT_decl_line(0x4c5)
	.dwattr $C$DW$204, DW_AT_decl_column(0x12)

$C$DW$205	.dwtag  DW_TAG_member
	.dwattr $C$DW$205, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$205, DW_AT_name("RBAR_A1")
	.dwattr $C$DW$205, DW_AT_TI_symbol_name("RBAR_A1")
	.dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$205, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$205, DW_AT_decl_line(0x4c6)
	.dwattr $C$DW$205, DW_AT_decl_column(0x12)

$C$DW$206	.dwtag  DW_TAG_member
	.dwattr $C$DW$206, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$206, DW_AT_name("RASR_A1")
	.dwattr $C$DW$206, DW_AT_TI_symbol_name("RASR_A1")
	.dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$206, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$206, DW_AT_decl_line(0x4c7)
	.dwattr $C$DW$206, DW_AT_decl_column(0x12)

$C$DW$207	.dwtag  DW_TAG_member
	.dwattr $C$DW$207, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$207, DW_AT_name("RBAR_A2")
	.dwattr $C$DW$207, DW_AT_TI_symbol_name("RBAR_A2")
	.dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$207, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$207, DW_AT_decl_line(0x4c8)
	.dwattr $C$DW$207, DW_AT_decl_column(0x12)

$C$DW$208	.dwtag  DW_TAG_member
	.dwattr $C$DW$208, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$208, DW_AT_name("RASR_A2")
	.dwattr $C$DW$208, DW_AT_TI_symbol_name("RASR_A2")
	.dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$208, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$208, DW_AT_decl_line(0x4c9)
	.dwattr $C$DW$208, DW_AT_decl_column(0x12)

$C$DW$209	.dwtag  DW_TAG_member
	.dwattr $C$DW$209, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$209, DW_AT_name("RBAR_A3")
	.dwattr $C$DW$209, DW_AT_TI_symbol_name("RBAR_A3")
	.dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$209, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$209, DW_AT_decl_line(0x4ca)
	.dwattr $C$DW$209, DW_AT_decl_column(0x12)

$C$DW$210	.dwtag  DW_TAG_member
	.dwattr $C$DW$210, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$210, DW_AT_name("RASR_A3")
	.dwattr $C$DW$210, DW_AT_TI_symbol_name("RASR_A3")
	.dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$210, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$210, DW_AT_decl_line(0x4cb)
	.dwattr $C$DW$210, DW_AT_decl_column(0x12)

	.dwattr $C$DW$T$64, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$T$64, DW_AT_decl_line(0x4c0)
	.dwattr $C$DW$T$64, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$64

$C$DW$T$217	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$217, DW_AT_name("MPU_Type")
	.dwattr $C$DW$T$217, DW_AT_type(*$C$DW$T$64)
	.dwattr $C$DW$T$217, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$217, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$T$217, DW_AT_decl_line(0x4cc)
	.dwattr $C$DW$T$217, DW_AT_decl_column(0x03)


$C$DW$T$65	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$65, DW_AT_byte_size(0x18)
$C$DW$211	.dwtag  DW_TAG_member
	.dwattr $C$DW$211, DW_AT_type(*$C$DW$T$45)
	.dwattr $C$DW$211, DW_AT_name("RESERVED0")
	.dwattr $C$DW$211, DW_AT_TI_symbol_name("RESERVED0")
	.dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$211, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$211, DW_AT_decl_line(0x51f)
	.dwattr $C$DW$211, DW_AT_decl_column(0x12)

$C$DW$212	.dwtag  DW_TAG_member
	.dwattr $C$DW$212, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$212, DW_AT_name("FPCCR")
	.dwattr $C$DW$212, DW_AT_TI_symbol_name("FPCCR")
	.dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$212, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$212, DW_AT_decl_line(0x520)
	.dwattr $C$DW$212, DW_AT_decl_column(0x12)

$C$DW$213	.dwtag  DW_TAG_member
	.dwattr $C$DW$213, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$213, DW_AT_name("FPCAR")
	.dwattr $C$DW$213, DW_AT_TI_symbol_name("FPCAR")
	.dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$213, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$213, DW_AT_decl_line(0x521)
	.dwattr $C$DW$213, DW_AT_decl_column(0x12)

$C$DW$214	.dwtag  DW_TAG_member
	.dwattr $C$DW$214, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$214, DW_AT_name("FPDSCR")
	.dwattr $C$DW$214, DW_AT_TI_symbol_name("FPDSCR")
	.dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$214, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$214, DW_AT_decl_line(0x522)
	.dwattr $C$DW$214, DW_AT_decl_column(0x12)

$C$DW$215	.dwtag  DW_TAG_member
	.dwattr $C$DW$215, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$215, DW_AT_name("MVFR0")
	.dwattr $C$DW$215, DW_AT_TI_symbol_name("MVFR0")
	.dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$215, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$215, DW_AT_decl_line(0x523)
	.dwattr $C$DW$215, DW_AT_decl_column(0x12)

$C$DW$216	.dwtag  DW_TAG_member
	.dwattr $C$DW$216, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$216, DW_AT_name("MVFR1")
	.dwattr $C$DW$216, DW_AT_TI_symbol_name("MVFR1")
	.dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$216, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$216, DW_AT_decl_line(0x524)
	.dwattr $C$DW$216, DW_AT_decl_column(0x12)

	.dwattr $C$DW$T$65, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$T$65, DW_AT_decl_line(0x51e)
	.dwattr $C$DW$T$65, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$65

$C$DW$T$218	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$218, DW_AT_name("FPU_Type")
	.dwattr $C$DW$T$218, DW_AT_type(*$C$DW$T$65)
	.dwattr $C$DW$T$218, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$218, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$T$218, DW_AT_decl_line(0x525)
	.dwattr $C$DW$T$218, DW_AT_decl_column(0x03)


$C$DW$T$66	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$66, DW_AT_byte_size(0x10)
$C$DW$217	.dwtag  DW_TAG_member
	.dwattr $C$DW$217, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$217, DW_AT_name("DHCSR")
	.dwattr $C$DW$217, DW_AT_TI_symbol_name("DHCSR")
	.dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$217, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$217, DW_AT_decl_line(0x589)
	.dwattr $C$DW$217, DW_AT_decl_column(0x12)

$C$DW$218	.dwtag  DW_TAG_member
	.dwattr $C$DW$218, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$218, DW_AT_name("DCRSR")
	.dwattr $C$DW$218, DW_AT_TI_symbol_name("DCRSR")
	.dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$218, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$218, DW_AT_decl_line(0x58a)
	.dwattr $C$DW$218, DW_AT_decl_column(0x12)

$C$DW$219	.dwtag  DW_TAG_member
	.dwattr $C$DW$219, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$219, DW_AT_name("DCRDR")
	.dwattr $C$DW$219, DW_AT_TI_symbol_name("DCRDR")
	.dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$219, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$219, DW_AT_decl_line(0x58b)
	.dwattr $C$DW$219, DW_AT_decl_column(0x12)

$C$DW$220	.dwtag  DW_TAG_member
	.dwattr $C$DW$220, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$220, DW_AT_name("DEMCR")
	.dwattr $C$DW$220, DW_AT_TI_symbol_name("DEMCR")
	.dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$220, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$220, DW_AT_decl_line(0x58c)
	.dwattr $C$DW$220, DW_AT_decl_column(0x12)

	.dwattr $C$DW$T$66, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$T$66, DW_AT_decl_line(0x588)
	.dwattr $C$DW$T$66, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$66

$C$DW$T$219	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$219, DW_AT_name("CoreDebug_Type")
	.dwattr $C$DW$T$219, DW_AT_type(*$C$DW$T$66)
	.dwattr $C$DW$T$219, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$219, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$T$219, DW_AT_decl_line(0x58d)
	.dwattr $C$DW$T$219, DW_AT_decl_column(0x03)


$C$DW$T$69	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$69, DW_AT_byte_size(0x158)
$C$DW$221	.dwtag  DW_TAG_member
	.dwattr $C$DW$221, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$221, DW_AT_name("CTL0")
	.dwattr $C$DW$221, DW_AT_TI_symbol_name("CTL0")
	.dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$221, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_2_40_00_10\source\ti\devices\msp432p4xx\inc\msp432p401r.h")
	.dwattr $C$DW$221, DW_AT_decl_line(0x16d)
	.dwattr $C$DW$221, DW_AT_decl_column(0x11)

$C$DW$222	.dwtag  DW_TAG_member
	.dwattr $C$DW$222, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$222, DW_AT_name("CTL1")
	.dwattr $C$DW$222, DW_AT_TI_symbol_name("CTL1")
	.dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$222, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_2_40_00_10\source\ti\devices\msp432p4xx\inc\msp432p401r.h")
	.dwattr $C$DW$222, DW_AT_decl_line(0x16e)
	.dwattr $C$DW$222, DW_AT_decl_column(0x11)

$C$DW$223	.dwtag  DW_TAG_member
	.dwattr $C$DW$223, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$223, DW_AT_name("LO0")
	.dwattr $C$DW$223, DW_AT_TI_symbol_name("LO0")
	.dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$223, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_2_40_00_10\source\ti\devices\msp432p4xx\inc\msp432p401r.h")
	.dwattr $C$DW$223, DW_AT_decl_line(0x16f)
	.dwattr $C$DW$223, DW_AT_decl_column(0x11)

$C$DW$224	.dwtag  DW_TAG_member
	.dwattr $C$DW$224, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$224, DW_AT_name("HI0")
	.dwattr $C$DW$224, DW_AT_TI_symbol_name("HI0")
	.dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$224, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_2_40_00_10\source\ti\devices\msp432p4xx\inc\msp432p401r.h")
	.dwattr $C$DW$224, DW_AT_decl_line(0x170)
	.dwattr $C$DW$224, DW_AT_decl_column(0x11)

$C$DW$225	.dwtag  DW_TAG_member
	.dwattr $C$DW$225, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$225, DW_AT_name("LO1")
	.dwattr $C$DW$225, DW_AT_TI_symbol_name("LO1")
	.dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$225, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_2_40_00_10\source\ti\devices\msp432p4xx\inc\msp432p401r.h")
	.dwattr $C$DW$225, DW_AT_decl_line(0x171)
	.dwattr $C$DW$225, DW_AT_decl_column(0x11)

$C$DW$226	.dwtag  DW_TAG_member
	.dwattr $C$DW$226, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$226, DW_AT_name("HI1")
	.dwattr $C$DW$226, DW_AT_TI_symbol_name("HI1")
	.dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$226, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_2_40_00_10\source\ti\devices\msp432p4xx\inc\msp432p401r.h")
	.dwattr $C$DW$226, DW_AT_decl_line(0x172)
	.dwattr $C$DW$226, DW_AT_decl_column(0x11)

$C$DW$227	.dwtag  DW_TAG_member
