;******************************************************************************
;* TI ARM C/C++ Codegen                                        PC v18.1.4.LTS *
;* Date/Time created: Tue Oct  8 13:14:21 2019                                *
;******************************************************************************
	.compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embedded_constants=on --endian=little --float_support=FPv4SPD16 --hll_source=on --object_format=elf --silicon_version=7M4 --symdebug:dwarf --symdebug:dwarf_version=3 --unaligned_access=on 
	.thumb

$C$DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr $C$DW$CU, DW_AT_name("../main.c")
	.dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v18.1.4.LTS Copyright (c) 1996-2018 Texas Instruments Incorporated")
	.dwattr $C$DW$CU, DW_AT_TI_version(0x01)
	.dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\pante\Desktop\simon_PSP\Debug")
	.bss	previousSnap$1,4,4

$C$DW$1	.dwtag  DW_TAG_subprogram
	.dwattr $C$DW$1, DW_AT_name("Timer32_getValue")
	.dwattr $C$DW$1, DW_AT_TI_symbol_name("Timer32_getValue")
	.dwattr $C$DW$1, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1, DW_AT_declaration
	.dwattr $C$DW$1, DW_AT_external
	.dwattr $C$DW$1, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_1_60_00_12/source/ti/devices/msp432p4xx/driverlib/timer32.h")
	.dwattr $C$DW$1, DW_AT_decl_line(0xb4)
	.dwattr $C$DW$1, DW_AT_decl_column(0x11)
$C$DW$2	.dwtag  DW_TAG_formal_parameter

        STR       A1, [SP, #2428]       ; [DPU_V7M3_PIPE] |112| 
	.dwpsn	file "../main.c",line 112,column 21,is_stmt,isa 1
        LDR       A1, [SP, #2428]       ; [DPU_V7M3_PIPE] |112| 
        CMP       A1, #0                ; [DPU_V7M3_PIPE] |112| 
        BMI       ||$C$L32||            ; [DPU_V7M3_PIPE] |112| 
        ; BRANCHCC OCCURS {||$C$L32||}   ; [] |112| 
;* --------------------------------------------------------------------------*
;*   BEGIN LOOP ||$C$L31||
;*
;*   Loop source line                : 112
;*   Loop closing brace source line  : 114
;*   Known Minimum Trip Count        : 1
;*   Known Maximum Trip Count        : 4294967295
;*   Known Max Trip Count Factor     : 1
;* --------------------------------------------------------------------------*
||$C$L31||:    
	.dwpsn	file "../main.c",line 113,column 12,is_stmt,isa 1
        LDR       A1, [SP, #2428]       ; [DPU_V7M3_PIPE] |113| 
        ADD       A1, SP, A1, LSL #2    ; [DPU_V7M3_PIPE] |113| 
        LDR       A1, [A1, #1096]       ; [DPU_V7M3_PIPE] |113| 
        AND       A1, A1, #-2147483648  ; [DPU_V7M3_PIPE] |113| 
        LSRS      A2, A1, #31           ; [DPU_V7M3_PIPE] |113| 
        ADR       A1, $C$SL3            ; [DPU_V7M3_PIPE] |113| 
$C$DW$1585	.dwtag  DW_TAG_TI_branch
	.dwattr $C$DW$1585, DW_AT_low_pc(0x00)
	.dwattr $C$DW$1585, DW_AT_name("printf")
	.dwattr $C$DW$1585, DW_AT_TI_call

        BL        printf                ; [DPU_V7M3_PIPE] |113| 
        ; CALL OCCURS {printf }          ; [] |113| 
	.dwpsn	file "../main.c",line 112,column 28,is_stmt,isa 1
        LDR       A1, [SP, #2428]       ; [DPU_V7M3_PIPE] |112| 
        SUBS      A1, A1, #1            ; [DPU_V7M3_PIPE] |112| 
        STR       A1, [SP, #2428]       ; [DPU_V7M3_PIPE] |112| 
	.dwpsn	file "../main.c",line 112,column 21,is_stmt,isa 1
        LDR       A1, [SP, #2428]       ; [DPU_V7M3_PIPE] |112| 
        CMP       A1, #0                ; [DPU_V7M3_PIPE] |112| 
        BPL       ||$C$L31||            ; [DPU_V7M3_PIPE] |112| 
        ; BRANCHCC OCCURS {||$C$L31||}   ; [] |112| 
;* --------------------------------------------------------------------------*
||$C$L32||:    
	.dwpsn	file "../main.c",line 115,column 8,is_stmt,isa 1
        ADR       A1, $C$SL4            ; [DPU_V7M3_PIPE] |115| 
$C$DW$1586	.dwtag  DW_TAG_TI_branch
	.dwattr $C$DW$1586, DW_AT_low_pc(0x00)
	.dwattr $C$DW$1586, DW_AT_name("printf")
	.dwattr $C$DW$1586, DW_AT_TI_call

        BL        printf                ; [DPU_V7M3_PIPE] |115| 
        ; CALL OCCURS {printf }          ; [] |115| 
	.dwpsn	file "../main.c",line 118,column 5,is_stmt,isa 1
        MOVS      A1, #0                ; [DPU_V7M3_PIPE] |118| 
	.dwpsn	file "../main.c",line 119,column 1,is_stmt,isa 1
        LDR       A2, $C$CON8           ; [DPU_V7M3_PIPE] 
        RSBS      A2, A2, #0            ; [DPU_V7M3_PIPE] 
        ADD       SP, SP, A2            ; [DPU_V7M3_PIPE] 
	.dwcfi	cfa_offset, 12
$C$DW$1587	.dwtag  DW_TAG_TI_branch
	.dwattr $C$DW$1587, DW_AT_low_pc(0x00)
	.dwattr $C$DW$1587, DW_AT_TI_return

        POP       {V1, V4, PC}          ; [DPU_V7M3_PIPE] 
	.dwcfi	cfa_offset, 0
	.dwcfi	restore_reg, 7
	.dwcfi	restore_reg, 4
        ; BRANCH OCCURS                  ; [] 
	.dwattr $C$DW$1554, DW_AT_TI_end_file("../main.c")
	.dwattr $C$DW$1554, DW_AT_TI_end_line(0x77)
	.dwattr $C$DW$1554, DW_AT_TI_end_column(0x01)
	.dwendentry
	.dwendtag $C$DW$1554

;******************************************************************************
;* STRINGS                                                                    *
;******************************************************************************
	.sect	".text"
	.align	4
||$C$SL1||:	.string	"cycles = %4d ",10,0
	.align	4
||$C$SL2||:	.string	"mean cycle = %d",10,0
	.align	4
||$C$SL3||:	.string	"%1x",0
	.align	4
||$C$SL4||:	.string	10,0
;******************************************************************************
;* CONSTANT TABLE                                                             *
;******************************************************************************
	.sect	".text"
	.align	4
||$C$CON8||:	.bits	-2444,32
;*****************************************************************************
;* UNDEFINED EXTERNAL REFERENCES                                             *
;*****************************************************************************
	.global	Timer32_getValue
	.global	Timer32_initModule
	.global	Timer32_startTimer
	.global	printf
	.global	__aeabi_llsr
	.global	__aeabi_lasr

;******************************************************************************
;* BUILD ATTRIBUTES                                                           *
;******************************************************************************
	.battr "TI", Tag_File, 1, Tag_LPM_INFO(1)
	.battr "TI", Tag_File, 1, Tag_PORTS_INIT_INFO("012345678901ABCDEFGHIJ01111111111000000000000000000000000000000000")
	.battr "aeabi", Tag_File, 1, Tag_ABI_PCS_wchar_t(2)
	.battr "aeabi", Tag_File, 1, Tag_ABI_FP_rounding(0)
	.battr "aeabi", Tag_File, 1, Tag_ABI_FP_denormal(0)
	.battr "aeabi", Tag_File, 1, Tag_ABI_FP_exceptions(0)
	.battr "aeabi", Tag_File, 1, Tag_ABI_FP_number_model(1)
	.battr "aeabi", Tag_File, 1, Tag_ABI_enum_size(1)
	.battr "aeabi", Tag_File, 1, Tag_ABI_optimization_goals(5)
	.battr "aeabi", Tag_File, 1, Tag_ABI_FP_optimization_goals(0)
	.battr "TI", Tag_File, 1, Tag_Bitfield_layout(0)
	.battr "aeabi", Tag_File, 1, Tag_ABI_VFP_args(3)
	.battr "TI", Tag_File, 1, Tag_FP_interface(1)

;******************************************************************************
;* TYPE INFORMATION                                                           *
;******************************************************************************

$C$DW$T$21	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$21, DW_AT_byte_size(0x10)
$C$DW$1588	.dwtag  DW_TAG_member
	.dwattr $C$DW$1588, DW_AT_type(*$C$DW$T$14)
	.dwattr $C$DW$1588, DW_AT_name("__max_align1")
	.dwattr $C$DW$1588, DW_AT_TI_symbol_name("__max_align1")
	.dwattr $C$DW$1588, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1588, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1588, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.4.LTS/include/sys/_types.h")
	.dwattr $C$DW$1588, DW_AT_decl_line(0x70)
	.dwattr $C$DW$1588, DW_AT_decl_column(0x0c)

$C$DW$1589	.dwtag  DW_TAG_member
	.dwattr $C$DW$1589, DW_AT_type(*$C$DW$T$18)
	.dwattr $C$DW$1589, DW_AT_name("__max_align2")
	.dwattr $C$DW$1589, DW_AT_TI_symbol_name("__max_align2")
	.dwattr $C$DW$1589, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1589, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1589, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.4.LTS/include/sys/_types.h")
	.dwattr $C$DW$1589, DW_AT_decl_line(0x71)
	.dwattr $C$DW$1589, DW_AT_decl_column(0x0e)

	.dwattr $C$DW$T$21, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.4.LTS/include/sys/_types.h")
	.dwattr $C$DW$T$21, DW_AT_decl_line(0x6f)
	.dwattr $C$DW$T$21, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$21

$C$DW$T$205	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$205, DW_AT_name("__max_align_t")
	.dwattr $C$DW$T$205, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$T$205, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$205, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.4.LTS/include/sys/_types.h")
	.dwattr $C$DW$T$205, DW_AT_decl_line(0x72)
	.dwattr $C$DW$T$205, DW_AT_decl_column(0x03)


$C$DW$T$24	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$24, DW_AT_byte_size(0x04)
$C$DW$1590	.dwtag  DW_TAG_member
	.dwattr $C$DW$1590, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1590, DW_AT_name("_reserved0")
	.dwattr $C$DW$1590, DW_AT_TI_symbol_name("_reserved0")
	.dwattr $C$DW$1590, DW_AT_bit_offset(0x10)
	.dwattr $C$DW$1590, DW_AT_bit_size(0x10)
	.dwattr $C$DW$1590, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1590, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1590, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1590, DW_AT_decl_line(0x105)
	.dwattr $C$DW$1590, DW_AT_decl_column(0x0e)

$C$DW$1591	.dwtag  DW_TAG_member
	.dwattr $C$DW$1591, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1591, DW_AT_name("GE")
	.dwattr $C$DW$1591, DW_AT_TI_symbol_name("GE")
	.dwattr $C$DW$1591, DW_AT_bit_offset(0x0c)
	.dwattr $C$DW$1591, DW_AT_bit_size(0x04)
	.dwattr $C$DW$1591, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1591, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1591, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1591, DW_AT_decl_line(0x106)
	.dwattr $C$DW$1591, DW_AT_decl_column(0x0e)

$C$DW$1592	.dwtag  DW_TAG_member
	.dwattr $C$DW$1592, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1592, DW_AT_name("_reserved1")
	.dwattr $C$DW$1592, DW_AT_TI_symbol_name("_reserved1")
	.dwattr $C$DW$1592, DW_AT_bit_offset(0x05)
	.dwattr $C$DW$1592, DW_AT_bit_size(0x07)
	.dwattr $C$DW$1592, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1592, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1592, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1592, DW_AT_decl_line(0x107)
	.dwattr $C$DW$1592, DW_AT_decl_column(0x0e)

$C$DW$1593	.dwtag  DW_TAG_member
	.dwattr $C$DW$1593, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1593, DW_AT_name("Q")
	.dwattr $C$DW$1593, DW_AT_TI_symbol_name("Q")
	.dwattr $C$DW$1593, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$1593, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1593, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1593, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1593, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1593, DW_AT_decl_line(0x108)
	.dwattr $C$DW$1593, DW_AT_decl_column(0x0e)

$C$DW$1594	.dwtag  DW_TAG_member
	.dwattr $C$DW$1594, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1594, DW_AT_name("V")
	.dwattr $C$DW$1594, DW_AT_TI_symbol_name("V")
	.dwattr $C$DW$1594, DW_AT_bit_offset(0x03)
	.dwattr $C$DW$1594, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1594, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1594, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1594, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1594, DW_AT_decl_line(0x109)
	.dwattr $C$DW$1594, DW_AT_decl_column(0x0e)

$C$DW$1595	.dwtag  DW_TAG_member
	.dwattr $C$DW$1595, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1595, DW_AT_name("C")
	.dwattr $C$DW$1595, DW_AT_TI_symbol_name("C")
	.dwattr $C$DW$1595, DW_AT_bit_offset(0x02)
	.dwattr $C$DW$1595, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1595, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1595, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1595, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1595, DW_AT_decl_line(0x10a)
	.dwattr $C$DW$1595, DW_AT_decl_column(0x0e)

$C$DW$1596	.dwtag  DW_TAG_member
	.dwattr $C$DW$1596, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1596, DW_AT_name("Z")
	.dwattr $C$DW$1596, DW_AT_TI_symbol_name("Z")
	.dwattr $C$DW$1596, DW_AT_bit_offset(0x01)
	.dwattr $C$DW$1596, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1596, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1596, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1596, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1596, DW_AT_decl_line(0x10b)
	.dwattr $C$DW$1596, DW_AT_decl_column(0x0e)

$C$DW$1597	.dwtag  DW_TAG_member
	.dwattr $C$DW$1597, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1597, DW_AT_name("N")
	.dwattr $C$DW$1597, DW_AT_TI_symbol_name("N")
	.dwattr $C$DW$1597, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$1597, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1597, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1597, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1597, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1597, DW_AT_decl_line(0x10c)
	.dwattr $C$DW$1597, DW_AT_decl_column(0x0e)

	.dwattr $C$DW$T$24, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$T$24, DW_AT_decl_line(0x104)
	.dwattr $C$DW$T$24, DW_AT_decl_column(0x03)
	.dwendtag $C$DW$T$24


$C$DW$T$25	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$25, DW_AT_byte_size(0x04)
$C$DW$1598	.dwtag  DW_TAG_member
	.dwattr $C$DW$1598, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1598, DW_AT_name("ISR")
	.dwattr $C$DW$1598, DW_AT_TI_symbol_name("ISR")
	.dwattr $C$DW$1598, DW_AT_bit_offset(0x17)
	.dwattr $C$DW$1598, DW_AT_bit_size(0x09)
	.dwattr $C$DW$1598, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1598, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1598, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1598, DW_AT_decl_line(0x12c)
	.dwattr $C$DW$1598, DW_AT_decl_column(0x0e)

$C$DW$1599	.dwtag  DW_TAG_member
	.dwattr $C$DW$1599, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1599, DW_AT_name("_reserved0")
	.dwattr $C$DW$1599, DW_AT_TI_symbol_name("_reserved0")
	.dwattr $C$DW$1599, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$1599, DW_AT_bit_size(0x17)
	.dwattr $C$DW$1599, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1599, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1599, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1599, DW_AT_decl_line(0x12d)
	.dwattr $C$DW$1599, DW_AT_decl_column(0x0e)

	.dwattr $C$DW$T$25, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$T$25, DW_AT_decl_line(0x12b)
	.dwattr $C$DW$T$25, DW_AT_decl_column(0x03)
	.dwendtag $C$DW$T$25


$C$DW$T$26	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$26, DW_AT_byte_size(0x04)
$C$DW$1600	.dwtag  DW_TAG_member
	.dwattr $C$DW$1600, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1600, DW_AT_name("ISR")
	.dwattr $C$DW$1600, DW_AT_TI_symbol_name("ISR")
	.dwattr $C$DW$1600, DW_AT_bit_offset(0x17)
	.dwattr $C$DW$1600, DW_AT_bit_size(0x09)
	.dwattr $C$DW$1600, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1600, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1600, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1600, DW_AT_decl_line(0x13e)
	.dwattr $C$DW$1600, DW_AT_decl_column(0x0e)

$C$DW$1601	.dwtag  DW_TAG_member
	.dwattr $C$DW$1601, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1601, DW_AT_name("_reserved0")
	.dwattr $C$DW$1601, DW_AT_TI_symbol_name("_reserved0")
	.dwattr $C$DW$1601, DW_AT_bit_offset(0x16)
	.dwattr $C$DW$1601, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1601, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1601, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1601, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1601, DW_AT_decl_line(0x13f)
	.dwattr $C$DW$1601, DW_AT_decl_column(0x0e)

$C$DW$1602	.dwtag  DW_TAG_member
	.dwattr $C$DW$1602, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1602, DW_AT_name("ICI_IT_1")
	.dwattr $C$DW$1602, DW_AT_TI_symbol_name("ICI_IT_1")
	.dwattr $C$DW$1602, DW_AT_bit_offset(0x10)
	.dwattr $C$DW$1602, DW_AT_bit_size(0x06)
	.dwattr $C$DW$1602, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1602, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1602, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1602, DW_AT_decl_line(0x140)
	.dwattr $C$DW$1602, DW_AT_decl_column(0x0e)

$C$DW$1603	.dwtag  DW_TAG_member
	.dwattr $C$DW$1603, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1603, DW_AT_name("GE")
	.dwattr $C$DW$1603, DW_AT_TI_symbol_name("GE")
	.dwattr $C$DW$1603, DW_AT_bit_offset(0x0c)
	.dwattr $C$DW$1603, DW_AT_bit_size(0x04)
	.dwattr $C$DW$1603, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1603, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1603, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1603, DW_AT_decl_line(0x141)
	.dwattr $C$DW$1603, DW_AT_decl_column(0x0e)

$C$DW$1604	.dwtag  DW_TAG_member
	.dwattr $C$DW$1604, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1604, DW_AT_name("_reserved1")
	.dwattr $C$DW$1604, DW_AT_TI_symbol_name("_reserved1")
	.dwattr $C$DW$1604, DW_AT_bit_offset(0x08)
	.dwattr $C$DW$1604, DW_AT_bit_size(0x04)
	.dwattr $C$DW$1604, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1604, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1604, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1604, DW_AT_decl_line(0x142)
	.dwattr $C$DW$1604, DW_AT_decl_column(0x0e)

$C$DW$1605	.dwtag  DW_TAG_member
	.dwattr $C$DW$1605, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1605, DW_AT_name("T")
	.dwattr $C$DW$1605, DW_AT_TI_symbol_name("T")
	.dwattr $C$DW$1605, DW_AT_bit_offset(0x07)
	.dwattr $C$DW$1605, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1605, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1605, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1605, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1605, DW_AT_decl_line(0x143)
	.dwattr $C$DW$1605, DW_AT_decl_column(0x0e)

$C$DW$1606	.dwtag  DW_TAG_member
	.dwattr $C$DW$1606, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1606, DW_AT_name("ICI_IT_2")
	.dwattr $C$DW$1606, DW_AT_TI_symbol_name("ICI_IT_2")
	.dwattr $C$DW$1606, DW_AT_bit_offset(0x05)
	.dwattr $C$DW$1606, DW_AT_bit_size(0x02)
	.dwattr $C$DW$1606, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1606, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1606, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1606, DW_AT_decl_line(0x144)
	.dwattr $C$DW$1606, DW_AT_decl_column(0x0e)

$C$DW$1607	.dwtag  DW_TAG_member
	.dwattr $C$DW$1607, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1607, DW_AT_name("Q")
	.dwattr $C$DW$1607, DW_AT_TI_symbol_name("Q")
	.dwattr $C$DW$1607, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$1607, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1607, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1607, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1607, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1607, DW_AT_decl_line(0x145)
	.dwattr $C$DW$1607, DW_AT_decl_column(0x0e)

$C$DW$1608	.dwtag  DW_TAG_member
	.dwattr $C$DW$1608, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1608, DW_AT_name("V")
	.dwattr $C$DW$1608, DW_AT_TI_symbol_name("V")
	.dwattr $C$DW$1608, DW_AT_bit_offset(0x03)
	.dwattr $C$DW$1608, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1608, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1608, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1608, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1608, DW_AT_decl_line(0x146)
	.dwattr $C$DW$1608, DW_AT_decl_column(0x0e)

$C$DW$1609	.dwtag  DW_TAG_member
	.dwattr $C$DW$1609, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1609, DW_AT_name("C")
	.dwattr $C$DW$1609, DW_AT_TI_symbol_name("C")
	.dwattr $C$DW$1609, DW_AT_bit_offset(0x02)
	.dwattr $C$DW$1609, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1609, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1609, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1609, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1609, DW_AT_decl_line(0x147)
	.dwattr $C$DW$1609, DW_AT_decl_column(0x0e)

$C$DW$1610	.dwtag  DW_TAG_member
	.dwattr $C$DW$1610, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1610, DW_AT_name("Z")
	.dwattr $C$DW$1610, DW_AT_TI_symbol_name("Z")
	.dwattr $C$DW$1610, DW_AT_bit_offset(0x01)
	.dwattr $C$DW$1610, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1610, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1610, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1610, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1610, DW_AT_decl_line(0x148)
	.dwattr $C$DW$1610, DW_AT_decl_column(0x0e)

$C$DW$1611	.dwtag  DW_TAG_member
	.dwattr $C$DW$1611, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1611, DW_AT_name("N")
	.dwattr $C$DW$1611, DW_AT_TI_symbol_name("N")
	.dwattr $C$DW$1611, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$1611, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1611, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1611, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1611, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1611, DW_AT_decl_line(0x149)
	.dwattr $C$DW$1611, DW_AT_decl_column(0x0e)

	.dwattr $C$DW$T$26, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$T$26, DW_AT_decl_line(0x13d)
	.dwattr $C$DW$T$26, DW_AT_decl_column(0x03)
	.dwendtag $C$DW$T$26


$C$DW$T$27	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$27, DW_AT_byte_size(0x04)
$C$DW$1612	.dwtag  DW_TAG_member
	.dwattr $C$DW$1612, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1612, DW_AT_name("nPRIV")
	.dwattr $C$DW$1612, DW_AT_TI_symbol_name("nPRIV")
	.dwattr $C$DW$1612, DW_AT_bit_offset(0x1f)
	.dwattr $C$DW$1612, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1612, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1612, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1612, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1612, DW_AT_decl_line(0x175)
	.dwattr $C$DW$1612, DW_AT_decl_column(0x0e)

$C$DW$1613	.dwtag  DW_TAG_member
	.dwattr $C$DW$1613, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1613, DW_AT_name("SPSEL")
	.dwattr $C$DW$1613, DW_AT_TI_symbol_name("SPSEL")
	.dwattr $C$DW$1613, DW_AT_bit_offset(0x1e)
	.dwattr $C$DW$1613, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1613, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1613, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1613, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1613, DW_AT_decl_line(0x176)
	.dwattr $C$DW$1613, DW_AT_decl_column(0x0e)

$C$DW$1614	.dwtag  DW_TAG_member
	.dwattr $C$DW$1614, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1614, DW_AT_name("FPCA")
	.dwattr $C$DW$1614, DW_AT_TI_symbol_name("FPCA")
	.dwattr $C$DW$1614, DW_AT_bit_offset(0x1d)
	.dwattr $C$DW$1614, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1614, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1614, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1614, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1614, DW_AT_decl_line(0x177)
	.dwattr $C$DW$1614, DW_AT_decl_column(0x0e)

$C$DW$1615	.dwtag  DW_TAG_member
	.dwattr $C$DW$1615, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1615, DW_AT_name("_reserved0")
	.dwattr $C$DW$1615, DW_AT_TI_symbol_name("_reserved0")
	.dwattr $C$DW$1615, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$1615, DW_AT_bit_size(0x1d)
	.dwattr $C$DW$1615, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1615, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1615, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1615, DW_AT_decl_line(0x178)
	.dwattr $C$DW$1615, DW_AT_decl_column(0x0e)

	.dwattr $C$DW$T$27, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$T$27, DW_AT_decl_line(0x174)
	.dwattr $C$DW$T$27, DW_AT_decl_column(0x03)
	.dwendtag $C$DW$T$27


$C$DW$T$37	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$37, DW_AT_byte_size(0xe04)
$C$DW$1616	.dwtag  DW_TAG_member
	.dwattr $C$DW$1616, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$1616, DW_AT_name("ISER")
	.dwattr $C$DW$1616, DW_AT_TI_symbol_name("ISER")
	.dwattr $C$DW$1616, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1616, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1616, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1616, DW_AT_decl_line(0x196)
	.dwattr $C$DW$1616, DW_AT_decl_column(0x12)

$C$DW$1617	.dwtag  DW_TAG_member
	.dwattr $C$DW$1617, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$1617, DW_AT_name("RESERVED0")
	.dwattr $C$DW$1617, DW_AT_TI_symbol_name("RESERVED0")
	.dwattr $C$DW$1617, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$1617, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1617, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1617, DW_AT_decl_line(0x197)
	.dwattr $C$DW$1617, DW_AT_decl_column(0x12)

$C$DW$1618	.dwtag  DW_TAG_member
	.dwattr $C$DW$1618, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$1618, DW_AT_name("ICER")
	.dwattr $C$DW$1618, DW_AT_TI_symbol_name("ICER")
	.dwattr $C$DW$1618, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
	.dwattr $C$DW$1618, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1618, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1618, DW_AT_decl_line(0x198)
	.dwattr $C$DW$1618, DW_AT_decl_column(0x12)

$C$DW$1619	.dwtag  DW_TAG_member
	.dwattr $C$DW$1619, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$1619, DW_AT_name("RSERVED1")
	.dwattr $C$DW$1619, DW_AT_TI_symbol_name("RSERVED1")
	.dwattr $C$DW$1619, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
	.dwattr $C$DW$1619, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1619, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1619, DW_AT_decl_line(0x199)
	.dwattr $C$DW$1619, DW_AT_decl_column(0x12)

$C$DW$1620	.dwtag  DW_TAG_member
	.dwattr $C$DW$1620, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$1620, DW_AT_name("ISPR")
	.dwattr $C$DW$1620, DW_AT_TI_symbol_name("ISPR")
	.dwattr $C$DW$1620, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
	.dwattr $C$DW$1620, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1620, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1620, DW_AT_decl_line(0x19a)
	.dwattr $C$DW$1620, DW_AT_decl_column(0x12)

$C$DW$1621	.dwtag  DW_TAG_member
	.dwattr $C$DW$1621, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$1621, DW_AT_name("RESERVED2")
	.dwattr $C$DW$1621, DW_AT_TI_symbol_name("RESERVED2")
	.dwattr $C$DW$1621, DW_AT_data_member_location[DW_OP_plus_uconst 0x120]
	.dwattr $C$DW$1621, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1621, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1621, DW_AT_decl_line(0x19b)
	.dwattr $C$DW$1621, DW_AT_decl_column(0x12)

$C$DW$1622	.dwtag  DW_TAG_member
	.dwattr $C$DW$1622, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$1622, DW_AT_name("ICPR")
	.dwattr $C$DW$1622, DW_AT_TI_symbol_name("ICPR")
	.dwattr $C$DW$1622, DW_AT_data_member_location[DW_OP_plus_uconst 0x180]
	.dwattr $C$DW$1622, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1622, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1622, DW_AT_decl_line(0x19c)
	.dwattr $C$DW$1622, DW_AT_decl_column(0x12)

$C$DW$1623	.dwtag  DW_TAG_member
	.dwattr $C$DW$1623, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$1623, DW_AT_name("RESERVED3")
	.dwattr $C$DW$1623, DW_AT_TI_symbol_name("RESERVED3")
	.dwattr $C$DW$1623, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a0]
	.dwattr $C$DW$1623, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1623, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1623, DW_AT_decl_line(0x19d)
	.dwattr $C$DW$1623, DW_AT_decl_column(0x12)

$C$DW$1624	.dwtag  DW_TAG_member
	.dwattr $C$DW$1624, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$1624, DW_AT_name("IABR")
	.dwattr $C$DW$1624, DW_AT_TI_symbol_name("IABR")
	.dwattr $C$DW$1624, DW_AT_data_member_location[DW_OP_plus_uconst 0x200]
	.dwattr $C$DW$1624, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1624, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1624, DW_AT_decl_line(0x19e)
	.dwattr $C$DW$1624, DW_AT_decl_column(0x12)

$C$DW$1625	.dwtag  DW_TAG_member
	.dwattr $C$DW$1625, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$1625, DW_AT_name("RESERVED4")
	.dwattr $C$DW$1625, DW_AT_TI_symbol_name("RESERVED4")
	.dwattr $C$DW$1625, DW_AT_data_member_location[DW_OP_plus_uconst 0x220]
	.dwattr $C$DW$1625, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1625, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1625, DW_AT_decl_line(0x19f)
	.dwattr $C$DW$1625, DW_AT_decl_column(0x12)

$C$DW$1626	.dwtag  DW_TAG_member
	.dwattr $C$DW$1626, DW_AT_type(*$C$DW$T$35)
	.dwattr $C$DW$1626, DW_AT_name("IP")
	.dwattr $C$DW$1626, DW_AT_TI_symbol_name("IP")
	.dwattr $C$DW$1626, DW_AT_data_member_location[DW_OP_plus_uconst 0x300]
	.dwattr $C$DW$1626, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1626, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1626, DW_AT_decl_line(0x1a0)
	.dwattr $C$DW$1626, DW_AT_decl_column(0x12)

$C$DW$1627	.dwtag  DW_TAG_member
	.dwattr $C$DW$1627, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$1627, DW_AT_name("RESERVED5")
	.dwattr $C$DW$1627, DW_AT_TI_symbol_name("RESERVED5")
	.dwattr $C$DW$1627, DW_AT_data_member_location[DW_OP_plus_uconst 0x3f0]
	.dwattr $C$DW$1627, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1627, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1627, DW_AT_decl_line(0x1a1)
	.dwattr $C$DW$1627, DW_AT_decl_column(0x12)

$C$DW$1628	.dwtag  DW_TAG_member
	.dwattr $C$DW$1628, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1628, DW_AT_name("STIR")
	.dwattr $C$DW$1628, DW_AT_TI_symbol_name("STIR")
	.dwattr $C$DW$1628, DW_AT_data_member_location[DW_OP_plus_uconst 0xe00]
	.dwattr $C$DW$1628, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1628, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1628, DW_AT_decl_line(0x1a2)
	.dwattr $C$DW$1628, DW_AT_decl_column(0x12)

	.dwattr $C$DW$T$37, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$T$37, DW_AT_decl_line(0x195)
	.dwattr $C$DW$T$37, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$37

$C$DW$T$206	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$206, DW_AT_name("NVIC_Type")
	.dwattr $C$DW$T$206, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$T$206, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$206, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$T$206, DW_AT_decl_line(0x1a3)
	.dwattr $C$DW$T$206, DW_AT_decl_column(0x04)


$C$DW$T$44	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$44, DW_AT_byte_size(0x8c)
$C$DW$1629	.dwtag  DW_TAG_member
	.dwattr $C$DW$1629, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$1629, DW_AT_name("CPUID")
	.dwattr $C$DW$1629, DW_AT_TI_symbol_name("CPUID")
	.dwattr $C$DW$1629, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1629, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1629, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1629, DW_AT_decl_line(0x1b8)
	.dwattr $C$DW$1629, DW_AT_decl_column(0x12)

$C$DW$1630	.dwtag  DW_TAG_member
	.dwattr $C$DW$1630, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1630, DW_AT_name("ICSR")
	.dwattr $C$DW$1630, DW_AT_TI_symbol_name("ICSR")
	.dwattr $C$DW$1630, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1630, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1630, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1630, DW_AT_decl_line(0x1b9)
	.dwattr $C$DW$1630, DW_AT_decl_column(0x12)

$C$DW$1631	.dwtag  DW_TAG_member
	.dwattr $C$DW$1631, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1631, DW_AT_name("VTOR")
	.dwattr $C$DW$1631, DW_AT_TI_symbol_name("VTOR")
	.dwattr $C$DW$1631, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1631, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1631, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1631, DW_AT_decl_line(0x1ba)
	.dwattr $C$DW$1631, DW_AT_decl_column(0x12)

$C$DW$1632	.dwtag  DW_TAG_member
	.dwattr $C$DW$1632, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1632, DW_AT_name("AIRCR")
	.dwattr $C$DW$1632, DW_AT_TI_symbol_name("AIRCR")
	.dwattr $C$DW$1632, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1632, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1632, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1632, DW_AT_decl_line(0x1bb)
	.dwattr $C$DW$1632, DW_AT_decl_column(0x12)

$C$DW$1633	.dwtag  DW_TAG_member
	.dwattr $C$DW$1633, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1633, DW_AT_name("SCR")
	.dwattr $C$DW$1633, DW_AT_TI_symbol_name("SCR")
	.dwattr $C$DW$1633, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1633, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1633, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1633, DW_AT_decl_line(0x1bc)
	.dwattr $C$DW$1633, DW_AT_decl_column(0x12)

$C$DW$1634	.dwtag  DW_TAG_member
	.dwattr $C$DW$1634, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1634, DW_AT_name("CCR")
	.dwattr $C$DW$1634, DW_AT_TI_symbol_name("CCR")
	.dwattr $C$DW$1634, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$1634, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1634, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1634, DW_AT_decl_line(0x1bd)
	.dwattr $C$DW$1634, DW_AT_decl_column(0x12)

$C$DW$1635	.dwtag  DW_TAG_member
	.dwattr $C$DW$1635, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$1635, DW_AT_name("SHP")
	.dwattr $C$DW$1635, DW_AT_TI_symbol_name("SHP")
	.dwattr $C$DW$1635, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$1635, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1635, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1635, DW_AT_decl_line(0x1be)
	.dwattr $C$DW$1635, DW_AT_decl_column(0x12)

$C$DW$1636	.dwtag  DW_TAG_member
	.dwattr $C$DW$1636, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1636, DW_AT_name("SHCSR")
	.dwattr $C$DW$1636, DW_AT_TI_symbol_name("SHCSR")
	.dwattr $C$DW$1636, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$1636, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1636, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1636, DW_AT_decl_line(0x1bf)
	.dwattr $C$DW$1636, DW_AT_decl_column(0x12)

$C$DW$1637	.dwtag  DW_TAG_member
	.dwattr $C$DW$1637, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1637, DW_AT_name("CFSR")
	.dwattr $C$DW$1637, DW_AT_TI_symbol_name("CFSR")
	.dwattr $C$DW$1637, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$1637, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1637, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1637, DW_AT_decl_line(0x1c0)
	.dwattr $C$DW$1637, DW_AT_decl_column(0x12)

$C$DW$1638	.dwtag  DW_TAG_member
	.dwattr $C$DW$1638, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1638, DW_AT_name("HFSR")
	.dwattr $C$DW$1638, DW_AT_TI_symbol_name("HFSR")
	.dwattr $C$DW$1638, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$1638, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1638, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1638, DW_AT_decl_line(0x1c1)
	.dwattr $C$DW$1638, DW_AT_decl_column(0x12)

$C$DW$1639	.dwtag  DW_TAG_member
	.dwattr $C$DW$1639, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1639, DW_AT_name("DFSR")
	.dwattr $C$DW$1639, DW_AT_TI_symbol_name("DFSR")
	.dwattr $C$DW$1639, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr $C$DW$1639, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1639, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1639, DW_AT_decl_line(0x1c2)
	.dwattr $C$DW$1639, DW_AT_decl_column(0x12)

$C$DW$1640	.dwtag  DW_TAG_member
	.dwattr $C$DW$1640, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1640, DW_AT_name("MMFAR")
	.dwattr $C$DW$1640, DW_AT_TI_symbol_name("MMFAR")
	.dwattr $C$DW$1640, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr $C$DW$1640, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1640, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1640, DW_AT_decl_line(0x1c3)
	.dwattr $C$DW$1640, DW_AT_decl_column(0x12)

$C$DW$1641	.dwtag  DW_TAG_member
	.dwattr $C$DW$1641, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1641, DW_AT_name("BFAR")
	.dwattr $C$DW$1641, DW_AT_TI_symbol_name("BFAR")
	.dwattr $C$DW$1641, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr $C$DW$1641, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1641, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1641, DW_AT_decl_line(0x1c4)
	.dwattr $C$DW$1641, DW_AT_decl_column(0x12)

$C$DW$1642	.dwtag  DW_TAG_member
	.dwattr $C$DW$1642, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1642, DW_AT_name("AFSR")
	.dwattr $C$DW$1642, DW_AT_TI_symbol_name("AFSR")
	.dwattr $C$DW$1642, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
	.dwattr $C$DW$1642, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1642, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1642, DW_AT_decl_line(0x1c5)
	.dwattr $C$DW$1642, DW_AT_decl_column(0x12)

$C$DW$1643	.dwtag  DW_TAG_member
	.dwattr $C$DW$1643, DW_AT_type(*$C$DW$T$40)
	.dwattr $C$DW$1643, DW_AT_name("PFR")
	.dwattr $C$DW$1643, DW_AT_TI_symbol_name("PFR")
	.dwattr $C$DW$1643, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
	.dwattr $C$DW$1643, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1643, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1643, DW_AT_decl_line(0x1c6)
	.dwattr $C$DW$1643, DW_AT_decl_column(0x12)

$C$DW$1644	.dwtag  DW_TAG_member
	.dwattr $C$DW$1644, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$1644, DW_AT_name("DFR")
	.dwattr $C$DW$1644, DW_AT_TI_symbol_name("DFR")
	.dwattr $C$DW$1644, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
	.dwattr $C$DW$1644, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1644, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1644, DW_AT_decl_line(0x1c7)
	.dwattr $C$DW$1644, DW_AT_decl_column(0x12)

$C$DW$1645	.dwtag  DW_TAG_member
	.dwattr $C$DW$1645, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$1645, DW_AT_name("ADR")
	.dwattr $C$DW$1645, DW_AT_TI_symbol_name("ADR")
	.dwattr $C$DW$1645, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
	.dwattr $C$DW$1645, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1645, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1645, DW_AT_decl_line(0x1c8)
	.dwattr $C$DW$1645, DW_AT_decl_column(0x12)

$C$DW$1646	.dwtag  DW_TAG_member
	.dwattr $C$DW$1646, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$1646, DW_AT_name("MMFR")
	.dwattr $C$DW$1646, DW_AT_TI_symbol_name("MMFR")
	.dwattr $C$DW$1646, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
	.dwattr $C$DW$1646, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1646, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1646, DW_AT_decl_line(0x1c9)
	.dwattr $C$DW$1646, DW_AT_decl_column(0x12)

$C$DW$1647	.dwtag  DW_TAG_member
	.dwattr $C$DW$1647, DW_AT_type(*$C$DW$T$42)
	.dwattr $C$DW$1647, DW_AT_name("ISAR")
	.dwattr $C$DW$1647, DW_AT_TI_symbol_name("ISAR")
	.dwattr $C$DW$1647, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
	.dwattr $C$DW$1647, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1647, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1647, DW_AT_decl_line(0x1ca)
	.dwattr $C$DW$1647, DW_AT_decl_column(0x12)

$C$DW$1648	.dwtag  DW_TAG_member
	.dwattr $C$DW$1648, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$1648, DW_AT_name("RESERVED0")
	.dwattr $C$DW$1648, DW_AT_TI_symbol_name("RESERVED0")
	.dwattr $C$DW$1648, DW_AT_data_member_location[DW_OP_plus_uconst 0x74]
	.dwattr $C$DW$1648, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1648, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1648, DW_AT_decl_line(0x1cb)
	.dwattr $C$DW$1648, DW_AT_decl_column(0x12)

$C$DW$1649	.dwtag  DW_TAG_member
	.dwattr $C$DW$1649, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1649, DW_AT_name("CPACR")
	.dwattr $C$DW$1649, DW_AT_TI_symbol_name("CPACR")
	.dwattr $C$DW$1649, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
	.dwattr $C$DW$1649, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1649, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1649, DW_AT_decl_line(0x1cc)
	.dwattr $C$DW$1649, DW_AT_decl_column(0x12)

	.dwattr $C$DW$T$44, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$T$44, DW_AT_decl_line(0x1b7)
	.dwattr $C$DW$T$44, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$44

$C$DW$T$207	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$207, DW_AT_name("SCB_Type")
	.dwattr $C$DW$T$207, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$T$207, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$207, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$T$207, DW_AT_decl_line(0x1cd)
	.dwattr $C$DW$T$207, DW_AT_decl_column(0x03)


$C$DW$T$46	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$46, DW_AT_byte_size(0x0c)
$C$DW$1650	.dwtag  DW_TAG_member
	.dwattr $C$DW$1650, DW_AT_type(*$C$DW$T$45)
	.dwattr $C$DW$1650, DW_AT_name("RESERVED0")
	.dwattr $C$DW$1650, DW_AT_TI_symbol_name("RESERVED0")
	.dwattr $C$DW$1650, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1650, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1650, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1650, DW_AT_decl_line(0x2cf)
	.dwattr $C$DW$1650, DW_AT_decl_column(0x12)

$C$DW$1651	.dwtag  DW_TAG_member
	.dwattr $C$DW$1651, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$1651, DW_AT_name("ICTR")
	.dwattr $C$DW$1651, DW_AT_TI_symbol_name("ICTR")
	.dwattr $C$DW$1651, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1651, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1651, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1651, DW_AT_decl_line(0x2d0)
	.dwattr $C$DW$1651, DW_AT_decl_column(0x12)

$C$DW$1652	.dwtag  DW_TAG_member
	.dwattr $C$DW$1652, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1652, DW_AT_name("ACTLR")
	.dwattr $C$DW$1652, DW_AT_TI_symbol_name("ACTLR")
	.dwattr $C$DW$1652, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1652, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1652, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1652, DW_AT_decl_line(0x2d1)
	.dwattr $C$DW$1652, DW_AT_decl_column(0x12)

	.dwattr $C$DW$T$46, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$T$46, DW_AT_decl_line(0x2ce)
	.dwattr $C$DW$T$46, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$46

$C$DW$T$208	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$208, DW_AT_name("SCnSCB_Type")
	.dwattr $C$DW$T$208, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$T$208, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$208, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$T$208, DW_AT_decl_line(0x2d2)
	.dwattr $C$DW$T$208, DW_AT_decl_column(0x03)


$C$DW$T$47	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$47, DW_AT_byte_size(0x10)
$C$DW$1653	.dwtag  DW_TAG_member
	.dwattr $C$DW$1653, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1653, DW_AT_name("CTRL")
	.dwattr $C$DW$1653, DW_AT_TI_symbol_name("CTRL")
	.dwattr $C$DW$1653, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1653, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1653, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1653, DW_AT_decl_line(0x2f7)
	.dwattr $C$DW$1653, DW_AT_decl_column(0x12)

$C$DW$1654	.dwtag  DW_TAG_member
	.dwattr $C$DW$1654, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1654, DW_AT_name("LOAD")
	.dwattr $C$DW$1654, DW_AT_TI_symbol_name("LOAD")
	.dwattr $C$DW$1654, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1654, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1654, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1654, DW_AT_decl_line(0x2f8)
	.dwattr $C$DW$1654, DW_AT_decl_column(0x12)

$C$DW$1655	.dwtag  DW_TAG_member
	.dwattr $C$DW$1655, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1655, DW_AT_name("VAL")
	.dwattr $C$DW$1655, DW_AT_TI_symbol_name("VAL")
	.dwattr $C$DW$1655, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1655, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1655, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1655, DW_AT_decl_line(0x2f9)
	.dwattr $C$DW$1655, DW_AT_decl_column(0x12)

$C$DW$1656	.dwtag  DW_TAG_member
	.dwattr $C$DW$1656, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$1656, DW_AT_name("CALIB")
	.dwattr $C$DW$1656, DW_AT_TI_symbol_name("CALIB")
	.dwattr $C$DW$1656, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1656, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1656, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1656, DW_AT_decl_line(0x2fa)
	.dwattr $C$DW$1656, DW_AT_decl_column(0x12)

	.dwattr $C$DW$T$47, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$T$47, DW_AT_decl_line(0x2f6)
	.dwattr $C$DW$T$47, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$47

$C$DW$T$209	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$209, DW_AT_name("SysTick_Type")
	.dwattr $C$DW$T$209, DW_AT_type(*$C$DW$T$47)
	.dwattr $C$DW$T$209, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$209, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$T$209, DW_AT_decl_line(0x2fb)
	.dwattr $C$DW$T$209, DW_AT_decl_column(0x03)


$C$DW$T$55	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$55, DW_AT_byte_size(0x1000)
$C$DW$1657	.dwtag  DW_TAG_member
	.dwattr $C$DW$1657, DW_AT_type(*$C$DW$T$49)
	.dwattr $C$DW$1657, DW_AT_name("PORT")
	.dwattr $C$DW$1657, DW_AT_TI_symbol_name("PORT")
	.dwattr $C$DW$1657, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1657, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1657, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1657, DW_AT_decl_line(0x330)
	.dwattr $C$DW$1657, DW_AT_decl_column(0x06)

$C$DW$1658	.dwtag  DW_TAG_member
	.dwattr $C$DW$1658, DW_AT_type(*$C$DW$T$50)
	.dwattr $C$DW$1658, DW_AT_name("RESERVED0")
	.dwattr $C$DW$1658, DW_AT_TI_symbol_name("RESERVED0")
	.dwattr $C$DW$1658, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
	.dwattr $C$DW$1658, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1658, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1658, DW_AT_decl_line(0x331)
	.dwattr $C$DW$1658, DW_AT_decl_column(0x12)

$C$DW$1659	.dwtag  DW_TAG_member
	.dwattr $C$DW$1659, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1659, DW_AT_name("TER")
	.dwattr $C$DW$1659, DW_AT_TI_symbol_name("TER")
	.dwattr $C$DW$1659, DW_AT_data_member_location[DW_OP_plus_uconst 0xe00]
	.dwattr $C$DW$1659, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1659, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1659, DW_AT_decl_line(0x332)
	.dwattr $C$DW$1659, DW_AT_decl_column(0x12)

$C$DW$1660	.dwtag  DW_TAG_member
	.dwattr $C$DW$1660, DW_AT_type(*$C$DW$T$51)
	.dwattr $C$DW$1660, DW_AT_name("RESERVED1")
	.dwattr $C$DW$1660, DW_AT_TI_symbol_name("RESERVED1")
	.dwattr $C$DW$1660, DW_AT_data_member_location[DW_OP_plus_uconst 0xe04]
	.dwattr $C$DW$1660, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1660, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1660, DW_AT_decl_line(0x333)
	.dwattr $C$DW$1660, DW_AT_decl_column(0x12)

$C$DW$1661	.dwtag  DW_TAG_member
	.dwattr $C$DW$1661, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1661, DW_AT_name("TPR")
	.dwattr $C$DW$1661, DW_AT_TI_symbol_name("TPR")
	.dwattr $C$DW$1661, DW_AT_data_member_location[DW_OP_plus_uconst 0xe40]
	.dwattr $C$DW$1661, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1661, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1661, DW_AT_decl_line(0x334)
	.dwattr $C$DW$1661, DW_AT_decl_column(0x12)

$C$DW$1662	.dwtag  DW_TAG_member
	.dwattr $C$DW$1662, DW_AT_type(*$C$DW$T$51)
	.dwattr $C$DW$1662, DW_AT_name("RESERVED2")
	.dwattr $C$DW$1662, DW_AT_TI_symbol_name("RESERVED2")
	.dwattr $C$DW$1662, DW_AT_data_member_location[DW_OP_plus_uconst 0xe44]
	.dwattr $C$DW$1662, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1662, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1662, DW_AT_decl_line(0x335)
	.dwattr $C$DW$1662, DW_AT_decl_column(0x12)

$C$DW$1663	.dwtag  DW_TAG_member
	.dwattr $C$DW$1663, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1663, DW_AT_name("TCR")
	.dwattr $C$DW$1663, DW_AT_TI_symbol_name("TCR")
	.dwattr $C$DW$1663, DW_AT_data_member_location[DW_OP_plus_uconst 0xe80]
	.dwattr $C$DW$1663, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1663, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1663, DW_AT_decl_line(0x336)
	.dwattr $C$DW$1663, DW_AT_decl_column(0x12)

$C$DW$1664	.dwtag  DW_TAG_member
	.dwattr $C$DW$1664, DW_AT_type(*$C$DW$T$52)
	.dwattr $C$DW$1664, DW_AT_name("RESERVED3")
	.dwattr $C$DW$1664, DW_AT_TI_symbol_name("RESERVED3")
	.dwattr $C$DW$1664, DW_AT_data_member_location[DW_OP_plus_uconst 0xe84]
	.dwattr $C$DW$1664, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1664, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1664, DW_AT_decl_line(0x337)
	.dwattr $C$DW$1664, DW_AT_decl_column(0x12)

$C$DW$1665	.dwtag  DW_TAG_member
	.dwattr $C$DW$1665, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1665, DW_AT_name("IWR")
	.dwattr $C$DW$1665, DW_AT_TI_symbol_name("IWR")
	.dwattr $C$DW$1665, DW_AT_data_member_location[DW_OP_plus_uconst 0xef8]
	.dwattr $C$DW$1665, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1665, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1665, DW_AT_decl_line(0x338)
	.dwattr $C$DW$1665, DW_AT_decl_column(0x12)

$C$DW$1666	.dwtag  DW_TAG_member
	.dwattr $C$DW$1666, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$1666, DW_AT_name("IRR")
	.dwattr $C$DW$1666, DW_AT_TI_symbol_name("IRR")
	.dwattr $C$DW$1666, DW_AT_data_member_location[DW_OP_plus_uconst 0xefc]
	.dwattr $C$DW$1666, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1666, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1666, DW_AT_decl_line(0x339)
	.dwattr $C$DW$1666, DW_AT_decl_column(0x12)

$C$DW$1667	.dwtag  DW_TAG_member
	.dwattr $C$DW$1667, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1667, DW_AT_name("IMCR")
	.dwattr $C$DW$1667, DW_AT_TI_symbol_name("IMCR")
	.dwattr $C$DW$1667, DW_AT_data_member_location[DW_OP_plus_uconst 0xf00]
	.dwattr $C$DW$1667, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1667, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1667, DW_AT_decl_line(0x33a)
	.dwattr $C$DW$1667, DW_AT_decl_column(0x12)

$C$DW$1668	.dwtag  DW_TAG_member
	.dwattr $C$DW$1668, DW_AT_type(*$C$DW$T$53)
	.dwattr $C$DW$1668, DW_AT_name("RESERVED4")
	.dwattr $C$DW$1668, DW_AT_TI_symbol_name("RESERVED4")
	.dwattr $C$DW$1668, DW_AT_data_member_location[DW_OP_plus_uconst 0xf04]
	.dwattr $C$DW$1668, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1668, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1668, DW_AT_decl_line(0x33b)
	.dwattr $C$DW$1668, DW_AT_decl_column(0x12)

$C$DW$1669	.dwtag  DW_TAG_member
	.dwattr $C$DW$1669, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1669, DW_AT_name("LAR")
	.dwattr $C$DW$1669, DW_AT_TI_symbol_name("LAR")
	.dwattr $C$DW$1669, DW_AT_data_member_location[DW_OP_plus_uconst 0xfb0]
	.dwattr $C$DW$1669, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1669, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1669, DW_AT_decl_line(0x33c)
	.dwattr $C$DW$1669, DW_AT_decl_column(0x12)

$C$DW$1670	.dwtag  DW_TAG_member
	.dwattr $C$DW$1670, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$1670, DW_AT_name("LSR")
	.dwattr $C$DW$1670, DW_AT_TI_symbol_name("LSR")
	.dwattr $C$DW$1670, DW_AT_data_member_location[DW_OP_plus_uconst 0xfb4]
	.dwattr $C$DW$1670, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1670, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1670, DW_AT_decl_line(0x33d)
	.dwattr $C$DW$1670, DW_AT_decl_column(0x12)

$C$DW$1671	.dwtag  DW_TAG_member
	.dwattr $C$DW$1671, DW_AT_type(*$C$DW$T$54)
	.dwattr $C$DW$1671, DW_AT_name("RESERVED5")
	.dwattr $C$DW$1671, DW_AT_TI_symbol_name("RESERVED5")
	.dwattr $C$DW$1671, DW_AT_data_member_location[DW_OP_plus_uconst 0xfb8]
	.dwattr $C$DW$1671, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1671, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1671, DW_AT_decl_line(0x33e)
	.dwattr $C$DW$1671, DW_AT_decl_column(0x12)

$C$DW$1672	.dwtag  DW_TAG_member
	.dwattr $C$DW$1672, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$1672, DW_AT_name("PID4")
	.dwattr $C$DW$1672, DW_AT_TI_symbol_name("PID4")
	.dwattr $C$DW$1672, DW_AT_data_member_location[DW_OP_plus_uconst 0xfd0]
	.dwattr $C$DW$1672, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1672, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1672, DW_AT_decl_line(0x33f)
	.dwattr $C$DW$1672, DW_AT_decl_column(0x12)

$C$DW$1673	.dwtag  DW_TAG_member
	.dwattr $C$DW$1673, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$1673, DW_AT_name("PID5")
	.dwattr $C$DW$1673, DW_AT_TI_symbol_name("PID5")
	.dwattr $C$DW$1673, DW_AT_data_member_location[DW_OP_plus_uconst 0xfd4]
	.dwattr $C$DW$1673, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1673, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1673, DW_AT_decl_line(0x340)
	.dwattr $C$DW$1673, DW_AT_decl_column(0x12)

$C$DW$1674	.dwtag  DW_TAG_member
	.dwattr $C$DW$1674, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$1674, DW_AT_name("PID6")
	.dwattr $C$DW$1674, DW_AT_TI_symbol_name("PID6")
	.dwattr $C$DW$1674, DW_AT_data_member_location[DW_OP_plus_uconst 0xfd8]
	.dwattr $C$DW$1674, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1674, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1674, DW_AT_decl_line(0x341)
	.dwattr $C$DW$1674, DW_AT_decl_column(0x12)

$C$DW$1675	.dwtag  DW_TAG_member
	.dwattr $C$DW$1675, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$1675, DW_AT_name("PID7")
	.dwattr $C$DW$1675, DW_AT_TI_symbol_name("PID7")
	.dwattr $C$DW$1675, DW_AT_data_member_location[DW_OP_plus_uconst 0xfdc]
	.dwattr $C$DW$1675, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1675, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1675, DW_AT_decl_line(0x342)
	.dwattr $C$DW$1675, DW_AT_decl_column(0x12)

$C$DW$1676	.dwtag  DW_TAG_member
	.dwattr $C$DW$1676, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$1676, DW_AT_name("PID0")
	.dwattr $C$DW$1676, DW_AT_TI_symbol_name("PID0")
	.dwattr $C$DW$1676, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe0]
	.dwattr $C$DW$1676, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1676, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1676, DW_AT_decl_line(0x343)
	.dwattr $C$DW$1676, DW_AT_decl_column(0x12)

$C$DW$1677	.dwtag  DW_TAG_member
	.dwattr $C$DW$1677, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$1677, DW_AT_name("PID1")
	.dwattr $C$DW$1677, DW_AT_TI_symbol_name("PID1")
	.dwattr $C$DW$1677, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe4]
	.dwattr $C$DW$1677, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1677, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1677, DW_AT_decl_line(0x344)
	.dwattr $C$DW$1677, DW_AT_decl_column(0x12)

$C$DW$1678	.dwtag  DW_TAG_member
	.dwattr $C$DW$1678, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$1678, DW_AT_name("PID2")
	.dwattr $C$DW$1678, DW_AT_TI_symbol_name("PID2")
	.dwattr $C$DW$1678, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe8]
	.dwattr $C$DW$1678, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1678, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1678, DW_AT_decl_line(0x345)
	.dwattr $C$DW$1678, DW_AT_decl_column(0x12)

$C$DW$1679	.dwtag  DW_TAG_member
	.dwattr $C$DW$1679, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$1679, DW_AT_name("PID3")
	.dwattr $C$DW$1679, DW_AT_TI_symbol_name("PID3")
	.dwattr $C$DW$1679, DW_AT_data_member_location[DW_OP_plus_uconst 0xfec]
	.dwattr $C$DW$1679, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1679, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1679, DW_AT_decl_line(0x346)
	.dwattr $C$DW$1679, DW_AT_decl_column(0x12)

$C$DW$1680	.dwtag  DW_TAG_member
	.dwattr $C$DW$1680, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$1680, DW_AT_name("CID0")
	.dwattr $C$DW$1680, DW_AT_TI_symbol_name("CID0")
	.dwattr $C$DW$1680, DW_AT_data_member_location[DW_OP_plus_uconst 0xff0]
	.dwattr $C$DW$1680, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1680, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1680, DW_AT_decl_line(0x347)
	.dwattr $C$DW$1680, DW_AT_decl_column(0x12)

$C$DW$1681	.dwtag  DW_TAG_member
	.dwattr $C$DW$1681, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$1681, DW_AT_name("CID1")
	.dwattr $C$DW$1681, DW_AT_TI_symbol_name("CID1")
	.dwattr $C$DW$1681, DW_AT_data_member_location[DW_OP_plus_uconst 0xff4]
	.dwattr $C$DW$1681, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1681, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1681, DW_AT_decl_line(0x348)
	.dwattr $C$DW$1681, DW_AT_decl_column(0x12)

$C$DW$1682	.dwtag  DW_TAG_member
	.dwattr $C$DW$1682, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$1682, DW_AT_name("CID2")
	.dwattr $C$DW$1682, DW_AT_TI_symbol_name("CID2")
	.dwattr $C$DW$1682, DW_AT_data_member_location[DW_OP_plus_uconst 0xff8]
	.dwattr $C$DW$1682, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1682, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1682, DW_AT_decl_line(0x349)
	.dwattr $C$DW$1682, DW_AT_decl_column(0x12)

$C$DW$1683	.dwtag  DW_TAG_member
	.dwattr $C$DW$1683, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$1683, DW_AT_name("CID3")
	.dwattr $C$DW$1683, DW_AT_TI_symbol_name("CID3")
	.dwattr $C$DW$1683, DW_AT_data_member_location[DW_OP_plus_uconst 0xffc]
	.dwattr $C$DW$1683, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1683, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1683, DW_AT_decl_line(0x34a)
	.dwattr $C$DW$1683, DW_AT_decl_column(0x12)

	.dwattr $C$DW$T$55, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$T$55, DW_AT_decl_line(0x32a)
	.dwattr $C$DW$T$55, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$55

$C$DW$T$210	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$210, DW_AT_name("ITM_Type")
	.dwattr $C$DW$T$210, DW_AT_type(*$C$DW$T$55)
	.dwattr $C$DW$T$210, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$210, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$T$210, DW_AT_decl_line(0x34b)
	.dwattr $C$DW$T$210, DW_AT_decl_column(0x03)


$C$DW$T$56	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$56, DW_AT_byte_size(0x5c)
$C$DW$1684	.dwtag  DW_TAG_member
	.dwattr $C$DW$1684, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1684, DW_AT_name("CTRL")
	.dwattr $C$DW$1684, DW_AT_TI_symbol_name("CTRL")
	.dwattr $C$DW$1684, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1684, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1684, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1684, DW_AT_decl_line(0x392)
	.dwattr $C$DW$1684, DW_AT_decl_column(0x12)

$C$DW$1685	.dwtag  DW_TAG_member
	.dwattr $C$DW$1685, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1685, DW_AT_name("CYCCNT")
	.dwattr $C$DW$1685, DW_AT_TI_symbol_name("CYCCNT")
	.dwattr $C$DW$1685, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1685, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1685, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1685, DW_AT_decl_line(0x393)
	.dwattr $C$DW$1685, DW_AT_decl_column(0x12)

$C$DW$1686	.dwtag  DW_TAG_member
	.dwattr $C$DW$1686, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1686, DW_AT_name("CPICNT")
	.dwattr $C$DW$1686, DW_AT_TI_symbol_name("CPICNT")
	.dwattr $C$DW$1686, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1686, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1686, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1686, DW_AT_decl_line(0x394)
	.dwattr $C$DW$1686, DW_AT_decl_column(0x12)

$C$DW$1687	.dwtag  DW_TAG_member
	.dwattr $C$DW$1687, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1687, DW_AT_name("EXCCNT")
	.dwattr $C$DW$1687, DW_AT_TI_symbol_name("EXCCNT")
	.dwattr $C$DW$1687, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1687, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1687, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1687, DW_AT_decl_line(0x395)
	.dwattr $C$DW$1687, DW_AT_decl_column(0x12)

$C$DW$1688	.dwtag  DW_TAG_member
	.dwattr $C$DW$1688, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1688, DW_AT_name("SLEEPCNT")
	.dwattr $C$DW$1688, DW_AT_TI_symbol_name("SLEEPCNT")
	.dwattr $C$DW$1688, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1688, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1688, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1688, DW_AT_decl_line(0x396)
	.dwattr $C$DW$1688, DW_AT_decl_column(0x12)

$C$DW$1689	.dwtag  DW_TAG_member
	.dwattr $C$DW$1689, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1689, DW_AT_name("LSUCNT")
	.dwattr $C$DW$1689, DW_AT_TI_symbol_name("LSUCNT")
	.dwattr $C$DW$1689, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$1689, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1689, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1689, DW_AT_decl_line(0x397)
	.dwattr $C$DW$1689, DW_AT_decl_column(0x12)

$C$DW$1690	.dwtag  DW_TAG_member
	.dwattr $C$DW$1690, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1690, DW_AT_name("FOLDCNT")
	.dwattr $C$DW$1690, DW_AT_TI_symbol_name("FOLDCNT")
	.dwattr $C$DW$1690, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$1690, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1690, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1690, DW_AT_decl_line(0x398)
	.dwattr $C$DW$1690, DW_AT_decl_column(0x12)

$C$DW$1691	.dwtag  DW_TAG_member
	.dwattr $C$DW$1691, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$1691, DW_AT_name("PCSR")
	.dwattr $C$DW$1691, DW_AT_TI_symbol_name("PCSR")
	.dwattr $C$DW$1691, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$1691, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1691, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1691, DW_AT_decl_line(0x399)
	.dwattr $C$DW$1691, DW_AT_decl_column(0x12)

$C$DW$1692	.dwtag  DW_TAG_member
	.dwattr $C$DW$1692, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1692, DW_AT_name("COMP0")
	.dwattr $C$DW$1692, DW_AT_TI_symbol_name("COMP0")
	.dwattr $C$DW$1692, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$1692, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1692, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1692, DW_AT_decl_line(0x39a)
	.dwattr $C$DW$1692, DW_AT_decl_column(0x12)

$C$DW$1693	.dwtag  DW_TAG_member
	.dwattr $C$DW$1693, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1693, DW_AT_name("MASK0")
	.dwattr $C$DW$1693, DW_AT_TI_symbol_name("MASK0")
	.dwattr $C$DW$1693, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$1693, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1693, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1693, DW_AT_decl_line(0x39b)
	.dwattr $C$DW$1693, DW_AT_decl_column(0x12)

$C$DW$1694	.dwtag  DW_TAG_member
	.dwattr $C$DW$1694, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1694, DW_AT_name("FUNCTION0")
	.dwattr $C$DW$1694, DW_AT_TI_symbol_name("FUNCTION0")
	.dwattr $C$DW$1694, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$1694, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1694, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1694, DW_AT_decl_line(0x39c)
	.dwattr $C$DW$1694, DW_AT_decl_column(0x12)

$C$DW$1695	.dwtag  DW_TAG_member
	.dwattr $C$DW$1695, DW_AT_type(*$C$DW$T$45)
	.dwattr $C$DW$1695, DW_AT_name("RESERVED0")
	.dwattr $C$DW$1695, DW_AT_TI_symbol_name("RESERVED0")
	.dwattr $C$DW$1695, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$1695, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1695, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1695, DW_AT_decl_line(0x39d)
	.dwattr $C$DW$1695, DW_AT_decl_column(0x12)

$C$DW$1696	.dwtag  DW_TAG_member
	.dwattr $C$DW$1696, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1696, DW_AT_name("COMP1")
	.dwattr $C$DW$1696, DW_AT_TI_symbol_name("COMP1")
	.dwattr $C$DW$1696, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr $C$DW$1696, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1696, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1696, DW_AT_decl_line(0x39e)
	.dwattr $C$DW$1696, DW_AT_decl_column(0x12)

$C$DW$1697	.dwtag  DW_TAG_member
	.dwattr $C$DW$1697, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1697, DW_AT_name("MASK1")
	.dwattr $C$DW$1697, DW_AT_TI_symbol_name("MASK1")
	.dwattr $C$DW$1697, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr $C$DW$1697, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1697, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1697, DW_AT_decl_line(0x39f)
	.dwattr $C$DW$1697, DW_AT_decl_column(0x12)

$C$DW$1698	.dwtag  DW_TAG_member
	.dwattr $C$DW$1698, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1698, DW_AT_name("FUNCTION1")
	.dwattr $C$DW$1698, DW_AT_TI_symbol_name("FUNCTION1")
	.dwattr $C$DW$1698, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr $C$DW$1698, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1698, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1698, DW_AT_decl_line(0x3a0)
	.dwattr $C$DW$1698, DW_AT_decl_column(0x12)

$C$DW$1699	.dwtag  DW_TAG_member
	.dwattr $C$DW$1699, DW_AT_type(*$C$DW$T$45)
	.dwattr $C$DW$1699, DW_AT_name("RESERVED1")
	.dwattr $C$DW$1699, DW_AT_TI_symbol_name("RESERVED1")
	.dwattr $C$DW$1699, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
	.dwattr $C$DW$1699, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1699, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1699, DW_AT_decl_line(0x3a1)
	.dwattr $C$DW$1699, DW_AT_decl_column(0x12)

$C$DW$1700	.dwtag  DW_TAG_member
	.dwattr $C$DW$1700, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1700, DW_AT_name("COMP2")
	.dwattr $C$DW$1700, DW_AT_TI_symbol_name("COMP2")
	.dwattr $C$DW$1700, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
	.dwattr $C$DW$1700, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1700, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1700, DW_AT_decl_line(0x3a2)
	.dwattr $C$DW$1700, DW_AT_decl_column(0x12)

$C$DW$1701	.dwtag  DW_TAG_member
	.dwattr $C$DW$1701, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1701, DW_AT_name("MASK2")
	.dwattr $C$DW$1701, DW_AT_TI_symbol_name("MASK2")
	.dwattr $C$DW$1701, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
	.dwattr $C$DW$1701, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1701, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1701, DW_AT_decl_line(0x3a3)
	.dwattr $C$DW$1701, DW_AT_decl_column(0x12)

$C$DW$1702	.dwtag  DW_TAG_member
	.dwattr $C$DW$1702, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1702, DW_AT_name("FUNCTION2")
	.dwattr $C$DW$1702, DW_AT_TI_symbol_name("FUNCTION2")
	.dwattr $C$DW$1702, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
	.dwattr $C$DW$1702, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1702, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1702, DW_AT_decl_line(0x3a4)
	.dwattr $C$DW$1702, DW_AT_decl_column(0x12)

$C$DW$1703	.dwtag  DW_TAG_member
	.dwattr $C$DW$1703, DW_AT_type(*$C$DW$T$45)
	.dwattr $C$DW$1703, DW_AT_name("RESERVED2")
	.dwattr $C$DW$1703, DW_AT_TI_symbol_name("RESERVED2")
	.dwattr $C$DW$1703, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
	.dwattr $C$DW$1703, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1703, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1703, DW_AT_decl_line(0x3a5)
	.dwattr $C$DW$1703, DW_AT_decl_column(0x12)

$C$DW$1704	.dwtag  DW_TAG_member
	.dwattr $C$DW$1704, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1704, DW_AT_name("COMP3")
	.dwattr $C$DW$1704, DW_AT_TI_symbol_name("COMP3")
	.dwattr $C$DW$1704, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
	.dwattr $C$DW$1704, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1704, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1704, DW_AT_decl_line(0x3a6)
	.dwattr $C$DW$1704, DW_AT_decl_column(0x12)

$C$DW$1705	.dwtag  DW_TAG_member
	.dwattr $C$DW$1705, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1705, DW_AT_name("MASK3")
	.dwattr $C$DW$1705, DW_AT_TI_symbol_name("MASK3")
	.dwattr $C$DW$1705, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
	.dwattr $C$DW$1705, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1705, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1705, DW_AT_decl_line(0x3a7)
	.dwattr $C$DW$1705, DW_AT_decl_column(0x12)

$C$DW$1706	.dwtag  DW_TAG_member
	.dwattr $C$DW$1706, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1706, DW_AT_name("FUNCTION3")
	.dwattr $C$DW$1706, DW_AT_TI_symbol_name("FUNCTION3")
	.dwattr $C$DW$1706, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
	.dwattr $C$DW$1706, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1706, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1706, DW_AT_decl_line(0x3a8)
	.dwattr $C$DW$1706, DW_AT_decl_column(0x12)

	.dwattr $C$DW$T$56, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$T$56, DW_AT_decl_line(0x391)
	.dwattr $C$DW$T$56, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$56

$C$DW$T$211	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$211, DW_AT_name("DWT_Type")
	.dwattr $C$DW$T$211, DW_AT_type(*$C$DW$T$56)
	.dwattr $C$DW$T$211, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$211, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$T$211, DW_AT_decl_line(0x3a9)
	.dwattr $C$DW$T$211, DW_AT_decl_column(0x03)


$C$DW$T$63	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$63, DW_AT_byte_size(0xfd0)
$C$DW$1707	.dwtag  DW_TAG_member
	.dwattr $C$DW$1707, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1707, DW_AT_name("SSPSR")
	.dwattr $C$DW$1707, DW_AT_TI_symbol_name("SSPSR")
	.dwattr $C$DW$1707, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1707, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1707, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1707, DW_AT_decl_line(0x425)
	.dwattr $C$DW$1707, DW_AT_decl_column(0x12)

$C$DW$1708	.dwtag  DW_TAG_member
	.dwattr $C$DW$1708, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1708, DW_AT_name("CSPSR")
	.dwattr $C$DW$1708, DW_AT_TI_symbol_name("CSPSR")
	.dwattr $C$DW$1708, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1708, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1708, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1708, DW_AT_decl_line(0x426)
	.dwattr $C$DW$1708, DW_AT_decl_column(0x12)

$C$DW$1709	.dwtag  DW_TAG_member
	.dwattr $C$DW$1709, DW_AT_type(*$C$DW$T$57)
	.dwattr $C$DW$1709, DW_AT_name("RESERVED0")
	.dwattr $C$DW$1709, DW_AT_TI_symbol_name("RESERVED0")
	.dwattr $C$DW$1709, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1709, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1709, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1709, DW_AT_decl_line(0x427)
	.dwattr $C$DW$1709, DW_AT_decl_column(0x12)

$C$DW$1710	.dwtag  DW_TAG_member
	.dwattr $C$DW$1710, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1710, DW_AT_name("ACPR")
	.dwattr $C$DW$1710, DW_AT_TI_symbol_name("ACPR")
	.dwattr $C$DW$1710, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1710, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1710, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1710, DW_AT_decl_line(0x428)
	.dwattr $C$DW$1710, DW_AT_decl_column(0x12)

$C$DW$1711	.dwtag  DW_TAG_member
	.dwattr $C$DW$1711, DW_AT_type(*$C$DW$T$58)
	.dwattr $C$DW$1711, DW_AT_name("RESERVED1")
	.dwattr $C$DW$1711, DW_AT_TI_symbol_name("RESERVED1")
	.dwattr $C$DW$1711, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$1711, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1711, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1711, DW_AT_decl_line(0x429)
	.dwattr $C$DW$1711, DW_AT_decl_column(0x12)

$C$DW$1712	.dwtag  DW_TAG_member
	.dwattr $C$DW$1712, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1712, DW_AT_name("SPPR")
	.dwattr $C$DW$1712, DW_AT_TI_symbol_name("SPPR")
	.dwattr $C$DW$1712, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
	.dwattr $C$DW$1712, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1712, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1712, DW_AT_decl_line(0x42a)
	.dwattr $C$DW$1712, DW_AT_decl_column(0x12)

$C$DW$1713	.dwtag  DW_TAG_member
	.dwattr $C$DW$1713, DW_AT_type(*$C$DW$T$59)
	.dwattr $C$DW$1713, DW_AT_name("RESERVED2")
	.dwattr $C$DW$1713, DW_AT_TI_symbol_name("RESERVED2")
	.dwattr $C$DW$1713, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
	.dwattr $C$DW$1713, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1713, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1713, DW_AT_decl_line(0x42b)
	.dwattr $C$DW$1713, DW_AT_decl_column(0x12)

$C$DW$1714	.dwtag  DW_TAG_member
	.dwattr $C$DW$1714, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$1714, DW_AT_name("FFSR")
	.dwattr $C$DW$1714, DW_AT_TI_symbol_name("FFSR")
	.dwattr $C$DW$1714, DW_AT_data_member_location[DW_OP_plus_uconst 0x300]
	.dwattr $C$DW$1714, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1714, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1714, DW_AT_decl_line(0x42c)
	.dwattr $C$DW$1714, DW_AT_decl_column(0x12)

$C$DW$1715	.dwtag  DW_TAG_member
	.dwattr $C$DW$1715, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1715, DW_AT_name("FFCR")
	.dwattr $C$DW$1715, DW_AT_TI_symbol_name("FFCR")
	.dwattr $C$DW$1715, DW_AT_data_member_location[DW_OP_plus_uconst 0x304]
	.dwattr $C$DW$1715, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1715, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1715, DW_AT_decl_line(0x42d)
	.dwattr $C$DW$1715, DW_AT_decl_column(0x12)

$C$DW$1716	.dwtag  DW_TAG_member
	.dwattr $C$DW$1716, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$1716, DW_AT_name("FSCR")
	.dwattr $C$DW$1716, DW_AT_TI_symbol_name("FSCR")
	.dwattr $C$DW$1716, DW_AT_data_member_location[DW_OP_plus_uconst 0x308]
	.dwattr $C$DW$1716, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1716, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1716, DW_AT_decl_line(0x42e)
	.dwattr $C$DW$1716, DW_AT_decl_column(0x12)

$C$DW$1717	.dwtag  DW_TAG_member
	.dwattr $C$DW$1717, DW_AT_type(*$C$DW$T$60)
	.dwattr $C$DW$1717, DW_AT_name("RESERVED3")
	.dwattr $C$DW$1717, DW_AT_TI_symbol_name("RESERVED3")
	.dwattr $C$DW$1717, DW_AT_data_member_location[DW_OP_plus_uconst 0x30c]
	.dwattr $C$DW$1717, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1717, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1717, DW_AT_decl_line(0x42f)
	.dwattr $C$DW$1717, DW_AT_decl_column(0x12)

$C$DW$1718	.dwtag  DW_TAG_member
	.dwattr $C$DW$1718, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$1718, DW_AT_name("TRIGGER")
	.dwattr $C$DW$1718, DW_AT_TI_symbol_name("TRIGGER")
	.dwattr $C$DW$1718, DW_AT_data_member_location[DW_OP_plus_uconst 0xee8]
	.dwattr $C$DW$1718, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1718, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1718, DW_AT_decl_line(0x430)
	.dwattr $C$DW$1718, DW_AT_decl_column(0x12)

$C$DW$1719	.dwtag  DW_TAG_member
	.dwattr $C$DW$1719, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$1719, DW_AT_name("FIFO0")
	.dwattr $C$DW$1719, DW_AT_TI_symbol_name("FIFO0")
	.dwattr $C$DW$1719, DW_AT_data_member_location[DW_OP_plus_uconst 0xeec]
	.dwattr $C$DW$1719, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1719, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1719, DW_AT_decl_line(0x431)
	.dwattr $C$DW$1719, DW_AT_decl_column(0x12)

$C$DW$1720	.dwtag  DW_TAG_member
	.dwattr $C$DW$1720, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$1720, DW_AT_name("ITATBCTR2")
	.dwattr $C$DW$1720, DW_AT_TI_symbol_name("ITATBCTR2")
	.dwattr $C$DW$1720, DW_AT_data_member_location[DW_OP_plus_uconst 0xef0]
	.dwattr $C$DW$1720, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1720, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1720, DW_AT_decl_line(0x432)
	.dwattr $C$DW$1720, DW_AT_decl_column(0x12)

$C$DW$1721	.dwtag  DW_TAG_member
	.dwattr $C$DW$1721, DW_AT_type(*$C$DW$T$45)
	.dwattr $C$DW$1721, DW_AT_name("RESERVED4")
	.dwattr $C$DW$1721, DW_AT_TI_symbol_name("RESERVED4")
	.dwattr $C$DW$1721, DW_AT_data_member_location[DW_OP_plus_uconst 0xef4]
	.dwattr $C$DW$1721, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1721, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1721, DW_AT_decl_line(0x433)
	.dwattr $C$DW$1721, DW_AT_decl_column(0x12)

$C$DW$1722	.dwtag  DW_TAG_member
	.dwattr $C$DW$1722, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$1722, DW_AT_name("ITATBCTR0")
	.dwattr $C$DW$1722, DW_AT_TI_symbol_name("ITATBCTR0")
	.dwattr $C$DW$1722, DW_AT_data_member_location[DW_OP_plus_uconst 0xef8]
	.dwattr $C$DW$1722, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1722, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1722, DW_AT_decl_line(0x434)
	.dwattr $C$DW$1722, DW_AT_decl_column(0x12)

$C$DW$1723	.dwtag  DW_TAG_member
	.dwattr $C$DW$1723, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$1723, DW_AT_name("FIFO1")
	.dwattr $C$DW$1723, DW_AT_TI_symbol_name("FIFO1")
	.dwattr $C$DW$1723, DW_AT_data_member_location[DW_OP_plus_uconst 0xefc]
	.dwattr $C$DW$1723, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1723, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1723, DW_AT_decl_line(0x435)
	.dwattr $C$DW$1723, DW_AT_decl_column(0x12)

$C$DW$1724	.dwtag  DW_TAG_member
	.dwattr $C$DW$1724, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1724, DW_AT_name("ITCTRL")
	.dwattr $C$DW$1724, DW_AT_TI_symbol_name("ITCTRL")
	.dwattr $C$DW$1724, DW_AT_data_member_location[DW_OP_plus_uconst 0xf00]
	.dwattr $C$DW$1724, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1724, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1724, DW_AT_decl_line(0x436)
	.dwattr $C$DW$1724, DW_AT_decl_column(0x12)

$C$DW$1725	.dwtag  DW_TAG_member
	.dwattr $C$DW$1725, DW_AT_type(*$C$DW$T$61)
	.dwattr $C$DW$1725, DW_AT_name("RESERVED5")
	.dwattr $C$DW$1725, DW_AT_TI_symbol_name("RESERVED5")
	.dwattr $C$DW$1725, DW_AT_data_member_location[DW_OP_plus_uconst 0xf04]
	.dwattr $C$DW$1725, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1725, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1725, DW_AT_decl_line(0x437)
	.dwattr $C$DW$1725, DW_AT_decl_column(0x12)

$C$DW$1726	.dwtag  DW_TAG_member
	.dwattr $C$DW$1726, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1726, DW_AT_name("CLAIMSET")
	.dwattr $C$DW$1726, DW_AT_TI_symbol_name("CLAIMSET")
	.dwattr $C$DW$1726, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa0]
	.dwattr $C$DW$1726, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1726, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1726, DW_AT_decl_line(0x438)
	.dwattr $C$DW$1726, DW_AT_decl_column(0x12)

$C$DW$1727	.dwtag  DW_TAG_member
	.dwattr $C$DW$1727, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1727, DW_AT_name("CLAIMCLR")
	.dwattr $C$DW$1727, DW_AT_TI_symbol_name("CLAIMCLR")
	.dwattr $C$DW$1727, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa4]
	.dwattr $C$DW$1727, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1727, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1727, DW_AT_decl_line(0x439)
	.dwattr $C$DW$1727, DW_AT_decl_column(0x12)

$C$DW$1728	.dwtag  DW_TAG_member
	.dwattr $C$DW$1728, DW_AT_type(*$C$DW$T$62)
	.dwattr $C$DW$1728, DW_AT_name("RESERVED7")
	.dwattr $C$DW$1728, DW_AT_TI_symbol_name("RESERVED7")
	.dwattr $C$DW$1728, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa8]
	.dwattr $C$DW$1728, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1728, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1728, DW_AT_decl_line(0x43a)
	.dwattr $C$DW$1728, DW_AT_decl_column(0x12)

$C$DW$1729	.dwtag  DW_TAG_member
	.dwattr $C$DW$1729, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$1729, DW_AT_name("DEVID")
	.dwattr $C$DW$1729, DW_AT_TI_symbol_name("DEVID")
	.dwattr $C$DW$1729, DW_AT_data_member_location[DW_OP_plus_uconst 0xfc8]
	.dwattr $C$DW$1729, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1729, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1729, DW_AT_decl_line(0x43b)
	.dwattr $C$DW$1729, DW_AT_decl_column(0x12)

$C$DW$1730	.dwtag  DW_TAG_member
	.dwattr $C$DW$1730, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$1730, DW_AT_name("DEVTYPE")
	.dwattr $C$DW$1730, DW_AT_TI_symbol_name("DEVTYPE")
	.dwattr $C$DW$1730, DW_AT_data_member_location[DW_OP_plus_uconst 0xfcc]
	.dwattr $C$DW$1730, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1730, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1730, DW_AT_decl_line(0x43c)
	.dwattr $C$DW$1730, DW_AT_decl_column(0x12)

	.dwattr $C$DW$T$63, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$T$63, DW_AT_decl_line(0x424)
	.dwattr $C$DW$T$63, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$63

$C$DW$T$212	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$212, DW_AT_name("TPI_Type")
	.dwattr $C$DW$T$212, DW_AT_type(*$C$DW$T$63)
	.dwattr $C$DW$T$212, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$212, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$T$212, DW_AT_decl_line(0x43d)
	.dwattr $C$DW$T$212, DW_AT_decl_column(0x03)


$C$DW$T$64	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$64, DW_AT_byte_size(0x2c)
$C$DW$1731	.dwtag  DW_TAG_member
	.dwattr $C$DW$1731, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$1731, DW_AT_name("TYPE")
	.dwattr $C$DW$1731, DW_AT_TI_symbol_name("TYPE")
	.dwattr $C$DW$1731, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1731, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1731, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1731, DW_AT_decl_line(0x4c1)
	.dwattr $C$DW$1731, DW_AT_decl_column(0x12)

$C$DW$1732	.dwtag  DW_TAG_member
	.dwattr $C$DW$1732, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1732, DW_AT_name("CTRL")
	.dwattr $C$DW$1732, DW_AT_TI_symbol_name("CTRL")
	.dwattr $C$DW$1732, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1732, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1732, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1732, DW_AT_decl_line(0x4c2)
	.dwattr $C$DW$1732, DW_AT_decl_column(0x12)

$C$DW$1733	.dwtag  DW_TAG_member
	.dwattr $C$DW$1733, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1733, DW_AT_name("RNR")
	.dwattr $C$DW$1733, DW_AT_TI_symbol_name("RNR")
	.dwattr $C$DW$1733, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1733, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1733, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1733, DW_AT_decl_line(0x4c3)
	.dwattr $C$DW$1733, DW_AT_decl_column(0x12)

$C$DW$1734	.dwtag  DW_TAG_member
	.dwattr $C$DW$1734, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1734, DW_AT_name("RBAR")
	.dwattr $C$DW$1734, DW_AT_TI_symbol_name("RBAR")
	.dwattr $C$DW$1734, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1734, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1734, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1734, DW_AT_decl_line(0x4c4)
	.dwattr $C$DW$1734, DW_AT_decl_column(0x12)

$C$DW$1735	.dwtag  DW_TAG_member
	.dwattr $C$DW$1735, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1735, DW_AT_name("RASR")
	.dwattr $C$DW$1735, DW_AT_TI_symbol_name("RASR")
	.dwattr $C$DW$1735, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1735, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1735, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1735, DW_AT_decl_line(0x4c5)
	.dwattr $C$DW$1735, DW_AT_decl_column(0x12)

$C$DW$1736	.dwtag  DW_TAG_member
	.dwattr $C$DW$1736, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1736, DW_AT_name("RBAR_A1")
	.dwattr $C$DW$1736, DW_AT_TI_symbol_name("RBAR_A1")
	.dwattr $C$DW$1736, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$1736, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1736, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1736, DW_AT_decl_line(0x4c6)
	.dwattr $C$DW$1736, DW_AT_decl_column(0x12)

$C$DW$1737	.dwtag  DW_TAG_member
	.dwattr $C$DW$1737, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1737, DW_AT_name("RASR_A1")
	.dwattr $C$DW$1737, DW_AT_TI_symbol_name("RASR_A1")
	.dwattr $C$DW$1737, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$1737, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1737, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1737, DW_AT_decl_line(0x4c7)
	.dwattr $C$DW$1737, DW_AT_decl_column(0x12)

$C$DW$1738	.dwtag  DW_TAG_member
	.dwattr $C$DW$1738, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1738, DW_AT_name("RBAR_A2")
	.dwattr $C$DW$1738, DW_AT_TI_symbol_name("RBAR_A2")
	.dwattr $C$DW$1738, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$1738, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1738, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1738, DW_AT_decl_line(0x4c8)
	.dwattr $C$DW$1738, DW_AT_decl_column(0x12)

$C$DW$1739	.dwtag  DW_TAG_member
	.dwattr $C$DW$1739, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1739, DW_AT_name("RASR_A2")
	.dwattr $C$DW$1739, DW_AT_TI_symbol_name("RASR_A2")
	.dwattr $C$DW$1739, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$1739, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1739, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1739, DW_AT_decl_line(0x4c9)
	.dwattr $C$DW$1739, DW_AT_decl_column(0x12)

$C$DW$1740	.dwtag  DW_TAG_member
	.dwattr $C$DW$1740, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1740, DW_AT_name("RBAR_A3")
	.dwattr $C$DW$1740, DW_AT_TI_symbol_name("RBAR_A3")
	.dwattr $C$DW$1740, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$1740, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1740, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1740, DW_AT_decl_line(0x4ca)
	.dwattr $C$DW$1740, DW_AT_decl_column(0x12)

$C$DW$1741	.dwtag  DW_TAG_member
	.dwattr $C$DW$1741, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1741, DW_AT_name("RASR_A3")
	.dwattr $C$DW$1741, DW_AT_TI_symbol_name("RASR_A3")
	.dwattr $C$DW$1741, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$1741, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1741, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1741, DW_AT_decl_line(0x4cb)
	.dwattr $C$DW$1741, DW_AT_decl_column(0x12)

	.dwattr $C$DW$T$64, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$T$64, DW_AT_decl_line(0x4c0)
	.dwattr $C$DW$T$64, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$64

$C$DW$T$213	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$213, DW_AT_name("MPU_Type")
	.dwattr $C$DW$T$213, DW_AT_type(*$C$DW$T$64)
	.dwattr $C$DW$T$213, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$213, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$T$213, DW_AT_decl_line(0x4cc)
	.dwattr $C$DW$T$213, DW_AT_decl_column(0x03)


$C$DW$T$65	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$65, DW_AT_byte_size(0x18)
$C$DW$1742	.dwtag  DW_TAG_member
	.dwattr $C$DW$1742, DW_AT_type(*$C$DW$T$45)
	.dwattr $C$DW$1742, DW_AT_name("RESERVED0")
	.dwattr $C$DW$1742, DW_AT_TI_symbol_name("RESERVED0")
	.dwattr $C$DW$1742, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1742, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1742, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1742, DW_AT_decl_line(0x51f)
	.dwattr $C$DW$1742, DW_AT_decl_column(0x12)

$C$DW$1743	.dwtag  DW_TAG_member
	.dwattr $C$DW$1743, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1743, DW_AT_name("FPCCR")
	.dwattr $C$DW$1743, DW_AT_TI_symbol_name("FPCCR")
	.dwattr $C$DW$1743, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1743, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1743, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1743, DW_AT_decl_line(0x520)
	.dwattr $C$DW$1743, DW_AT_decl_column(0x12)

$C$DW$1744	.dwtag  DW_TAG_member
	.dwattr $C$DW$1744, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1744, DW_AT_name("FPCAR")
	.dwattr $C$DW$1744, DW_AT_TI_symbol_name("FPCAR")
	.dwattr $C$DW$1744, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1744, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1744, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1744, DW_AT_decl_line(0x521)
	.dwattr $C$DW$1744, DW_AT_decl_column(0x12)

$C$DW$1745	.dwtag  DW_TAG_member
	.dwattr $C$DW$1745, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1745, DW_AT_name("FPDSCR")
	.dwattr $C$DW$1745, DW_AT_TI_symbol_name("FPDSCR")
	.dwattr $C$DW$1745, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1745, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1745, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1745, DW_AT_decl_line(0x522)
	.dwattr $C$DW$1745, DW_AT_decl_column(0x12)

$C$DW$1746	.dwtag  DW_TAG_member
	.dwattr $C$DW$1746, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$1746, DW_AT_name("MVFR0")
	.dwattr $C$DW$1746, DW_AT_TI_symbol_name("MVFR0")
	.dwattr $C$DW$1746, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1746, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1746, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1746, DW_AT_decl_line(0x523)
	.dwattr $C$DW$1746, DW_AT_decl_column(0x12)

$C$DW$1747	.dwtag  DW_TAG_member
	.dwattr $C$DW$1747, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$1747, DW_AT_name("MVFR1")
	.dwattr $C$DW$1747, DW_AT_TI_symbol_name("MVFR1")
	.dwattr $C$DW$1747, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$1747, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1747, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1747, DW_AT_decl_line(0x524)
	.dwattr $C$DW$1747, DW_AT_decl_column(0x12)

	.dwattr $C$DW$T$65, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$T$65, DW_AT_decl_line(0x51e)
	.dwattr $C$DW$T$65, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$65

$C$DW$T$214	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$214, DW_AT_name("FPU_Type")
	.dwattr $C$DW$T$214, DW_AT_type(*$C$DW$T$65)
	.dwattr $C$DW$T$214, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$214, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$T$214, DW_AT_decl_line(0x525)
	.dwattr $C$DW$T$214, DW_AT_decl_column(0x03)


$C$DW$T$66	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$66, DW_AT_byte_size(0x10)
$C$DW$1748	.dwtag  DW_TAG_member
	.dwattr $C$DW$1748, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1748, DW_AT_name("DHCSR")
	.dwattr $C$DW$1748, DW_AT_TI_symbol_name("DHCSR")
	.dwattr $C$DW$1748, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1748, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1748, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1748, DW_AT_decl_line(0x589)
	.dwattr $C$DW$1748, DW_AT_decl_column(0x12)

$C$DW$1749	.dwtag  DW_TAG_member
	.dwattr $C$DW$1749, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1749, DW_AT_name("DCRSR")
	.dwattr $C$DW$1749, DW_AT_TI_symbol_name("DCRSR")
	.dwattr $C$DW$1749, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1749, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1749, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1749, DW_AT_decl_line(0x58a)
	.dwattr $C$DW$1749, DW_AT_decl_column(0x12)

$C$DW$1750	.dwtag  DW_TAG_member
	.dwattr $C$DW$1750, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1750, DW_AT_name("DCRDR")
	.dwattr $C$DW$1750, DW_AT_TI_symbol_name("DCRDR")
	.dwattr $C$DW$1750, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1750, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1750, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1750, DW_AT_decl_line(0x58b)
	.dwattr $C$DW$1750, DW_AT_decl_column(0x12)

$C$DW$1751	.dwtag  DW_TAG_member
	.dwattr $C$DW$1751, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1751, DW_AT_name("DEMCR")
	.dwattr $C$DW$1751, DW_AT_TI_symbol_name("DEMCR")
	.dwattr $C$DW$1751, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1751, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1751, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$1751, DW_AT_decl_line(0x58c)
	.dwattr $C$DW$1751, DW_AT_decl_column(0x12)

	.dwattr $C$DW$T$66, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$T$66, DW_AT_decl_line(0x588)
	.dwattr $C$DW$T$66, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$66

$C$DW$T$215	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$215, DW_AT_name("CoreDebug_Type")
	.dwattr $C$DW$T$215, DW_AT_type(*$C$DW$T$66)
	.dwattr $C$DW$T$215, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$215, DW_AT_decl_file("C:/ti/ccsv8/ccs_base/arm/include/CMSIS/core_cm4.h")
	.dwattr $C$DW$T$215, DW_AT_decl_line(0x58d)
	.dwattr $C$DW$T$215, DW_AT_decl_column(0x03)


$C$DW$T$69	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$69, DW_AT_byte_size(0x158)
$C$DW$1752	.dwtag  DW_TAG_member
	.dwattr $C$DW$1752, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1752, DW_AT_name("CTL0")
	.dwattr $C$DW$1752, DW_AT_TI_symbol_name("CTL0")
	.dwattr $C$DW$1752, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1752, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1752, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_1_60_00_12\source\ti\devices\msp432p4xx\inc\msp432p401r.h")
	.dwattr $C$DW$1752, DW_AT_decl_line(0x16d)
	.dwattr $C$DW$1752, DW_AT_decl_column(0x11)

$C$DW$1753	.dwtag  DW_TAG_member
	.dwattr $C$DW$1753, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1753, DW_AT_name("CTL1")
	.dwattr $C$DW$1753, DW_AT_TI_symbol_name("CTL1")
	.dwattr $C$DW$1753, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1753, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1753, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_1_60_00_12\source\ti\devices\msp432p4xx\inc\msp432p401r.h")
	.dwattr $C$DW$1753, DW_AT_decl_line(0x16e)
	.dwattr $C$DW$1753, DW_AT_decl_column(0x11)

$C$DW$1754	.dwtag  DW_TAG_member
	.dwattr $C$DW$1754, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1754, DW_AT_name("LO0")
	.dwattr $C$DW$1754, DW_AT_TI_symbol_name("LO0")
	.dwattr $C$DW$1754, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1754, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1754, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_1_60_00_12\source\ti\devices\msp432p4xx\inc\msp432p401r.h")
	.dwattr $C$DW$1754, DW_AT_decl_line(0x16f)
	.dwattr $C$DW$1754, DW_AT_decl_column(0x11)

$C$DW$1755	.dwtag  DW_TAG_member
	.dwattr $C$DW$1755, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1755, DW_AT_name("HI0")
	.dwattr $C$DW$1755, DW_AT_TI_symbol_name("HI0")
	.dwattr $C$DW$1755, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1755, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1755, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_1_60_00_12\source\ti\devices\msp432p4xx\inc\msp432p401r.h")
	.dwattr $C$DW$1755, DW_AT_decl_line(0x170)
	.dwattr $C$DW$1755, DW_AT_decl_column(0x11)

$C$DW$1756	.dwtag  DW_TAG_member
	.dwattr $C$DW$1756, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1756, DW_AT_name("LO1")
	.dwattr $C$DW$1756, DW_AT_TI_symbol_name("LO1")
	.dwattr $C$DW$1756, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1756, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1756, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_1_60_00_12\source\ti\devices\msp432p4xx\inc\msp432p401r.h")
	.dwattr $C$DW$1756, DW_AT_decl_line(0x171)
	.dwattr $C$DW$1756, DW_AT_decl_column(0x11)

$C$DW$1757	.dwtag  DW_TAG_member
	.dwattr $C$DW$1757, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1757, DW_AT_name("HI1")
	.dwattr $C$DW$1757, DW_AT_TI_symbol_name("HI1")
	.dwattr $C$DW$1757, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$1757, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1757, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_1_60_00_12\source\ti\devices\msp432p4xx\inc\msp432p401r.h")
	.dwattr $C$DW$1757, DW_AT_decl_line(0x172)
	.dwattr $C$DW$1757, DW_AT_decl_column(0x11)

